/*
 * WARNING: This file is automatically generated. DO NOT MODIFY unless you know what you're doing.
 *
 * If you wish to regenerate this file because of a game update use the ZHM Mod SDK CodeGen mod:
 * https://github.com/OrfeasZ/ZHMModSDK
 */

#pragma once

#include <ZHM/ZHMPrimitives.h>
#include <ZHM/ZHMTypeInfo.h>

class ZHMTypeInfo;

// Size: 0x4
enum class ZFriskSuspectGroup_EAssistantState
{
	AS_Waiting = 0,
	AS_Approach = 1,
	AS_Approaching = 2,
	AS_Covering = 3,
};

// Size: 0x4
enum class ZRenderPostfilterParametersEntity_EHDRGlareType
{
	eCamera = 0,
	eNatural = 1,
	eCheapLens = 2,
	eFilterCrossScreen = 3,
	eFilterCrossScreenSpectral = 4,
	eFilterSnowCross = 5,
	eFilterSnowCrossSpectral = 6,
	eFilterSunnyCross = 7,
	eFilterSunnyCrossSpectral = 8,
	eCinecamVerticalSlits = 9,
	eCinecamHorizontalSlits = 10,
};

// Size: 0x4
enum class ZOperatorBool_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
};

// Size: 0x4
enum class EGSKillSituation
{
	GSKILLSITUATION_UNKNOWN = 0,
	GSKILLSITUATION_CLOSECOMBAT = 1,
	GSKILLSITUATION_SILENT = 2,
	GSKILLSITUATION_ENVIRONMENT = 3,
	GSKILLSITUATION_ACTION = 4,
	GSKILLSITUATION_DEADLYTHROW = 5,
	GSKILLSITUATION_PULLTHROUGHWINDOW = 6,
	GSKILLSITUATION_PUSHOVERRAILING = 7,
	GSKILLSITUATION_PACIFY = 8,
	GSKILLSITUATION_FIBERWIRE = 9,
};

// Size: 0x4
enum class ZCautiousInvestigateGroup_EApproachOrderState
{
	AOS_RequestHuntApproachNode = 0,
	AOS_RequestLeaderApproachNode = 1,
	AOS_WaitForApproachNode = 2,
	AOS_RequestLOSNode = 3,
	AOS_Ready = 4,
	AOS_NoApproachNode = 5,
};

// Size: 0x4
enum class EGSEvent
{
	GSEvent_StrayBullet = 0,
	GSEvent_TookDamage = 1,
	GSEvent_UsedCover = 2,
	GSEvent_UsedRun = 3,
	GSEvent_UsedEliminate = 4,
	GSEvent_UsedChokeOut = 5,
	GSEvent_UsedKnockOutByHand = 6,
	GSEvent_Pacified = 7,
	GSEvent_TargetPacified = 8,
	GSEvent_Recover = 9,
	GSEvent_CaughtArmed = 10,
	GSEvent_BodyFound = 11,
	GSEvent_InvestigateCurious = 12,
	GSEvent_NPCKilled = 13,
	GSEvent_KilledNPCHidden = 14,
	GSEvent_InvestigateCautious = 15,
	GSEvent_PrecisionAimedKill = 16,
	GSEvent_BlendInActivated = 17,
	GSEvent_PropKill = 18,
	GSEvent_SpottedThroughDisguise = 19,
	GSEvent_TakeOutNonLethal = 20,
	GSEvent_TargetKilled = 21,
	GSEvent_NonTargetKilled = 22,
	GSEvent_AllTargetsKilled = 23,
	GSEvent_AccidentKill = 24,
	GSEvent_ObjectiveUpdate = 25,
	GSEvent_TargetAccidentKill = 26,
	GSEvent_ObjectiveActivate = 27,
	GSEvent_Headshot = 28,
	GSEvent_Fiberwire = 29,
	GSEvent_UsedEliminateSilent = 30,
	GSEvent_ItemFound = 31,
	GSEvent_ItemStashed = 32,
	GSEvent_BodyBagPlaced = 33,
	GSEvent_Projectile_HeadShot = 34,
	GSEvent_Projectile_BodyShot = 35,
	GSEvent_Projectile_Crowd_HeadShot = 36,
	GSEvent_Projectile_Crowd_BodyShot = 37,
	GSEvent_Projectile_Missed = 38,
	GSEvent_Projectile_MultiKillTargets = 39,
};

// Size: 0x4
enum class EAISharedEventType
{
	AISET_None = 0,
	AISET_StandOffCrowdReactionDone = 1,
	AISET_Shoot = 2,
	AISET_ShootBlind = 3,
	AISET_Scared = 4,
	AISET_CloseCombatRunIn = 5,
	AISET_CloseCombatArrest = 6,
	AISET_ReadyForCloseCombatArrest = 7,
	AISET_DeadByAccident = 8,
	AISET_SituationConversation = 9,
	AISET_LAST_BOOLEAN_EVENT = 10,
	AISET_IllegalBehavior = 11,
	AISET_BeingWatched = 12,
	AISET_Sneaking = 13,
	AISET_Squatting = 14,
	AISET_Agility = 15,
	AISET_IllegalAgility = 16,
	AISET_ChangingOutfit = 17,
	AISET_ChangedOutfit = 18,
	AISET_CoverToCover = 19,
	AISET_Trespassing = 20,
	AISET_InTrespassZone = 21,
	AISET_InDisguiseZone = 22,
	AISET_DraggingBody = 23,
	AISET_KillingWithFiberwire = 24,
	AISET_KillingWithPull = 25,
	AISET_KillingWithPush = 26,
	AISET_KillingWithKick = 27,
	AISET_KillingWithKnife = 28,
	AISET_KillingWithDeadlyThrow = 29,
	AISET_PullingFromLedge = 30,
	AISET_PacifyingWithPull = 31,
	AISET_PacifyingWithPush = 32,
	AISET_PacifyingWithKick = 33,
	AISET_PacifyingWithKnockDownThrow = 34,
	AISET_PacifyingWithStrangle = 35,
	AISET_PacifyingWithKnife = 36,
	AISET_ThrowingSomething = 37,
	AISET_ThrowingExplosives = 38,
	AISET_KnockingDown = 39,
	AISET_InCloset = 40,
	AISET_InNpcUnreachableArea = 41,
	AISET_Peeking = 42,
	AISET_EnteringCloset = 43,
	AISET_ExitingCloset = 44,
	AISET_InCover = 45,
	AISET_MovingInCover = 46,
	AISET_HiddenInCover = 47,
	AISET_HasWeapon = 48,
	AISET_WeaponEquipped = 49,
	AISET_WeaponFired = 50,
	AISET_WeaponReloading = 51,
	AISET_Aiming = 52,
	AISET_GuardDisguise = 53,
	AISET_PulledByHitmanOnLedge = 54,
	AISET_CombatNoHold = 55,
	AISET_CombatFireAtWill = 56,
	AISET_InOrderedPosition = 57,
	AISET_ORDERS_BEGIN = 58,
	AISET_Order_Act = 59,
	AISET_Order_Investigate = 60,
	AISET_Order_SearchPosition = 61,
	AISET_Order_Approach = 62,
	AISET_Order_GetHelp = 63,
	AISET_Order_StandDown = 64,
	AISET_Order_Escalate = 65,
	AISET_Order_Arrest = 66,
	AISET_Order_Avoid = 67,
	AISET_Order_Flee = 68,
	AISET_Order_Patrol = 69,
	AISET_Order_Reposition = 70,
	AISET_Order_Chase = 71,
	AISET_Order_AimFromPosition = 72,
	AISET_Order_HoldPosition = 73,
	AISET_Order_HoldCoverPosition = 74,
	AISET_Order_FightFromCover = 75,
	AISET_Order_FightFromPosition = 76,
	AISET_Order_ShootFromPosition = 77,
	AISET_Order_GuardPosition = 78,
	AISET_Order_GuardBody = 79,
	AISET_Order_WakeUpUnconscious = 80,
	AISET_Order_DragBody = 81,
	AISET_Order_TriggerAlarm = 82,
	AISET_Order_DispatchSuspectInfo = 83,
	AISET_Order_RecieveSuspectInfo = 84,
	AISET_Order_RequestBackup = 85,
	AISET_Order_ThrowFlashGrenade = 86,
	AISET_Order_CheckLastPosition = 87,
	AISET_Order_StandoffLastWarning = 88,
	AISET_Order_Evacuate = 89,
	AISET_Order_AgitatedBystander = 90,
	AISET_Order_CuriousBystander = 91,
	AISET_Order_Face = 92,
	AISET_Order_Holster = 93,
	AISET_Order_Unholster = 94,
	AISET_Order_MoveTo = 95,
	AISET_Order_JumpTo = 96,
	AISET_Order_FormationMove = 97,
	AISET_Order_SentryFrisk = 98,
	AISET_Order_SentryWarning = 99,
	AISET_Order_SentryGreeting = 100,
	AISET_Order_SentryCheckItem = 101,
	AISET_Order_SentryDemandPickUpItem = 102,
	AISET_Order_DeliverWeapon = 103,
	AISET_Order_RecoverUnconscious = 104,
	AISET_Order_GetOutfit = 105,
	AISET_Order_LockdownWarning = 106,
	AISET_Order_VIPEvacuateIdle = 107,
	AISET_Order_VIPSafeRoom = 108,
	AISET_Order_VIPSafeRoomTrespasser = 109,
	AISET_Order_VIPScared = 110,
	AISET_Order_DefendVIP = 111,
	AISET_Order_CautiousVIP = 112,
	AISET_Order_CautiousGuardVIP = 113,
	AISET_Order_EscortOut = 114,
	AISET_Order_MoveInCover = 115,
	AISET_Order_MoveToCover = 116,
	AISET_Order_Conversation = 117,
	AISET_Order_AttentionToPerson = 118,
	AISET_Order_WaitForItemHandled = 119,
	AISET_ORDERS_END = 120,
	AISET_IMPULSES_BEGIN = 121,
	AISET_Impulse_ReceiveHuntTarget = 122,
	AISET_Impulse_AckHuntTarget = 123,
	AISET_Impulse_TransmitHuntTarget = 124,
	AISET_Impulse_ActiveRadioCall = 125,
	AISET_IMPULSES_END = 126,
	AISET_ForceFullAttention = 127,
	AISET_InCameraView2D = 128,
	AISET_BeingLookedAt = 129,
	AISET_BeingAimedAt = 130,
	AISET_WasAimedAtRecently = 131,
	AISET_BeingShotAt = 132,
	AISET_BeingActuallyShotAt = 133,
	AISET_BeingFlanked = 134,
	AISET_BeingBumped = 135,
	AISET_BeingEscortedOut = 136,
	AISET_EscortingOut = 137,
	AISET_EscortOutFarewell = 138,
	AISET_HMTrespassing = 139,
	AISET_HMInEntryArea = 140,
	AISET_HMTakingDamage = 141,
	AISET_HumanShield = 142,
	AISET_IllegalAction = 143,
	AISET_IllegalActionSevere = 144,
	AISET_TakingKeyCard = 145,
	AISET_TakingSecurityTape = 146,
	AISET_DumpingBody = 147,
	AISET_Shooting = 148,
	AISET_BlindFire = 149,
	AISET_ShootingBallet = 150,
	AISET_Running = 151,
	AISET_Walking = 152,
	AISET_UsingKeyCard = 153,
	AISET_WeaponDropped = 154,
	AISET_WeaponPickedUp = 155,
	AISET_ItemPickedUp = 156,
	AISET_ItemDropped = 157,
	AISET_Surrendering = 158,
	AISET_RequestSurrender = 159,
	AISET_StandOffEscalated = 160,
	AISET_StandOffInvestigateSevere = 161,
	AISET_Standing = 162,
	AISET_Enforcer = 163,
	AISET_DisguiseEnforcer = 164,
	AISET_Dead = 165,
	AISET_DeadByUnnoticed = 166,
	AISET_DeadBySniper = 167,
	AISET_InMorgue = 168,
	AISET_InAccident = 169,
	AISET_Dying = 170,
	AISET_InInvestigateDisguise = 171,
	AISET_InArrest = 172,
	AISET_Arrestor = 173,
	AISET_InCombat = 174,
	AISET_InCombatWithGuards = 175,
	AISET_Hunted = 176,
	AISET_ForceHunted = 177,
	AISET_CloseCombat = 178,
	AISET_TakingProjectileDamage = 179,
	AISET_TakingHeadshotDamage = 180,
	AISET_TakingExplosionDamage = 181,
	AISET_TakingThrowDamage = 182,
	AISET_ForceKillHM = 183,
	AISET_Armed = 184,
	AISET_BeingHumanShield = 185,
	AISET_BeingPulledOutOfWindow = 186,
	AISET_BeingPushedOverRail = 187,
	AISET_BeingFiberwired = 188,
	AISET_BeingPulledFromLedge = 189,
	AISET_BeingDragged = 190,
	AISET_OnScreen = 191,
	AISET_ExplosionImminent = 192,
	AISET_DisguiseSafeZone = 193,
	AISET_DisguiseCanBlendIn = 194,
	AISET_DisguiseBlendIn = 195,
	AISET_DisguiseBroken = 196,
	AISET_InWarZone = 197,
	AISET_HearLockdownAlarm = 198,
	AISET_InCrowd = 199,
	AISET_InCrowdHighDensity = 200,
	AISET_InCrowdAlert = 201,
	AISET_InCrowdPanic = 202,
	AISET_HiddenByCrowd = 203,
	AISET_CrowdDisguise = 204,
	AISET_BeingStrangled = 205,
	AISET_BeingSnapNecked = 206,
	AISET_BeingKnockedDown = 207,
	AISET_BeingContextKilled = 208,
	AISET_CloseCombatTakedown = 209,
	AISET_ContextKill = 210,
	AISET_ExecutePistol = 211,
	AISET_PickingUpGuardedItem = 212,
	AISET_SedativePoison = 213,
	AISET_SpawnedActor = 214,
	AISET_SoundRadio = 215,
	AISET_Weapon = 216,
	AISET_Item = 217,
	AISET_ItemThrown = 218,
	AISET_OwnedByHM = 219,
	AISET_Coin = 220,
	AISET_InLimitVisionAreaZone = 221,
	AISET_InsideLimitVisionArea = 222,
	AISET_BlockedByLimitVisionArea = 223,
	AISET_AmbientOnly = 224,
	AISET_HasBeenInCombat = 225,
	AISET_HitByItem = 226,
	AISET_CloseCombatAllowed = 227,
	AISET_CollateralTarget = 228,
	AISET_HuntAct = 229,
	AISET_Sick = 230,
	AISET_Stunned = 231,
	AISET_Naked = 232,
	AISET_Investigated = 233,
	AISET_FreshBody = 234,
	AISET_SeenDeadlyThrowVictim = 235,
	AISET_IWillBeDeadlyThrowVictim = 236,
	AISET_Suspect = 237,
	AISET_BeingFrisked = 238,
	AISET_RequestFrisk = 239,
	AISET_FriskComplying = 240,
	AISET_FriskApproachReady = 241,
	AISET_FriskReady = 242,
	AISET_Frisked = 243,
	AISET_FriskFailed = 244,
	AISET_FriskFoundWeapon = 245,
	AISET_AntiSocial = 246,
	AISET_Introvert = 247,
	AISET_InLockdownZone = 248,
	AISET_EnteringLockdownZone = 249,
	AISET_InSentryZone = 250,
	AISET_InSentryWarningZone = 251,
	AISET_InSentryFriskWarningZone = 252,
	AISET_SuppressTrespassing = 253,
	AISET_ReportedDisturbance = 254,
	AISET_InLockdown = 255,
	AISET_ToldToEvacuate = 256,
	AISET_CurrentTarget = 257,
	AISET_RequestShowItem = 258,
	AISET_RequestComplying = 259,
	AISET_WokenByNPC = 260,
	AISET_Silly = 261,
	AISET_TriggerLockDownAlarm = 262,
	AISET_CombatFromEvacuate = 263,
	AISET_DontMakeFunPlease = 264,
	AISET_TempCrowdKnowledge = 265,
	AISET_Attached = 266,
	AISET_DontReact = 267,
	AISET_Sentry = 268,
	AISET_HardSentry = 269,
	AISET_FriskingSentry = 270,
	AISET_Guarded = 271,
	AISET_CloseCombatFinisher = 272,
	AISET_WasInCloseCombatSawAggressor = 273,
	AISET_Pacified = 274,
	AISET_SomeoneIsSniping = 275,
	AISET_FlashpointSeen = 276,
	AISET_SniperLocation = 277,
	AISET_WeaponContextKnown = 278,
	AISET_Distracted = 279,
	AISET_LockedInAgility = 280,
	AISET_ActorAlreadyAlive = 281,
	AISET_DraggingBodyBag = 282,
	AISET_UncosciousBlamingFailed = 283,
	AISET_VaultingOverObstacle = 284,
	AISET_ClimbingWindow = 285,
	AISET_Combat_Brave = 286,
	AISET_Combat_OneTimeBrave = 287,
	AISET_Combat_PrimaryRange = 288,
	AISET_Combat_ThrewFlashGrenade = 289,
	AISET_Combat_CloseToGuards = 290,
	AISET_Combat_RecentlySeen = 291,
	AISET_Combat_TargetSeenAtLeastOnce = 292,
	AISET_InTheAirDeadly = 293,
	AISET_InTheAir = 294,
	AISET_Landing = 295,
	AISET_InSentrySituation = 296,
	AISET_Wounded = 297,
	AISET_RecoveredFromWounded = 298,
	AISET_ReactedToTossAlerted = 299,
	AISET_ReactedToHitAlerted = 300,
	AISET_GettingHelp = 301,
	AISET_HelpingCivilian = 302,
	AISET_InvestigatingMurder = 303,
	AISET_InvestigatingMurderOrGunshot = 304,
	AISET_InvestigateDisguiseGroupLeader = 305,
	AISET_InvestigateDisguiseMovingBack = 306,
	AISET_BodyguardVIPDead = 307,
	AISET_SilentlyKilled = 308,
	AISET_SilentlyKilling = 309,
	AISET_SoundGunShot = 310,
	AISET_SoundHitmanGunShot = 311,
	AISET_SoundHitmanGunShotSilenced = 312,
	AISET_ChangingOutfitFromBody = 313,
	AISET_SpeedBoost = 314,
	AISET_ManhuntMember = 315,
	AISET_InvestigateDisguiseMember = 316,
	AISET_EvacuateAfterRecover = 317,
	AISET_Woozy = 318,
	AISET_HasAmbientEscort = 319,
	AISET_IsEscortingVIP = 320,
	AISET_StrangleVictim = 321,
	AISET_DontStandDownIfIdling = 322,
	AISET_Jumping = 323,
	AISET_GetHelpDone = 324,
	AISET_VIPHandleOwnCuriousInvestigation = 325,
	AISET_InDangerousArea = 326,
	AISET_RadioCallHelpComming = 327,
	AISET_RadioCallHelpFailed = 328,
	AISET_RadioCallHelpArrived = 329,
	AISET_SocialCooldown = 330,
	AISET_VIPEscaping = 331,
	AISET_InterestingLocation = 332,
	AISET_SeeDeathExplained = 333,
	AISET_HMHasVictim = 334,
	AISET_PrivateSituationLeader = 335,
	AISET_LongTermMemorySetGoal = 336,
	AISET_ThrownByHitman = 337,
	AISET_Dropped = 338,
	AISET_InterestingItem = 339,
	AISET_InEvacuateTrespassGroup = 340,
	AISET_InRecoverUnconsciousGroup = 341,
	AISET_Revived = 342,
	AISET_IsBeggingForLife = 343,
	AISET_HMStunnedByNPCFlashGrenade = 344,
	AISET_Situation_Role_Leader = 345,
	AISET_Situation_Role_Assistant = 346,
	AISET_Situation_Role_AssitingGuard = 347,
	AISET_ReadytoPlayInvestigationConversation = 348,
	AISET_ReadytoPlayStandDownConversation = 349,
	AISET_ForcedLeader = 350,
	AISET_PropagatedByCivilian = 351,
	AISET_Distraction_State_LeaderSelected = 352,
	AISET_Distraction_State_Investigated = 353,
	AISET_Distraction_State_Resolved = 354,
	AISET_Distraction_State_Canceled = 355,
	AISET_Distraction_Target_BeingHandled = 356,
	AISET_Arrest_State_Approaching = 357,
	AISET_Arrest_State_Escorting = 358,
	AISET_Arrest_State_Guarding = 359,
	AISET_Arrest_ArrestReason = 360,
	AISET_Arrest_Warning_1 = 361,
	AISET_Arrest_Warning_2 = 362,
	AISET_Arrest_Warning_3 = 363,
	AISET_Arrest_Warning_Delay = 364,
	AISET_SC_Escalating = 365,
	AISET_SC_InCombatPosition = 366,
	AISET_SC_Shoot = 367,
	AISET_SC_PreventShooting = 368,
	AISET_SC_PreventChangeCombatPosition = 369,
	AISET_SC_CombatAct = 370,
	AISET_SC_InCombat = 371,
	AISET_SC_Investigator = 372,
	AISET_Infected = 373,
	AISET_Infected_Stage2 = 374,
	AISET_Infected_Stage3 = 375,
	AISET_Infection_Cured = 376,
	AISET_ENFORCER_DISABLE_FLAG_BEGIN = 377,
	AISET_Enforcer_Disable_HideInPlainSight = 378,
	AISET_ENFORCER_DISABLE_FLAG_END = 379,
	AISET_DYNAMIC_ENFORCER_FLAG_BEGIN = 380,
	AISET_DynamicEnforcer_SharedHitmanSensor = 381,
	AISET_DynamicEnforcer_NakedActor = 382,
	AISET_DynamicEnforcer_SeenItemThrown = 383,
	AISET_DynamicEnforcer_HitByItemOrCoin = 384,
	AISET_DynamicEnforcer_Setpiece = 385,
	AISET_DynamicEnforcer_SillyHitman = 386,
	AISET_DynamicEnforcer_PrivateArea = 387,
	AISET_DynamicEnforcer_SuspiciousMovement = 388,
	AISET_DYNAMIC_ENFORCER_FLAG_INCA_BEGIN = 389,
	AISET_DynamicEnforcer_Explosion = 390,
	AISET_DynamicEnforcer_GunshotSound = 391,
	AISET_DynamicEnforcer_BulletImpactSound = 392,
	AISET_DynamicEnforcer_CloseCombatSound = 393,
	AISET_DynamicEnforcer_DeadlyThrowVictim = 394,
	AISET_DynamicEnforcer_PacifyingThrowVictim = 395,
	AISET_DynamicEnforcer_SeenMurderVictimNotHeardGunshot = 396,
	AISET_DynamicEnforcer_SeenMurderVictimHeardGunshot = 397,
	AISET_DynamicEnforcer_MurderAttempt = 398,
	AISET_DynamicEnforcer_DeadBody = 399,
	AISET_DynamicEnforcer_PacifiedBody = 400,
	AISET_DynamicEnforcer_Hunt = 401,
	AISET_DYNAMIC_ENFORCER_FLAG_INCA_END = 402,
	AISET_DYNAMIC_ENFORCER_FLAG_END = 403,
	AISET_DYNAMIC_ENFORCER_DISABLE_FLAG_BEGIN = 404,
	AISET_DynamicEnforcer_Disable_CivilianInInvestigateCautious = 405,
	AISET_DYNAMIC_ENFORCER_DISABLE_FLAG_END = 406,
	AISET_DYNAMIC_ENFORCER_CIVILIAN_DISGUISE_ONLY_FLAG_BEGIN = 407,
	AISET_DynamicEnforcer_InvestigateWeapon = 408,
	AISET_DYNAMIC_ENFORCER_CIVILIAN_DISGUISE_ONLY_FLAG_END = 409,
	AISET_DYNAMIC_ENFORCER_ARREST_REASON_BEGIN = 410,
	AISET_DynamicEnforcer_ArrestReason_Murder = 411,
	AISET_DynamicEnforcer_ArrestReason_MurderAttempt = 412,
	AISET_DynamicEnforcer_ArrestReason_HitByItemOrCoin = 413,
	AISET_DynamicEnforcer_ArrestReason_NearDeadBody = 414,
	AISET_DynamicEnforcer_ArrestReason_NearPacifiedBody = 415,
	AISET_DynamicEnforcer_ArrestReason_GunshotSound = 416,
	AISET_DynamicEnforcer_ArrestReason_CloseCombatSound = 417,
	AISET_DynamicEnforcer_ArrestReason_BulletImpactSound = 418,
	AISET_DynamicEnforcer_ArrestReason_Hunt = 419,
	AISET_DynamicEnforcer_ArrestReason_Explosion = 420,
	AISET_DynamicEnforcer_ArrestReason_PrivateArea = 421,
	AISET_DynamicEnforcer_ArrestReason_Weapon = 422,
	AISET_DynamicEnforcer_ArrestReason_Setpiece = 423,
	AISET_DynamicEnforcer_ArrestReason_KnockdownThrow = 424,
	AISET_DynamicEnforcer_ArrestReason_SillyHitman = 425,
	AISET_DYNAMIC_ENFORCER_ARREST_REASON_END = 426,
};

// Size: 0x8
class alignas(4) SGetHelpOrderSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	EAISharedEventType m_helpType; // 0x0
	uint32 m_rInitialGuard; // 0x4
};

// Size: 0x1
class alignas(1) SActorSoundDefs
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class ZActBehaviorEntity_EState
{
	UNDEFINED = 0,
	IDLE = 1,
	STOPPING = 2,
	PREPARING = 3,
	MOVING = 4,
	ENTERING = 5,
	RUNNING = 6,
	TIMEDOUT = 7,
	COMPLETE = 8,
};

// Size: 0x8
class alignas(8) ZGameTime
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int64 m_nTicks; // 0x0
};

// Size: 0x18
class alignas(8) SActBehaviorEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bStartedSignalSent; // 0x0
	bool m_bReachedSignalSent; // 0x1
	ZActBehaviorEntity_EState m_nState; // 0x4
	ZGameTime m_ActStartTime; // 0x8
	bool m_bForceTimeout; // 0x10
};

// Size: 0x1
enum class ETessellationMode
{
	TESSELLATIONMODE_FLAT = 0,
	TESSELLATIONMODE_PHONG = 1,
};

// Size: 0x1
enum class ECameraCollisionMode
{
	ECAMERACOLLISIONMODE_COLLIDE_ALWAYS = 0,
	ECAMERACOLLISIONMODE_CAMERA_OBSTACLE = 1,
	ECAMERACOLLISIONMODE_COLLIDE_NEVER = 2,
	ECAMERACOLLISIONMODE_COLLIDE_DEFAULT = 3,
};

// Size: 0x8
class alignas(4) SVoidSignalEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bSignaling; // 0x0
	float32 m_fFiredAtTime; // 0x4
};

// Size: 0x4
enum class EBystanderPointType
{
	BPT_Scared = 0,
	BPT_Alerted = 1,
};

// Size: 0x20
class alignas(8) SActorProviderDirectSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint32> m_aActors; // 0x0
	bool m_bRunning; // 0x18
};

// Size: 0x4
enum class ZInteractionData_EFilterResult
{
	EFR_REQUESTED = 0,
	EFR_ENABLE_INTERACTION = 1,
	EFR_EXPANDED_NOT_INTERACTABLE = 2,
	EFR_COLLAPSED_CANT_OPERATE = 3,
	EFR_COLLAPSED_PRIORITY = 4,
	EFR_COLLAPSED_GAMESTATE = 5,
	EFR_COLLAPSED_ACTION_FILTER = 6,
	EFR_REJECTED_OTHER = 7,
	EFR_REJECTED_OUTOFRANGE = 8,
	EFR_REJECTED_OCCLUDED = 9,
	EFR_REJECTED_OUTOFVIEW = 10,
	EFR_REJECTED_GAMESTATE = 11,
	EFR_REJECTED_ACTION_FILTER = 12,
	EFR_REJECTED_INVALIDDATA = 13,
	EFR_REJECTED_PRIORITY = 14,
};

// Size: 0x4
enum class ZHeroEscortSituation2Entity_ETargetState
{
	ETS_Unknown = 0,
	ETS_NoTarget = 1,
	ETS_RunningActBehavior = 2,
	ETS_RunningDummyBehavior = 3,
	ETS_RunningOtherBehavior = 4,
	ETS_Dead = 5,
	ETS_TargetIsHitman = 6,
};

// Size: 0x4
enum class ESoundChannelGroup
{
	ESCG_NONE = 0,
	SND_Default = 1,
	SND_Phys_Rigidbody = 2,
	SND_Phys_Shatter = 3,
	SND_Wpn_HM = 4,
	SND_Wpn_HM_Shot = 5,
	SND_Wpn_NPC = 6,
	SND_Wpn_Impacts = 7,
	SND_Wpn_Flybys = 8,
	SND_Characters = 9,
	SND_Ambience = 10,
	SND_Props = 11,
	SND_Prop_Item = 12,
	SND_FS_HM = 13,
	SND_FS_NPC = 14,
	SND_VisualFX = 15,
	SND_VisualFX_ShotActivate = 16,
	SND_VisualFX_Explosions = 17,
	SND_Diag_HM = 18,
	SND_Diag_NPC = 19,
	SND_CS_Ingame = 20,
	SND_CS_PreRend = 21,
	SND_Music_Env = 22,
	SND_MusicNonEnv = 23,
	SND_SpecialFX_CC = 24,
	SND_SpecialFX_Jumps = 25,
	SND_SpecialFX_Closet = 26,
	SND_SpecialFX_Vent = 27,
	SND_SpecialFX_Instinct = 28,
	SND_SpecialFX_Disguise = 29,
	SND_SpecialFX_Agility = 30,
	SND_Stingers_SFX = 31,
	SND_GUI = 32,
	SND_Test = 33,
	ANIM_HM_Generic = 34,
	ANIM_HM_Loco = 35,
	ANIM_HM_Agility = 36,
	ANIM_HM_Suit_Flap = 37,
	ANIM_HM_Suit_Release = 38,
	ANIM_HM_Suit_Slide = 39,
	ANIM_HM_Suit_LandImpact = 40,
	ANIM_HM_Suit_Grab = 41,
	ANIM_HM_Suit_Roll = 42,
	ANIM_HM_Suit_Swoosh_Body = 43,
	ANIM_HM_Suit_Swoosh_Fast = 44,
	ANIM_HM_CC_Impacts = 45,
	ANIM_HM_CC_Movement = 46,
	ANIM_NPC_Generic = 47,
	ANIM_NPC_Loco = 48,
	ANIM_NPC_CC_Impacts = 49,
	ANIM_NPC_CC_Movement = 50,
	SND_Wpn_HM_Tail = 51,
	SND_Wpn_NPC_Tail = 52,
	SND_Diag_NPC_Crowd = 53,
	SND_Phys_RigidBody_Ragdoll = 54,
	SND_Diag_VO = 55,
	SND_GUI_Menu = 56,
	SND_Props_Doors = 57,
	SND_Wpn_HM_Handguns = 58,
	SND_Wpn_HM_Revolvers = 59,
	SND_Wpn_HM_Rifles = 60,
	SND_Wpn_HM_Shotguns = 61,
	SND_Wpn_HM_Smgs = 62,
	SND_Wpn_HM_Snipers = 63,
	SND_Wpn_HM_Other = 64,
	SND_Wpn_NPC_Handguns = 65,
	SND_Wpn_NPC_Revolvers = 66,
	SND_Wpn_NPC_Rifles = 67,
	SND_Wpn_NPC_Shotguns = 68,
	SND_Wpn_NPC_Smgs = 69,
	SND_Wpn_NPC_Snipers = 70,
	SND_Wpn_NPC_Other = 71,
	SND_Diag_NPC_Oneliner = 72,
	SND_Moments = 73,
};

// Size: 0x4
enum class EOutfitAICategory
{
	OAC_Undefined = 0,
	OAC_Fallback = 1,
	OAC_47Suit = 2,
	OAC_47TRAINING = 3,
	OAC_47MARRAKESH = 4,
	OAC_47SAPIENZA = 5,
	OAC_47BANGKOK = 6,
	OAC_47COLORADO = 7,
	OAC_47HOKKAIDO = 8,
	OAC_47PREORDER = 9,
	OAC_47COLUMBIA = 10,
	OAC_47ISLAND = 11,
	OAC_47MUMBAI = 12,
	OAC_47NEWZEALAND = 13,
	OAC_47STARTCLASSY = 14,
	OAC_47STARTOUTFIT = 15,
	OAC_47SUBURBIA = 16,
	OAC_Bodyguard = 17,
	OAC_CameraMan = 18,
	OAC_Chef = 19,
	OAC_Cleaner = 20,
	OAC_Cop = 21,
	OAC_Crew = 22,
	OAC_DaSilva = 23,
	OAC_Gardner = 24,
	OAC_Hazmat = 25,
	OAC_HouseStaff = 26,
	OAC_Maintenance = 27,
	OAC_Officer = 28,
	OAC_Priest = 29,
	OAC_Printer = 30,
	OAC_Scientist = 31,
	OAC_Security = 32,
	OAC_Sheik = 33,
	OAC_Stylist = 34,
	OAC_Waiter = 35,
	OAC_Busker = 36,
	OAC_Caddie = 37,
	OAC_ChurchStaff = 38,
	OAC_Cyclist = 39,
	OAC_Filmcrew = 40,
	OAC_Fortune = 41,
	OAC_Hippie = 42,
	OAC_Investor = 43,
	OAC_KGB = 44,
	OAC_Lawyer = 45,
	OAC_Kruger = 46,
	OAC_Masseur = 47,
	OAC_Mechanic = 48,
	OAC_Norfolk = 49,
	OAC_Plague = 50,
	OAC_Psych = 51,
	OAC_Shopkeep = 52,
	OAC_Soldier = 53,
	OAC_Tux = 54,
	OAC_Vampire = 55,
	OAC_YachtCrew = 56,
	OAC_Exterminator = 57,
	OAC_SoundCrew = 58,
	OAC_Intern = 59,
	OAC_Stalker = 60,
	OAC_Scarecrow = 61,
	OAC_Hacker = 62,
	OAC_SpecOps = 63,
	OAC_Berg = 64,
	OAC_Morgue = 65,
	OAC_Surgeon = 66,
	OAC_Doctor = 67,
	OAC_Director = 68,
	OAC_Ninja = 69,
	OAC_Baseball = 70,
	OAC_KillBill = 71,
	OAC_Pilot = 72,
	OAC_Yoga = 73,
	OAC_Mummy = 74,
	OAC_Cowboy = 75,
	OAC_Staff = 76,
	OAC_Santa = 77,
	OAC_MambaCrew = 78,
	OAC_Delivery = 79,
	OAC_GOTY_Clown = 80,
	OAC_GOTY_Cowboy = 81,
	OAC_GOTY_DarkSniper = 82,
	OAC_Driver = 83,
	OAC_Driverpale = 84,
	OAC_Eventstff = 85,
	OAC_Flrdaman = 86,
	OAC_Food = 87,
	OAC_Journal = 88,
	OAC_Krnstdtengnr = 89,
	OAC_Krnstdtsec = 90,
	OAC_Ktchstff = 91,
	OAC_Lee = 92,
	OAC_Mascot = 93,
	OAC_Medic = 94,
	OAC_Mendez = 95,
	OAC_Musician = 96,
	OAC_Racecoord = 97,
	OAC_Racemarsh = 98,
	OAC_Thug = 99,
	OAC_Worker = 100,
	OAC_Research = 101,
	OAC_Tatoo = 102,
	OAC_Shaman = 103,
	OAC_Artist = 104,
	OAC_Barber = 105,
	OAC_DJ = 106,
	OAC_Kshmrn = 107,
	OAC_Master = 108,
	OAC_Burial = 109,
	OAC_Ravenmaster = 110,
	OAC_Sentinel = 111,
	OAC_Blake = 112,
	OAC_Actor = 113,
	OAC_Architect = 114,
	OAC_Arkian = 115,
	OAC_Arkptrn = 116,
	OAC_Bbq = 117,
	OAC_Bollycrew = 118,
	OAC_Cavegd = 119,
	OAC_Civilian = 120,
	OAC_Cavewkr = 121,
	OAC_Clothsale = 122,
	OAC_Counsellor = 123,
	OAC_Cowboyhat = 124,
	OAC_Custdn = 125,
	OAC_Dancer = 126,
	OAC_Dbbwll = 127,
	OAC_Deadjanus = 128,
	OAC_Driverch = 129,
	OAC_Driversa = 130,
	OAC_Driveruk = 131,
	OAC_Driverus = 132,
	OAC_Druglabwkr = 133,
	OAC_Elite = 134,
	OAC_Fakemlstrm = 135,
	OAC_Farm = 136,
	OAC_Fieldgrd = 137,
	OAC_Headmaster = 138,
	OAC_Knight = 139,
	OAC_Laundrywkr = 140,
	OAC_Lndrygrd = 141,
	OAC_Mailman = 142,
	OAC_Mansiongd = 143,
	OAC_Mech_Miami = 144,
	OAC_Mechch = 145,
	OAC_Mechit = 146,
	OAC_Mechkrnstdt = 147,
	OAC_Mechsa = 148,
	OAC_Mechuk = 149,
	OAC_Mechus = 150,
	OAC_Metalwkr = 151,
	OAC_Militiasec = 152,
	OAC_Mime = 153,
	OAC_Moviemnstr = 154,
	OAC_Mumbaiserv = 155,
	OAC_Mumbsec = 156,
	OAC_Nitiate = 157,
	OAC_Nurse = 158,
	OAC_Orson = 159,
	OAC_Parka = 160,
	OAC_Politicasst = 161,
	OAC_Politician = 162,
	OAC_Priest_VP = 163,
	OAC_Queensgrd = 164,
	OAC_Queenthug = 165,
	OAC_Rangangrd = 166,
	OAC_Rangansec = 167,
	OAC_Realstbroke = 168,
	OAC_Resident = 169,
	OAC_Resortstaff = 170,
	OAC_Sitewkr = 171,
	OAC_Snowtrek = 172,
	OAC_Subwkr = 173,
	OAC_Suit = 174,
	OAC_Tailor = 175,
	OAC_Teaserv = 176,
	OAC_Terminus = 177,
	OAC_Trainserv = 178,
	OAC_Villagegd = 179,
	OAC_Winter = 180,
	OAC_Wiseman = 181,
	OAC_Investbanker = 182,
	OAC_Bankteller = 183,
	OAC_Robber = 184,
};

// Size: 0x4
enum class ZActorKeywordCondition_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
	ANY_TRUE_IF_NO_REQS = 3,
};

// Size: 0x4
enum class EGSExplodingPropType
{
	eGSExplodingProp_Unknown = 0,
	eGSExplodingProp_Barrel = 1,
	eGSExplodingProp_PetrolCan = 2,
	eGSExplodingProp_GasCanister = 3,
	eGSExplodingProp_GasTank = 4,
	eGSExplodingProp_Mine = 5,
	eGSExplodingProp_Pig = 6,
	eGSExplodingProp_Pigeon = 7,
	eGSExplodingProp_FireworksBox = 8,
	eGSExplodingProp_Car = 9,
};

// Size: 0x8
class alignas(4) SAudioEmitterSwitchSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_nGroupId; // 0x0
	uint32 m_nStateId; // 0x4
};

// Size: 0x8
class alignas(4) SVector2
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 x; // 0x0
	float32 y; // 0x4
};

// Size: 0x10
class alignas(4) SMathDistanceSaveData_SVector2
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SVector2 m_fA; // 0x0
	SVector2 m_fB; // 0x8
};

// Size: 0x4
enum class ZCrowdActorEntity_ECharacterSoundType
{
	eSoundType_Male = 0,
	eSoundType_Female = 1,
	eSoundType_Female_Heels = 2,
};

// Size: 0x20
class alignas(8) SItemStorageSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_Storage; // 0x0
	TArray<uint32> m_ContainedItems; // 0x8
};

// Size: 0x4
enum class eItemType
{
	eCC_FireExtinguisher_01 = 0,
	eCC_Knife = 10,
	eCC_Axe = 20,
	eCC_PetrolCan = 30,
	eCC_Shovel = 40,
	eCC_Hammer = 50,
	eCC_Cleaver = 60,
	eCC_AntitankMine = 70,
	eCC_C4Brick = 80,
	eCC_RemoteExplosive = 90,
	eDetonator = 100,
	eCC_Wrench = 110,
	eCC_Dildo = 120,
	eCC_Bottle = 130,
	eCC_Saw = 140,
	eCC_Screwdriver = 150,
	eCC_MetalPipe = 160,
	eCC_Gavel = 170,
	eCC_Radio = 180,
	eCC_Bong = 190,
	eCC_Statue_Bust_A = 200,
	eGun_44AutoMag = 210,
	eGun_44AutoMagSilenced = 220,
	eGun_Derringer = 230,
	eGun_Glock = 240,
	eGun_GlockDirty = 250,
	eGun_GlockSilenced = 260,
	eGun_HardBaller_01 = 270,
	eGun_HardBallerSilenced = 280,
	eGun_Sig226 = 290,
	eGun_Sig226Silenced = 300,
	eGun_Sphinx3000 = 310,
	eGun_Taurus24_7 = 320,
	eGun_Taurus24_7Silenced = 330,
	eGun_Spotter = 340,
	eOther_MG = 350,
	eOther_RPG = 360,
	eRevolver_PoliceRevolver = 370,
	eRevolver_Snubnosed = 380,
	eRevolver_Taurus = 390,
	eRifle_HK416 = 400,
	eRifle_HK416Scope = 410,
	eRifle_HK416Silenced = 420,
	eRifle_PumpRifle = 430,
	eRifle_SG552 = 440,
	eRifle_SG552Scope = 450,
	eShotgun_M500 = 460,
	eShotgun_M500New = 470,
	eSMG_HK_UMP = 480,
	eSMG_HK_UMPFlashlight = 490,
	eSMG_HK_UMPScope = 500,
	eSMG_HK_UMPSilenced = 510,
	eSMG_TMP = 520,
	eSniper_AS50 = 530,
	eSniper_Remington700 = 540,
	eSniper_SakoTRG = 550,
	eSniper_SakoTRGSilenced = 560,
	eItemAmmo = 570,
	eCC_FiberWire = 580,
	eOther_ZippoLighter = 590,
	eOther_Keycard_A = 600,
	eOther_SecurityTape = 610,
	eCC_PowerCord = 620,
	eCC_PoliceBaton = 630,
	eCC_Scissor = 640,
	eOther_ContractEnvelope = 650,
	eItemIrrelevantWeapon = 660,
	eCC_BaseballBat = 670,
	eCC_GlassShiv = 680,
	eCC_PoolCue = 690,
	eCC_Rake = 700,
	eCC_ToyCar = 710,
	eCC_Crutch = 720,
	eCC_Guitar = 730,
	eCC_Iron = 740,
	eRifle_Beretta_ARX160 = 760,
	eShotgun_Spas12 = 800,
	eShotgun_Spas12_Compact = 810,
	eShotgun_Silenced = 830,
	eSMG_AK74u = 860,
	eSMG_STK = 880,
	eDLC_TEST_FireArm_01 = 900,
	eDLC_TEST_FireArm_02 = 901,
	eDLC_TEST_Prop_01 = 902,
	eDLC_TEST_Prop_02 = 903,
	eHotSauceBarrel = 910,
	eOther_GenericPickup = 920,
	eCC_SledgeHammer = 921,
	eCC_Katana = 922,
	eCC_Brick = 923,
	cCC_Book_A = 924,
	eSyringe_Lethal = 931,
	eSyringe_Sedative = 932,
	eSyringe_Emetic = 933,
	eSuitcase = 934,
	eUnknownItemType = 1337,
};

// Size: 0x4
enum class EDebugExclusionLayerState
{
	DEBUGELSTATE_UNBLOCKED = 0,
	DEBUGELSTATE_BLOCKED = 1,
	DEBUGELSTATE_UNKNOWN = 2,
};

// Size: 0x1
enum class ILightEntity_ELightType
{
	LT_DIRECTIONAL = 0,
	LT_ENVIRONMENT = 1,
	LT_OMNI = 2,
	LT_SPOT = 3,
	LT_SQUARESPOT = 4,
	LT_CAPSULE = 5,
	LT_AREA_QUAD = 6,
};

// Size: 0x4
enum class EOnlinTest
{
	eHELLO = 0,
	eWORLD = 1,
};

// Size: 0x10
class alignas(8) SBehaviorTreeInputPinCondition
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString m_sName; // 0x0
};

// Size: 0x1
enum class EParticleColorUsage
{
	REPLACE_PARTICLE_COLOR = 0,
	LEAVE_PARTICLE_COLOR = 1,
};

// Size: 0x4
enum class eContractSessionStartError
{
	ERROR_NONE = 0,
	ERROR_MISSING_CONTENT = 1,
	ERROR_SERVER_UNREACHABLE = 2,
	ERROR_SERVER_ERROR = 3,
	ERROR_CONTRACT_NOT_PLAYABLE_YET = 4,
	ERROR_CONTRACT_NOT_PLAYABLE_ANYMORE = 5,
	ERROR_CANCELED = 6,
	ERROR_ALREADY_STARTING = 7,
	ERROR_UNKNOWN = 8,
};

// Size: 0x4
enum class EDeathContext
{
	eDC_UNDEFINED = 0,
	eDC_NOT_HERO = 1,
	eDC_HIDDEN = 2,
	eDC_ACCIDENT = 3,
	eDC_MURDER = 4,
};

// Size: 0x28
class alignas(8) SItemWeaponSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint32> m_magazineBulletsByAmmoType; // 0x0
	uint32 m_nExtraMagazineBullets; // 0x18
	EDeathContext m_ePendingDeathContext; // 0x1C
	EDeathContext m_eDeathContext; // 0x20
};

// Size: 0x4
enum class EGameModeId
{
	GameMode_Invalid = -1,
	GameMode_Normal = 0,
	GameMode_Sniper = 1,
	GameMode_Versus = 2,
	GameMode_Max = 3,
};

// Size: 0x4
enum class ZActBehaviorEntity_EApproachAlignment
{
	AA_STRICT = 0,
	AA_LOOSE = 1,
};

// Size: 0x8
class alignas(0) ISequenceTarget
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class ILightEntity_EFrameIndexStrategy
{
	WRAP = 0,
	CLAMP = 1,
};

// Size: 0x4
enum class EViewportLock
{
	VPL_None = 0,
	VPL_Rectangular = 1,
	VPL_Rectangular_AvoidMinimapOverlap = 2,
};

// Size: 0x4
enum class ZInputListenerDpadEntity_eInputListenerDpad
{
	EILDP_UP = 0,
	EILDP_LEFT = 1,
	EILDP_DOWN = 2,
	EILDP_RIGHT = 3,
};

// Size: 0x10
class alignas(8) ZResourceID
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString m_uri; // 0x0
};

// Size: 0x40
class alignas(8) SEnvironmentConfigResourceEntry
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString Name; // 0x0
	ZResourceID ContractsDatastoreRid; // 0x10
	ZResourceID UnlockablesDatastoreRid; // 0x20
	ZResourceID BlobsDatastoreRid; // 0x30
};

// Size: 0x18
class alignas(8) SEnvironmentConfigResource
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SEnvironmentConfigResourceEntry> Environments; // 0x0
};

// Size: 0x4
enum class ZEscortSituation2Entity_ETargetState
{
	ETS_Unknown = 0,
	ETS_NoTarget = 1,
	ETS_RunningActBehavior = 2,
	ETS_RunningDummyBehavior = 3,
	ETS_RunningOtherBehavior = 4,
	ETS_Dead = 5,
	ETS_TargetIsHitman = 6,
};

// Size: 0x30
class alignas(8) SSniperScoringEvent
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int32 m_iPoints; // 0x0
	int32 m_iPlayer; // 0x4
	ZString m_sName; // 0x8
	ZString m_sText; // 0x18
	int32 m_iType; // 0x28
	uint8 m_iScoringMachine; // 0x2C
};

// Size: 0x20
class alignas(8) ZAMDEvent
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_nEventID; // 0x0
	float32 m_fStartFraction; // 0x4
	float32 m_fDuration; // 0x8
	ZVariant m_customData; // 0x10
};

// Size: 0x28
class alignas(8) ZAMDEventTrack
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString m_sName; // 0x0
	TArray<ZAMDEvent> m_events; // 0x10
};

// Size: 0x30
class alignas(8) ZAMDTake
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<ZAMDEventTrack> m_eventTracks; // 0x0
	ZVariant m_customData; // 0x18
	int32 m_nSyncTrackIndex; // 0x28
};

// Size: 0x4
enum class EAIFormationMemberSpeed
{
	eFMS_Slow = 0,
	eFMS_Normal = 1,
	eFMS_Fast = 2,
};

// Size: 0x4
enum class ZTrespassingSituation_ESituationState
{
	SS_Main = 1,
	SS_StandDown = 2,
	SS_Escalate = 3,
};

// Size: 0x4
enum class EFocusBarState
{
	FOCUS_BAR_NORMAL = 0,
	FOCUS_BAR_INSTINCT = 1,
	FOCUS_BAR_BURNING = 2,
};

// Size: 0x1
enum class ERenderGlowTypes
{
	ERENDERGLOWTYPE_NONE = 0,
	ERENDERGLOWTYPE_ENEMIES = 1,
	ERENDERGLOWTYPE_ALLIES = 2,
	ERENDERGLOWTYPE_CIVILIAN = 3,
	ERENDERGLOWTYPE_ITEMS = 4,
	ERENDERGLOWTYPE_STASHED_ITEMS = 5,
	ERENDERGLOWTYPE_SETPIECE = 6,
	ERENDERGLOWTYPE_BACKGROUND = 7,
	ERENDERGLOWTYPE_CONTRACT_TARGET = 8,
	ERENDERGLOWTYPE_CONTRACT_TARGET_NON_CRITICAL = 9,
	ERENDERGLOWTYPE_CONTRACT_TARGET_SPECIAL = 10,
	ERENDERGLOWTYPE_OBJECTIVES = 11,
	ERENDERGLOWTYPE_ENFORCER = 12,
	ERENDERGLOWTYPE_LTMEMORY = 13,
	ERENDERGLOWTYPE_TAGGED = 14,
	ERENDERGLOWTYPE_TAGFOCUS_UNTAGGED = 15,
	ERENDERGLOWTYPE_TAGFOCUS_TAGGED = 16,
	ERENDERGLOWTYPE_BACKGROUNDUNMASKED = 17,
	ERENDERGLOWTYPE_INTERACTION = 18,
	ERENDERGLOWTYPE_INTERACTION_SELECTED = 19,
	ERENDERGLOWTYPE_INTERACTION_DESELECTED = 20,
	ERENDERGLOWTYPE_PLAYER_LVA = 21,
	ERENDERGLOWTYPE_PLAYER_LVA_SEEN = 22,
	ERENDERGLOWTYPE_VS_OPPONENT = 23,
	ERENDERGLOWTYPE_TRAVERSAL = 24,
	ERENDERGLOWTYPE_EMISSIVE_UI = 25,
	ERENDERGLOWTYPE_OPPONENT = 26,
};

// Size: 0x4
enum class ESoundCollisionObjectType
{
	StaticRigidBody = 0,
	DynamicRigidBody = 1,
	Ragdoll = 2,
};

// Size: 0x4
enum class TeleportActionType
{
	STAY = 0,
	TELEPORT = 1,
	LEAVE_CROWD = 2,
};

// Size: 0x4
enum class ZDistanceCondition_ECompareMethod
{
	CM_GreaterOrEqualThan = 0,
	CM_LessThan = 1,
};

// Size: 0x4
enum class EActorAIState
{
	eAAIS_None = 0,
	eAAIS_Distracted = 1,
	eAAIS_PotentialThreat = 2,
	eAAIS_PotentialThreatDistracted = 3,
	eAAIS_PotentialThreatDisabled = 4,
	eAAIS_Aggressive = 5,
	eAAIS_EscortingOut = 6,
	eAAIS_Fleeing = 7,
	eAAIS_Unconscious = 8,
	eAAIS_Stunned = 9,
	eAAIS_Grenade = 10,
	eAAIS_DisabledInCombat = 11,
	eAAIS_Disabled = 12,
	eAAIS_Max = 13,
};

// Size: 0x4
enum class EMorphemeEventId
{
	eDE_None = 0,
	eDE_UnholsterWeapon = 18,
	eDE_HolsterWeapon = 19,
	eDE_FireWeapon = 20,
	eDE_AttachWeapon = 21,
	eDE_DetachWeapon = 22,
	eDE_LegR = 100,
	eDE_LegL = 101,
	eDE_TransitionEnd_LegR = 200,
	eDE_TransitionEnd_LegL = 201,
	eDE_Finish = 255,
	eDE_InterpolationStart = 300,
	eDE_InterpolationEnd = 301,
	eDE_TransitionSignal = 400,
	eDE_TransitionEnd = 500,
	eDE_DisableNPCHitmanCollision = 700,
	eDE_EnableNPCHitmanCollision = 701,
	eDE_EnableRagdollRangeStart = 800,
	eDE_EnableRagdollRangeEnd = 801,
	eDE_StartBlendingOut = 850,
	eDE_FinishBlendingOut = 851,
	eDE_StartOrientationBlend = 860,
	eDE_FinishOrientationBlend = 861,
	eDE_RecoveryPowerRagdollEnd = 862,
	eDE_RecoveryBlendEnd = 863,
	eDE_ImpactFinished = 900,
	eDE_ActFinished = 1000,
	eDE_ActFinishedWhenMoving = 1001,
	eDE_ActReached = 1005,
	eDE_ActLoop = 1050,
	eDE_ActFullbodyStartMarker = 1090,
	eDE_ActFullbodyEndMarker = 1091,
	eDE_ReactionFinished = 1100,
	eDE_StandToCrouch = 1500,
	eDE_CrouchToStand = 1501,
	eDE_OffHandIKEnable = 1600,
	eDE_OffHandIKDisable = 1601,
	eDE_StandToMoveRotationToTranslation = 1700,
	eDE_MoveToStandTranslationToRotation = 1701,
	eDE_HeadIKEnable = 1800,
	eDE_HeadIKDisable = 1801,
	eDE_WindowLeaningEnable = 2000,
	eDE_WindowLeaningDisable = 2001,
	eDE_PreventDeathAnimations = 2002,
	eDE_AllowDeathAnimations = 2003,
	eDE_HeadControlEnable = 2010,
	eDE_HeadControlDisable = 2011,
	eDE_CombatActEndMarker = 3000,
	eDE_CombatAim = 3100,
	eDE_CombatEnableRightHandIK = 3010,
	eDE_CombatEnableLeftHandIK = 3011,
	eDE_CombatEndEnableIK = 3015,
	eDE_CombatStartDisableIK = 3020,
	eDE_CombatEndDisableIK = 3025,
	eDE_CombatEnableShoot = 3030,
	eDE_CombatDisableShoot = 3040,
	eDE_CombatEnableBlindShoot = 3050,
	eDE_CombatDisableBlindShoot = 3060,
	eDE_CombatUnholsterGrenade = 3070,
	eDE_CombatThrowGrenade = 3080,
	eDE_ActBehaviorEventStart = 4000,
	eDE_ActItemPickup = 4001,
	eDE_ActItemDrop = 4002,
	eDE_AmbientItemUseMarker = 4010,
	eDE_ActBehaviorEventEnd = 4999,
	eDE_Act_LeadIn_Marker = 10301,
	eDE_Act_UB_BlendIn_End = 10050,
	eDE_Act_FB_BlendIn_Start = 10051,
	eDE_Act_FB_BlendIn_End = 10052,
	eDE_Act_FB_BlendOut_End = 10053,
};

// Size: 0x4
enum class EAccidentScaleContext
{
	eASC_Standard = 0,
	eASC_Unsafe = 1,
	eASC_Dangerous = 2,
};

// Size: 0x4
enum class EEngineModeId
{
	EngineMode_Invalid = -1,
	EngineMode_SinglePlayer = 0,
	EngineMode_SplitScreen = 1,
	EngineMode_Multiplayer = 2,
	EngineMode_Max = 3,
};

// Size: 0x4
class alignas(4) SDestructibleInteractionHandlerData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 m_fSettleTime; // 0x0
};

// Size: 0x4
enum class EDamageEvent
{
	eDE_UNDEFINED = 0,
	eDE_InCloset = 1,
	eDE_Subdue = 2,
	eDE_CloseCombat = 4,
	eDE_PushOver = 16,
	eDE_KickDownStairs = 32,
	eDE_DeadlyThrow = 64,
	eDE_Shoot = 128,
	eDE_Sedated = 256,
	eDE_InstantTakeDown = 512,
	eDE_CoupDeGrace = 1024,
	eDE_ContextKill = 2048,
	eDE_Garotte = 4096,
	eDE_Poison = 8192,
	eDE_Electric = 16384,
	eDE_SuspendedObject = 32768,
	eDE_Burn = 65536,
	eDE_Drop = 131072,
	eDE_Drown = 262144,
};

// Size: 0x4
enum class ZSoundAmbienceGroup_ESoundCollisionType
{
	SCT_Box = 0,
	SCT_Cylinder = 1,
	SCT_Sphere = 2,
	SCT_Volume = 3,
};

// Size: 0x4
enum class ZDebugGizmoEntity_EDrawLayer
{
	DL_DEFAULT = 0,
	DL_LIGHT = 1,
	DL_PARTICLES = 2,
	DL_PARTITIONING = 3,
	DL_DECALS = 4,
	DL_CROWD = 5,
	DL_PHYSICS = 6,
	DL_HERO = 7,
	DL_AI = 8,
	DL_AI_GRID = 9,
	DL_AI_SITUATION = 10,
	DL_AI_AREA = 11,
	DL_NPC_LOCOMOTION = 12,
	DL_GAME = 13,
	DL_ALIGNMENT = 14,
	DL_ENGINE = 15,
	DL_SOUND = 16,
	DL_ANIMATION = 17,
	DL_CLOTH = 18,
	DL_SOUND_PARTITIONING = 19,
	DL_UI = 20,
};

// Size: 0x4
enum class ZCoverPlane_ECoverSize
{
	eLowCover = 0,
	eMediumCover = 1,
	eHighCover = 2,
};

// Size: 0x4
enum class ZContextKillGuide_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
};

// Size: 0x8
class alignas(4) ZResourcePtr
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x10
class alignas(4) ZHM5CrowdEventConsumer_SCrowdSoundEventData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZResourcePtr m_pAudioEventRes; // 0x0
	float32 m_fAttenuation; // 0x8
	float32 m_fPitch; // 0xC
};

// Size: 0x4
enum class EAnimSetType
{
	EAST_UNDEFINED = 0,
	EAST_DEFAULT = 1,
	EAST_PISTOL = 2,
	EAST_REVOLVER = 3,
	EAST_SMG = 4,
	EAST_SNIPER = 5,
	EAST_ASSULT = 6,
	EAST_SHOTGUN = 7,
	EAST_BODYBAG = 8,
	EAST_GLASS = 9,
	EAST_BOX = 10,
	EAST_PLATE = 11,
	EAST_SMALLOBJ = 12,
	EAST_SUITCASE = 13,
	EAST_TRAY = 14,
	EAST_TROLLY = 15,
	EAST_FLASHLIGHT = 16,
	EAST_CARRY_1HANDEDWEAPON = 17,
	EAST_CARRY_2HANDEDWEAPON = 18,
	EAST_CARRY_RAKE = 19,
	EAST_CARRY_WEAPON_ITEM = 20,
	EAST_CARRY_BRICK_MINE = 21,
	EAST_CARRY_PROXY_MINE = 22,
	EAST_CARRY_LEAD_PIPES = 23,
	EAST_CARRY_TUBE = 24,
};

// Size: 0x4
enum class EMassImpulseType
{
	eMIT_None = 0,
	eMIT_Explosion = 1,
	eMIT_ShockWave = 2,
	eMIT_ShockWaveNoExplosion = 3,
};

// Size: 0x4
enum class ETimerEntityCommandType
{
	ETECT_Add = 0,
	ETECT_Remove = 1,
	ETECT_Reset = 2,
};

// Size: 0xC
class alignas(4) STimerEntityCommandSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ETimerEntityCommandType m_eType; // 0x0
	uint32 m_rEntity; // 0x4
	float32 m_fInterval; // 0x8
};

// Size: 0xC
class alignas(4) STimerEntityStateSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rEntity; // 0x0
	float32 m_fNextEventTime; // 0x4
	bool m_bPending; // 0x8
};

// Size: 0x48
class alignas(8) SGameTimersSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<STimerEntityCommandSaveData> m_aTimerEntityCommands; // 0x0
	TArray<STimerEntityStateSaveData> m_aTimerEntityState; // 0x18
	TArray<uint32> m_aPendingTimers; // 0x30
};

// Size: 0x4
enum class ReverbFidelity
{
	Low = 0,
	Medium = 1,
	High = 2,
};

// Size: 0x10
class alignas(16) float4
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
	float32 w; // 0xC
};

// Size: 0x40
class alignas(16) SMatrix
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float4 XAxis; // 0x0
	float4 YAxis; // 0x10
	float4 ZAxis; // 0x20
	float4 Trans; // 0x30
};

// Size: 0x4
enum class EAIEventType
{
	AIET_None = 0,
	AIET_Ignore = 1,
	AIET_PreventAutoPurge = 2,
	AIET_ShootTarget = 3,
	AIET_Hunting = 4,
	AIET_Order_Target = 5,
	AIET_END_BOOLEAN_EVENTS = 6,
	AIET_LookedAt = 7,
	AIET_Killer = 8,
	AIET_Strangler = 9,
	AIET_Suspicious = 10,
	AIET_KnownBody = 11,
	AIET_KnownBodyIsFoundOutsideNavmeshAndIgnored = 12,
	AIET_KnownBodyIsHandled = 13,
	AIET_KnownBodybag = 14,
	AIET_KnownBodybagIsHandled = 15,
	AIET_Dead = 16,
	AIET_DisguiseSuspicious = 17,
	AIET_DamagingMe = 18,
	AIET_KnownInCloset = 19,
	AIET_KnownInNpcUnreachableArea = 20,
	AIET_Sense = 21,
	AIET_HasBeenInCombat = 22,
	AIET_ReportedByCamera = 23,
	AIET_SOUNDEVENTS_LOW_LOUDNESS_BEGIN = 24,
	AIET_SoundFootsteps = 25,
	AIET_SoundThrownItemCollision = 26,
	AIET_SoundGunSilenced = 27,
	AIET_SoundHitmanGunSilenced = 28,
	AIET_SoundLegalGunSilenced = 29,
	AIET_SoundLegalHitmanGunSilenced = 30,
	AIET_SoundEmptyGun = 31,
	AIET_SoundCCBreakNeck = 32,
	AIET_SoundCCChoke = 33,
	AIET_SoundCCFiberwire = 34,
	AIET_SoundBulletImpact = 35,
	AIET_SoundLegalBulletImpact = 36,
	AIET_SoundSpeakWarning = 37,
	AIET_SoundSpeakAngry = 38,
	AIET_SOUNDEVENTS_NORMAL_LOUDNESS_BEGIN = 39,
	AIET_SoundRadio = 40,
	AIET_SoundAlarm = 41,
	AIET_SoundSpeakPainBehind = 42,
	AIET_SoundCloseCombat = 43,
	AIET_SoundSpeakPain = 44,
	AIET_SoundSetpiece = 45,
	AIET_SOUNDEVENTS_LOUD_LOUDNESS_BEGIN = 46,
	AIET_SoundSpeakHelp = 47,
	AIET_SoundSpeakHelpLoud = 48,
	AIET_SoundGunShot = 49,
	AIET_SoundHitmanGunShot = 50,
	AIET_SoundLegalGunShot = 51,
	AIET_SoundLegalHitmanGunShot = 52,
	AIET_SoundExplosion = 53,
	AIET_SoundAccident = 54,
	AIET_SoundCurious = 55,
	AIET_SoundCuriousItem = 56,
	AIET_SoundInteresting = 57,
	AIET_SoundCrowdCurious = 58,
	AIET_SoundCrowdAlerted = 59,
	AIET_SoundCrowdWantsArrest = 60,
	AIET_SoundCrowdWantsArrestKiller = 61,
	AIET_SOUNDEVENTS_END = 62,
	AIET_SightReaction = 63,
	AIET_SightInvestigation = 64,
	AIET_PerceptibleEntityAware = 65,
	AIET_InSight = 66,
	AIET_SlowMovementInVegetationInSight = 67,
	AIET_MediumMovementInVegetationInSight = 68,
	AIET_FastMovementInVegetationInSight = 69,
	AIET_VisualSetpiece = 70,
	AIET_DirectSetpiece = 71,
	AIET_Sick = 72,
	AIET_MyFlashGrenadeExploded = 73,
	AIET_StunnedByFlashGrenade = 74,
	AIET_Attention_Stage_1 = 75,
	AIET_Attention_Stage_2 = 76,
	AIET_AttentionFading = 77,
	AIET_FullAttention = 78,
	AIET_FullDisguiseAttention = 79,
	AIET_ReactedTo = 80,
	AIET_ReactTarget = 81,
	AIET_ReactSuppressed = 82,
	AIET_StanddownHolster = 83,
	AIET_ForcedIllegal = 84,
	AIET_HitByItem = 85,
	AIET_HitByCoin = 86,
	AIET_LTHitByItemOrCoin = 87,
	AIET_HitByItemOrCoinTwice = 88,
	AIET_HitByThis = 89,
	AIET_SeenInAccident = 90,
	AIET_Trespassing_Strike_1 = 91,
	AIET_Trespassing_Strike_2 = 92,
	AIET_Trespassing_Strike_3 = 93,
	AIET_DistractedByMovementInVegetation_Once = 94,
	AIET_DistractedByMovementInVegetation_Twice = 95,
	AIET_Investigate_Strike_1 = 96,
	AIET_Investigate_Strike_2 = 97,
	AIET_DisguiseEnforcer = 98,
	AIET_Suspect = 99,
	AIET_InSentryZone = 100,
	AIET_MySentryZone = 101,
	AIET_TriggerAlarm = 102,
	AIET_LockdownIntruder = 103,
	AIET_AccuseUnconscious = 104,
	AIET_HasKnockMeDown = 105,
	AIET_HasKnockSomeoneDown = 106,
	AIET_InMyPrivateArea = 107,
	AIET_KnownNaked = 108,
	AIET_KnownDraggingBodybag = 109,
	AIET_InvestigateOrder = 110,
	AIET_ReactedSurprised = 111,
	AIET_ReportGotShot = 112,
	AIET_HasReportedDeadBodySituation = 113,
	AIET_Social_TooClose = 114,
	AIET_Social_Privacy = 115,
	AIET_Social_Silly = 116,
	AIET_ReactedToSituation = 117,
	AIET_SeeAttached = 118,
	AIET_WasInvisible = 119,
	AIET_BlameHitman = 120,
	AIET_BlamedByUnconscious = 121,
	AIET_DontCareAboutBlaming = 122,
	AIET_Combat_PropagatedBy = 123,
	AIET_Combat_WithinPropagationField = 124,
	AIET_Combat_MarkedAsDiscardable = 125,
	AIET_Combat_AttackWitness = 126,
	AIET_Combat_HomingAttackOrigin = 127,
	AIET_Combat_VIPWasAttackedFromPosition = 128,
	AIET_ReactedToSniperKnowledge = 129,
	AIET_SniperCombatTarget = 130,
	AIET_SniperCombatAimTarget = 131,
	AIET_CantReachTarget = 132,
	AIET_HuntingSniper = 133,
	AIET_NeedCover = 134,
	AIET_WaitingForSniper = 135,
	AIET_HeardSniperShooting = 136,
	AIET_KnownHidden = 137,
	AIET_SituationTarget = 138,
	AIET_TalkingToHitman = 139,
	AIET_SuspiciousAction = 140,
	AIET_RadioCallHelpingActor = 141,
	AIET_WeaponContextKnown = 142,
	AIET_IdleStandDown = 143,
	AIET_IgnoreInvestigation = 144,
	AIET_NewDisguiseTarget = 145,
	AIET_SocialTarget = 146,
	AIET_SecurityCamBroken = 147,
	AIET_HeWoundedMeLongDistance = 148,
	AIET_HeWoundedMeShortDistance = 149,
	AIET_HeWoundedMeCC = 150,
	AIET_HeAimedAtMe = 151,
	AIET_BumpedIntoMe = 152,
	AIET_ReactToDistraction = 153,
	AIET_MovingToTarget = 154,
	AIET_ReachedTarget = 155,
	AIET_DistractionChainPart = 156,
	AIET_NewDistractionChainPart = 157,
	AIET_ChainFixed = 158,
	AIET_SurprisePlayed = 159,
	AIET_NewDistraction = 160,
	AIET_WasSilly = 161,
	AIET_Distraction_My_Leader = 162,
	AIET_Distraction_My_Assistant = 163,
	AIET_Distraction_Was_My_Assistant = 164,
	AIET_AssitingWithSuitcase = 165,
	AIET_SuitcaseAssistanceFaceToFace = 166,
	AIET_SuitcaseAssistanceRadio = 167,
	AIET_SC_CombatPosition = 168,
	AIET_SC_CombatPositionMove = 169,
	AIET_SC_CombatPositionFight = 170,
	AIET_SC_PreventMovingThere = 171,
	AIET_SC_JumpyReaction = 172,
	AIET_DISTRACTION_TYPES_START = 173,
	AIET_SeeInCoverDistraction = 174,
	AIET_SeeSneakingDistraction = 175,
	AIET_SeeStunnedDistraction = 176,
	AIET_SeeSickDistraction = 177,
	AIET_LegalItemDroppedDistraction = 178,
	AIET_IllegalItemDroppedDistraction = 179,
	AIET_BumpedDistraction = 180,
	AIET_SightReactionDistraction = 181,
	AIET_SightInvestigationDistraction = 182,
	AIET_HearItemImpactDistraction = 183,
	AIET_SeeCuriousPerceptibleDistraction = 184,
	AIET_SeeCuriousItemDistraction = 185,
	AIET_SeeFlyingItemDistraction = 186,
	AIET_SeeThrowingDistraction = 187,
	AIET_HitBySomethingDistraction = 188,
	AIET_HearFootstepsDistraction = 189,
	AIET_SeeAgility = 190,
	AIET_SeeAgility_Vault = 191,
	AIET_SeeAgility_Window = 192,
	AIET_SeeHidding = 193,
	AIET_HearStrangeSound = 194,
	AIET_HearAlarm = 195,
	AIET_HearRadio = 196,
	AIET_HearAngry = 197,
	AIET_HearHelp = 198,
	AIET_HearAccident = 199,
	AIET_HearCuriousCrowd = 200,
	AIET_HearBulletImpact = 201,
	AIET_HearPain = 202,
	AIET_HearCuriousSound = 203,
	AIET_HearCuriousItemSound = 204,
	AIET_SecurityCameraBroken = 205,
	AIET_SetpieceDistractionDefault = 206,
	AIET_SeeItemTossDistraction = 207,
	AIET_SetpieceDistractionDoor = 208,
	AIET_SetpieceDistractionExperimental1 = 209,
	AIET_SetpieceDistractionExperimental2 = 210,
	AIET_SeeSuitcaseDistraction = 211,
	AIET_Distraction_Silly = 212,
	AIET_Distraction_TooClose = 213,
	AIET_Distraction_Privacy = 214,
	AIET_Distraction_MovementInVegetationBrief = 215,
	AIET_Distraction_MovementInVegetationCurious = 216,
	AIET_DISTRACTION_TYPES_END = 217,
	AIET_ARREST_REASONS_START = 218,
	AIET_ArrestReason_IllegalItem = 219,
	AIET_ArrestReason_DragBody = 220,
	AIET_ArrestReason_KnockDown = 221,
	AIET_ARREST_REASONS_END = 222,
	AIET_END_NORMAL_EVENTS = 223,
	AIET_DEBUG_EVENTS_START = 224,
	AIET_Debug_ThrowFlashbangHere = 225,
	AIET_DEBUG_EVENTS_END = 226,
};

// Size: 0x18
class alignas(8) SAIEventSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	EAIEventType m_eType; // 0x0
	bool m_bHandled; // 0x4
	ZGameTime m_nStart; // 0x8
	ZGameTime m_nEnd; // 0x10
};

// Size: 0x80
class alignas(16) SKnownEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int32 m_nSharedIndex; // 0x0
	TArray<SAIEventSaveData> m_aEvents; // 0x8
	uint32 m_nBooleanEvents; // 0x20
	uint32 m_nBooleanEventsHandled; // 0x24
	SMatrix m_knownWorldMatrix; // 0x30
	ZGameTime m_tLastWorldMatrixUpdate; // 0x70
	uint16 m_nGoals; // 0x78
};

// Size: 0x60
class alignas(8) SActorGoalSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<int32> m_aEntities; // 0x0
	TArray<bool> m_aHandled; // 0x18
	TArray<bool> m_aIsCurrent; // 0x30
	TArray<float32> m_fExpiredTime; // 0x48
};

// Size: 0x4
enum class EAIGoal
{
	AIG_Kill = 0,
	AIG_Arrest = 1,
	AIG_FightSniper = 2,
	AIG_HelpCivilian = 3,
	AIG_HelpCivilianWeapon = 4,
	AIG_Investigate = 5,
	AIG_InvestigateDisguise = 6,
	AIG_StandOffInvestigateDisguise = 7,
	AIG_InvestigateDeadBody = 8,
	AIG_HandleTrespasser = 9,
	AIG_InvestigateCautious = 10,
	AIG_HandleDistraction = 11,
	AIG_AssistDistraction = 12,
	AIG_GuardAssistDistraction = 13,
	AIG_HandleSuitcase = 14,
	AIG_InvestigateWeapon = 15,
	AIG_DetectedInPrivate = 16,
	AIG_RecoverUnconscious = 17,
	AIG_RecoverUnconsciousAlerted = 18,
	AIG_DeliverWeapon = 19,
	AIG_AvoidExplosion = 20,
	AIG_Hunt = 21,
	AIG_Frisk = 22,
	AIG_GuardBody = 23,
	AIG_DragBody = 24,
	AIG_LookAtAccident = 25,
	AIG_Sentry = 26,
	AIG_HelpGeneric = 27,
	AIG_Evacuate = 28,
	AIG_Entourage = 29,
	AIG_AvoidDangerousArea = 30,
	AIG_Spectator = 31,
	AIG_Infected = 32,
	AIG_SC_Combat = 33,
	AIG_SC_Alerted = 34,
	AIG_None = 35,
};

// Size: 0x4
enum class EGameTension
{
	EGT_Undefined = 0,
	EGT_Ambient = 1,
	EGT_Agitated = 2,
	EGT_Searching = 3,
	EGT_AlertedLow = 4,
	EGT_AlertedHigh = 5,
	EGT_Hunting = 6,
	EGT_Arrest = 7,
	EGT_Combat = 8,
};

// Size: 0x98
class alignas(8) SKnowledgeSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SKnownEntitySaveData> m_aKnownEntities; // 0x0
	TArray<EAIGoal> m_aGoalKeys; // 0x18
	TArray<SActorGoalSaveData> m_aGoals; // 0x30
	float32 m_fHMAttention; // 0x48
	float32 m_fHMAttentionLastUpdate; // 0x4C
	float32 m_fHMDisguiseAttention; // 0x50
	float32 m_fHMTrespassingAttention; // 0x54
	float32 m_fHMLastTrespassingAttentionMax; // 0x58
	ZGameTime m_tLastTrespassingAttentionGain; // 0x60
	ZGameTime m_tLastAttentionEvaluate; // 0x68
	float32 m_fHMWeaponAttention; // 0x70
	float32 m_fHMWeaponAttentionChange; // 0x74
	EGameTension m_eGameTension; // 0x78
	ZGameTime m_tAmbientStartTime; // 0x80
	ZGameTime m_tExpiredAIModifierSuppressSocialGreeting; // 0x88
	uint32 m_behaviorModifiers; // 0x90
};

// Size: 0x1
enum class ECharacterCollidableLayer
{
	CCL_DYNAMIC = 0,
	CCL_DYNAMIC_TRANSPARENT = 1,
	CCL_DYNAMIC_NO_COLLISION = 2,
	CCL_DYNAMIC_NO_COLLISION_TRANSPARENT = 3,
	CCL_UNUSED_LAST = 4,
};

// Size: 0x4
enum class EDifficultyLevel
{
	eDL_NO_FLAGS = 0,
	eDL_EASY = 1,
	eDL_NORMAL = 2,
	eDL_HARD = 4,
	eDL_VERY_HARD = 8,
	eDL_ALL_FLAGS = 15,
};

// Size: 0x4
enum class ZCautiousSearchGroup_EAssistantState
{
	AS_CalculateFields = 0,
	AS_RequestNode = 1,
	AS_Approach = 2,
	AS_Approaching = 3,
	AS_Act = 4,
	AS_Acting = 5,
};

// Size: 0x4
enum class ZTestGroupPath_EModifierType
{
	EMT_PushCorners = 0,
	EMT_PushCornersAlt = 1,
};

// Size: 0x4
enum class ZHM5Item_EUseTypes
{
	EUT_CantUse = 0,
	EUT_Toggle = 1,
	EUT_TurnOn = 2,
};

// Size: 0x4
enum class EAnimationPose
{
	AP_Undefined = 0,
	AP_Standing = 1,
	AP_SittingChair = 2,
	AP_SittingGround = 3,
	AP_LyingGround = 4,
	AP_Crouching = 5,
	AP_SittingBench = 6,
	AP_SittingChairTable = 7,
};

// Size: 0x4
enum class EActorLookAtStopReason
{
	eSR_Unknown = 0,
	eSR_Disabled = 1,
	eSR_DurationExpired = 2,
	eSR_OutOfRange = 3,
	eSR_OutOfSight = 4,
	eSR_OutOfRemainingPathDistance = 5,
	eSR_Interrupted = 6,
	eSR_TargetRemoved = 7,
	eSR_HigherPriorityProfile = 8,
	eSR_HideInPlainSight = 9,
};

// Size: 0x4
enum class ECharacterIdleHandlerFullbodyType
{
	ecIHFBT_DisguisedIdle = 0,
	ecIHFBT_Event = 1,
};

// Size: 0x4
enum class EHM5SoundFootwearType
{
	EFWT_UNDEFINED = 0,
	EFWT_BAREFOOT = 1,
	EFWT_SLIPPERS = 2,
	EFWT_DISPOSABLE_SLIPPERS = 3,
	EFWT_SANDALS = 4,
	EFWT_SNEAKERS = 5,
	EFWT_SNEAKERS_METALLEG = 6,
	EFWT_LEATHER = 7,
	EFWT_FEMALE_LEATHER = 8,
	EFWT_BOOTS = 9,
	EFWT_COWBOY_BOOTS = 10,
	EFWT_FEMALE_COWBOY_BOOTS = 11,
	EFWT_RUBBER_BOOTS = 12,
	EFWT_HIGH_HEELS = 13,
	EFWT_LEATHER_KEYS = 14,
	EFWT_SWAT_BOOTS = 15,
};

// Size: 0x4
enum class ZValueBool_Operation_Signal_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
	NOT_ALL = 3,
	ALL_EQUAL = 4,
	ONE_TRUE = 5,
};

// Size: 0x4
enum class ZCautiousInvestigateGroup_EInvestigateGroupState
{
	IGS_FindAssistant = 0,
	IGS_PreAcknowledge = 1,
	IGS_Acknowledge = 2,
	IGS_Approach = 3,
	IGS_Approaching = 4,
	IGS_Investigating = 5,
	IGS_DeadBody = 6,
	IGS_Completed = 7,
	IGS_Max = 8,
};

// Size: 0x4
class alignas(4) SMovementDrainPipeSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rDrainPipe; // 0x0
};

// Size: 0x4
enum class IHM5Door_eCloseMode
{
	CM_AUTOCLOSE = 0,
	CM_MANUALCLOSE = 1,
	CM_NEVERCLOSE = 2,
};

// Size: 0x1
enum class EParticleSpritePivotLocation
{
	CENTER_PIVOT = 0,
	BOTTOM_PIVOT = 1,
	TOP_PIVOT = 2,
};

// Size: 0x4
enum class EExtendedPropertyType
{
	TYPE_RESOURCEPTR = 0,
	TYPE_INT32 = 1,
	TYPE_UINT32 = 2,
	TYPE_FLOAT = 3,
	TYPE_STRING = 4,
	TYPE_BOOL = 5,
	TYPE_ENTITYREF = 6,
	TYPE_VARIANT = 7,
};

// Size: 0x20
class alignas(8) SExtendedCppEntityProperty
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString propertyName; // 0x0
	EExtendedPropertyType propertyType; // 0x10
	bool rtEditable; // 0x14
	uint64 extraData; // 0x18
};

// Size: 0x18
class alignas(8) SExtendedCppEntityBlueprint
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SExtendedCppEntityProperty> properties; // 0x0
};

// Size: 0x4
enum class WebSocketUtils_EOpCode
{
	eCONTINUATION = 0,
	eTEXT = 1,
	eBINARY = 2,
	eCLOSE = 8,
	ePING = 9,
	ePONG = 10,
	eNONE = 15,
};

// Size: 0x4
enum class EClipSpawnAxis
{
	eCSA_XPos = 0,
	eCSA_XNeg = 1,
	eCSA_YPos = 2,
	eCSA_YNeg = 3,
	eCSA_ZPos = 4,
	eCSA_ZNeg = 5,
};

// Size: 0x4
enum class EAnimSetState
{
	EASES_DEFAULT = 0,
	EASES_AMBIENT_ARMED = 1,
	EASES_AMBIENT_VIP_ESCORT = 2,
	EASES_AMBIENT_HERO_ESCORT = 3,
	EASES_COMBAT_EVACUATE = 4,
	EASES_COMBAT_EVACUATE_VIP_SOLO = 5,
	EASES_SICK = 6,
	EASES_INFECTED = 7,
};

// Size: 0x4
enum class ZRenderPostfilterParametersEntity_EHDRToneMapType
{
	eLinear = 0,
	eReinhardRGB = 1,
	eFilmicRGB = 2,
};

// Size: 0x4
enum class SFootIKEventData_EFoot
{
	eLeft = 0,
	eRight = 1,
	eBoth = 2,
};

// Size: 0x4
enum class EHM5GameInputFlag
{
	eGameInputActionPerform = 0,
	eGameInputActionPickup = 1,
	eGameInputActionAbort = 2,
	eGameInputActionDoor = 3,
	eGameInputWeaponZoomIn = 4,
	eGameInputWeaponZoomOut = 5,
	eGameInputActionShoot = 6,
	eGameInputActionPrecisionShoot = 7,
	eGameInputAimOTS = 8,
	eGameInputCoverAction = 9,
	eGameInputCoverAlternativeAction = 10,
	eGameInputInventoryAccept = 11,
	eGameInputEquipShortRange = 12,
	eGameInputEquipLongRange = 13,
	eGameInputHolsterItem = 14,
	eGameInputDropItem = 15,
	eGameInputTogglePlacement = 16,
	eGameInputActivatePropQuick = 17,
	eGameInputActivateProp = 18,
	eGameInputActivatePropHold = 19,
	eGameInputActivatePropSecondary = 20,
	eGameInputActivatePropInterruptibleStart = 21,
	eGameInputActivatePropInterruptibleEnd = 22,
	eGameInputConcealRetrieve = 23,
	eGameInputGuideAction = 24,
	eGameInputGuideActionHold = 25,
	eGameInputGuideActionSecondary = 26,
	eGameInputGuideEnterWindow = 27,
	eGameInputGuideSneakPastWindow = 28,
	eGameInputGuideSneakPastWindowHold = 29,
	eGameInputGuideKill = 30,
	eGameInputSlideLadder = 31,
	eGameInputCloseCombat = 32,
	eGameInputFiberwire = 33,
	eGameInputCloseCombatCounter = 34,
	eGameInputCloseCombatTakeDown = 35,
	eGameInputCloseCombatSnapNeck = 36,
	eGameInputSurrender = 37,
	eGameInputShowItem = 38,
	eGameInputReload = 39,
	eGameInputTakeDisguise = 40,
	eGameInputDragDropBody = 41,
	eGameInputDumpBody = 42,
	eGameInputSneakToggle = 43,
	eGameInputCamSwitch = 44,
	eGameInputActivateRun = 45,
	eGameInputActivateWalkSlow = 46,
	eGameInputInstinctMode = 47,
	eGameInputContractTargetTag = 48,
	eGameInputThrow = 49,
	eGameInputCloseCombatChainHigh = 50,
	eGameInputCloseCombatChainLow = 51,
	eGameInputCloseCombatChainCounter = 52,
	eGameInputSkipCutSequence = 53,
	eGameInputCloseCombatChokeStart = 54,
	eGameInputCloseCombatChoke = 55,
	eGameInputFocusedInteractionFaceUp = 56,
	eGameInputFocusedInteractionFaceLeft = 57,
	eGameInputFocusedInteractionFaceDown = 58,
	eGameInputFocusedInteractionLeftStickAnalog = 59,
	eGameInputRemoteAction = 60,
	eGameInputChangeAmmoNext = 61,
	eGameInputChangeAmmoPrevious = 62,
	eGameInputDefault = 63,
	eGameInputActionsNUM = 64,
};

// Size: 0x4
enum class ZHeroEscortSituationEntity_EEscortState
{
	EES_Idle = 0,
	EES_Evaluate = 1,
	EES_Escorting = 2,
	EES_Intermediate = 3,
	EES_OutOfRange = 4,
};

// Size: 0x4
enum class EPhysicsObjectType
{
	EPHYSICSOBJECTTYPE_UNKNOWN = 0,
	EPHYSICSOBJECTTYPE_DYNAMIC = 1,
	EPHYSICSOBJECTTYPE_KINEMATIC = 2,
	EPHYSICSOBJECTTYPE_STATIC = 3,
};

// Size: 0x90
class alignas(16) SDestructiblePieceSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SMatrix m_mTransform; // 0x0
	TArray<uint16> m_aIndices; // 0x40
	float32 m_fMass; // 0x58
	EPhysicsObjectType m_ePhysicsType; // 0x5C
	bool m_bIsAwake; // 0x60
	float4 m_fLinearVelocity; // 0x70
	float4 m_fAngularVelocity; // 0x80
};

// Size: 0x4
enum class ERuntimeMemoryAllocationState
{
	eRMAS_NeverAllocated = 0,
	eRMAS_Allocated = 1,
	eRMAS_Released = 2,
};

// Size: 0x20
class alignas(8) SDestructibleRuntimeConnnection
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint16 m_nPieceIndex; // 0x0
	TArray<uint16> m_aConnections; // 0x8
};

// Size: 0x8
class alignas(4) SDestructibleRuntimeDamage
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint16 m_nPieceIndex; // 0x0
	float32 m_fDamage; // 0x4
};

// Size: 0x60
class alignas(8) SDestructibleObjectSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SDestructibleInteractionHandlerData m_interactionData; // 0x0
	TArray<SDestructiblePieceSaveData> m_aDestructiblePieces; // 0x8
	TArray<SDestructibleRuntimeConnnection> m_aConnectionData; // 0x20
	TArray<SDestructibleRuntimeDamage> m_aDamageData; // 0x38
	uint16 m_nNumAnchors; // 0x50
	ERuntimeMemoryAllocationState m_eRuntimeMemoryAllocationState; // 0x54
	EPhysicsObjectType m_eSystemPhysicsType; // 0x58
	bool m_bHasSystemBeenDetached; // 0x5C
	bool m_bHasSystemBeenFractured; // 0x5D
	bool m_bPhysicsEnabled; // 0x5E
	bool m_bDestructionEnabled; // 0x5F
};

// Size: 0x48
class alignas(8) SIntelDisplayInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int32 index; // 0x0
	bool selected; // 0x4
	bool active; // 0x5
	ZString headline; // 0x8
	ZString bodyheadline; // 0x18
	ZString text; // 0x28
	ZString img; // 0x38
};

// Size: 0x18
class alignas(8) SIntelDisplayInfoArray_dummy
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SIntelDisplayInfo> dummy; // 0x0
};

// Size: 0x4
enum class EDramaStateFlag
{
	eDSF_DEFAULT = 0,
	eDSF_ENABLED = 1,
	eDSF_CAST = 2,
	eDSF_RESUMING = 4,
	eDSF_RUNNING = 8,
	eDSF_DONE = 16,
	eDSF_TERMINATED = 32,
};

// Size: 0x1
class alignas(1) BoneId
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class EActorState
{
	AS_DEACTIVATED = 0,
	AS_ALIVE = 1,
	AS_DYING = 2,
	AS_DEAD = 3,
	AS_DISABLED = 4,
};

// Size: 0x4
enum class ZHeroEscortSituation2Entity_EEscortState
{
	EES_Idle = 0,
	EES_Evaluate = 1,
	EES_Escorting = 2,
	EES_Intermediate = 3,
	EES_OutOfRange = 4,
};

// Size: 0x4
enum class ZKeywordCondition_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
	ANY_TRUE_IF_NO_REQS = 3,
	EQUAL = 4,
	GREATER = 5,
	LESS = 6,
};

// Size: 0x4
enum class SActorSoundDefs_EDefinition
{
	_NoSound = 0,
};

// Size: 0x4
enum class EBehaviorTreeVariableType
{
	BTVT_Invalid = -1,
	BTVT_SceneReference = 0,
	BTVT_Contextual = 1,
	BTVT_Dynamic = 2,
	BTVT_NumTypes = 3,
};

// Size: 0x4
enum class EActorPerceptionSensitivity
{
	APS_AMBIENT_DEAFBLIND = 0,
	APS_AMBIENT_SLEEPING = 1,
	APS_AMBIENT_PREOCCUPIED = 2,
	APS_AMBIENT = 3,
	APS_ALERT_LOW = 4,
	APS_ALERT = 5,
	APS_COMBAT = 6,
	APS_SPIDER_SENSE = 7,
};

// Size: 0x4
enum class ECharacterStateTransitionAttempt
{
	eSM_TA_IfDestinationCan = 0,
	eSM_TA_IfDestinationCanAndWants = 1,
	eSM_TA_IfDestinationCanAndOriginDoesNotWant = 2,
	eSM_TA_IfDestinationCanAndWantsOriginDoesNotWant = 3,
	eSM_TA_IfDestinationCanAndOriginCanNot = 4,
};

// Size: 0x4
enum class ETakeDownState
{
	eTD_Cover = 0,
	eTD_Locomotion = 1,
	eTD_ChokeLoop = 2,
	eTD_ChokeFinish = 3,
	eTD_Deactivating = 4,
	eTD_Unknown = 5,
};

// Size: 0x4
enum class ESequencePreviewState
{
	PREVIEW_STOPPED = 0,
	PREVIEW_PLAYING = 1,
	PREVIEW_PAUSED = 2,
};

// Size: 0x4
enum class ZStandOffSituation_ESituationState
{
	SS_Uncertain = 0,
	SS_Main = 1,
	SS_Arresting = 2,
	SS_GetHelp = 3,
	SS_Escalate = 4,
	SS_Investigate = 5,
	SS_GetHelpFromFleeingCivilian = 6,
};

// Size: 0x4
enum class ZAISoundEvent_ELoudness
{
	EAISEL_Default = 0,
	EAISEL_VeryLow = 1,
	EAISEL_Low = 2,
	EAISEL_Normal = 3,
	EAISEL_Loud = 4,
	EAISEL_VeryLoud = 5,
};

// Size: 0x8
class alignas(4) SGuardPointOrderSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_guardPoint; // 0x0
	bool m_walkOnly; // 0x4
};

// Size: 0x4
enum class IContractObjective_ObjectiveType
{
	KILL = 0,
	SETPIECE = 1,
	CUSTOMKILL = 2,
	CUSTOM = 3,
};

// Size: 0x28
class alignas(8) SSavableData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZVariant m_EntitiesData; // 0x0
	ZVariant m_Data; // 0x10
	uint32 m_nId; // 0x20
};

// Size: 0x4
enum class ECameraState
{
	eCamSneakStand = 0,
	eCamSneakWalk = 1,
	eCamSneakRoadyRun = 2,
	eCamNormalStand = 3,
	eCamNormalWalk = 4,
	eCamNormalRun = 5,
	eCamLocomotion = 6,
	eCamCrowdStand = 7,
	eCamCrowdWalk = 8,
	eCamCrowdRun = 9,
	eCamCrowdSneakStand = 10,
	eCamCrowdSneakWalk = 11,
	eCamCrowdSneakRoadyRun = 12,
	eCamCrowdLocomotion = 13,
	eCamDead = 14,
	eCamLadder = 15,
	eCamDrainPipe = 16,
	eCamDrag = 17,
	eCamSBTag = 18,
	eCamSBTagOTS = 19,
	eCamCloseCombat = 20,
	eCamFiberWire = 21,
	eCamWindowPull = 22,
	eCamRailPush = 23,
	eCamLedgeKick = 24,
	eCamLedgePull = 25,
	eCamLedgeHang = 26,
	eCamLedgeWalk = 27,
	eCamLedgeWalkOTS = 28,
	eCamCoverLow = 29,
	eCamCoverMedium = 30,
	eCamCoverHigh = 31,
	eCamCoverLowOTS = 32,
	eCamCoverHighOTS = 33,
	eCamCoverLowScope = 34,
	eCamCoverHighScope = 35,
	eCamCoverLowTakedownOver = 36,
	eCamCoverLowTakedownCorner = 37,
	eCamCoverHighTakedownCorner = 38,
	eCamTakeDisguise = 39,
	eCamOTS = 40,
	eCamOTSHigh = 41,
	eCamOTSLow = 42,
	eCamUnAimedShooting = 43,
	eCamUnAimedShootingHigh = 44,
	eCamUnAimedShootingLow = 45,
	eCamScope = 46,
	eCamScopeHigh = 47,
	eCamScopeLow = 48,
	eCamVaultLow = 49,
	eCamVaultHigh = 50,
	eCamTakedown = 51,
	eCamTakedownChair = 52,
	eCamLockedSniping = 53,
	eCamLockedSnipingScope = 54,
	eCamLockedSnipingScopeHigh = 55,
	eCamLockedSnipingScopeLow = 56,
	eCamContainerAssemble = 57,
	eCamNumProfiles = 58,
	eCamAll = 59,
};

// Size: 0x4
enum class ESaveType
{
	ESaveType_AutoSave = 0,
	ESaveType_QuickSave = 1,
	ESaveType_SystemData = 2,
	ESaveType_LocalProfile = 3,
};

// Size: 0x4
enum class ERequirementId
{
	EREQUIREMENT_INVALID = 0,
	EREQUIREMENT_TOKEN_OUTFIT_LEGACY_HERO_REQUIEMSUIT = 1,
	EREQUIREMENT_FIREARMS_HERO_PISTOL_TACTICAL_015_SU_SKIN05 = 2,
	EREQUIREMENT_PROP_DEVICE_SONYPREORDER_WHITE_RUBBERDUCK_REMOTE_EXPLOSIVE = 3,
	EREQUIREMENT_GOTY_PATIENT_ZERO = 4,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_PARIS_CLOWN = 5,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_HOKKAIDO_COWBOY = 6,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_MARRAKESH_DARK_SNIPER = 7,
	EREQUIREMENT_ANNIVERSARY_OUTFITS = 8,
	EREQUIREMENT_LOCATION_NEWZEALAND = 9,
	EREQUIREMENT_S2_EXECUTIVE_PACK = 10,
	EREQUIREMENT_S2_COLLECTORS_PACK = 11,
	EREQUIREMENT_S2_EXPANSION_VANITY_ITEM1 = 12,
	EREQUIREMENT_S2_EXPANSION_VANITY_ITEM2 = 13,
};

// Size: 0xA8
class alignas(8) SSaveGameMetaData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint8 nSlot; // 0x0
	ESaveType eSaveType; // 0x4
	int32 eDifficultyLevel; // 0x8
	ZString sContractId; // 0x10
	ZString sContractTitle; // 0x20
	ZString sContractType; // 0x30
	ZString sLocationId; // 0x40
	ZString sContractSessionId; // 0x50
	ZString sLastEventToken; // 0x60
	bool bIsOnline; // 0x70
	TArray<uint32> aScreenShot; // 0x78
	TArray<ERequirementId> aRequirements; // 0x90
};

// Size: 0x4
enum class ECppTypeFlags
{
	EDITOR_ONLY = 1,
	EDITOR_ONLY_CRITICAL = 2,
	RESETABLE = 4,
	RESETABLE_COND = 8,
	RESETABLE_STATIC = 16,
};

// Size: 0x4
enum class ESynchronisedActionState
{
	eSAS_INACTIVE = 0,
	eSAS_WAITING_TO_EXECUTE = 1,
	eSAS_COOLINGDOWN = 2,
};

// Size: 0x4
enum class ZUISubtitleDataProvider_EAlignment
{
	ALIGN_BOTTOM = 0,
	ALIGN_TOP = 1,
};

// Size: 0x4
enum class EInventoryConfigItemHandling
{
	EICIH_Allow = 0,
	EICIH_Store = 1,
	EICIH_InstaStore = 2,
	EICIH_Drop = 3,
	EICIH_DropOrStore = 4,
	EICIH_DropAndPickup = 5,
	EICIH_DoNothing = 6,
};

// Size: 0x4
enum class ECollidableLayer
{
	eCollLayer_COLLIDE_WITH_ALL = 0,
	eCollLayer_STATIC_COLLIDABLES_ONLY = 1,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY = 2,
	eCollLayer_STAIRS = 3,
	eCollLayer_SHOT_ONLY_COLLISION = 4,
	eCollLayer_DYNAMIC_TRASH_COLLIDABLES = 5,
	eCollLayer_KINEMATIC_COLLIDABLES_ONLY = 6,
	eCollLayer_STATIC_COLLIDABLES_ONLY_TRANSPARENT = 7,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY_TRANSPARENT = 8,
	eCollLayer_KINEMATIC_COLLIDABLES_ONLY_TRANSPARENT = 9,
	eCollLayer_STAIRS_STEPS = 10,
	eCollLayer_STAIRS_SLOPE = 11,
	eCollLayer_HERO_PROXY = 12,
	eCollLayer_ACTOR_PROXY = 13,
	eCollLayer_CLIP = 14,
	eCollLayer_ACTOR_RAGDOLL = 15,
	eCollLayer_CROWD_RAGDOLL = 16,
	eCollLayer_LEDGE_ANCHOR = 17,
	eCollLayer_ACTOR_DYN_BODY = 18,
	eCollLayer_HERO_DYN_BODY = 19,
	eCollLayer_ITEMS = 20,
	eCollLayer_WEAPONS = 21,
	eCollLayer_COLLISION_VOLUME_HITMAN_ON = 22,
	eCollLayer_COLLISION_VOLUME_HITMAN_OFF = 23,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY_NO_CHARACTER = 24,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY_NO_CHARACTER_TRANSPARENT = 25,
	eCollLayer_COLLIDE_WITH_STATIC_ONLY = 26,
	eCollLayer_AI_VISION_BLOCKER = 27,
	eCollLayer_AI_VISION_BLOCKER_AMBIENT_ONLY = 28,
	eCollayer_UNUSED_LAST = 29,
};

// Size: 0x4
enum class IContractEvaluationContextListener_EListenerType
{
	eDEFAULT = 0,
	eOBJECTIVECOUNTER = 1,
	eFORCEUPDATE = 2,
	eCUSTOM = 3,
	eCHALLENGECOUNTER = 4,
	eCHALLENGETREE = 5,
	eTOGGLE = 6,
	eMATCHARRAYS = 7,
};

// Size: 0x4
enum class EGSKillVictim
{
	GSKILLVICTIM_UNKNOWN = 0,
	GSKILLVICTIM_CIVILIAN = 1,
	GSKILLVICTIM_GUARD = 2,
	GSKILLVICTIM_TARGET = 3,
};

// Size: 0x10
class alignas(8) ZGuid
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 _a; // 0x0
	uint16 _b; // 0x4
	uint16 _c; // 0x6
	uint8 _d; // 0x8
	uint8 _e; // 0x9
	uint8 _f; // 0xA
	uint8 _g; // 0xB
	uint8 _h; // 0xC
	uint8 _i; // 0xD
	uint8 _j; // 0xE
	uint8 _k; // 0xF
};

// Size: 0x4
enum class IRenderCompositorEntity_EMode
{
	eSourceA = 0,
	eSourceB = 1,
	eLayered = 2,
	eAlphaLayered = 3,
};

// Size: 0x4
enum class IHM5Door_EOpenMode
{
	OM_TWO_WAY = 0,
	OM_OPEN_POS_SIDE_ONLY = 1,
	OM_OPEN_NEG_SIDE_ONLY = 2,
	OM_DISABLED = 3,
};

// Size: 0x4
enum class ZActorKnowledgeCondition_EEvaluationType
{
	ALL = 0,
	ANY = 1,
};

// Size: 0x4
enum class EMarkerInclusionMode
{
	MIM_DEFAULT = 0,
	MIM_IF_FORCE_INCLUDED_ONLY = 1,
};

// Size: 0x4
enum class EHeroGameState
{
	eHGS_Reserved_QueryALL = 0,
	eHGS_Reserved_QueryAny = 1,
	eHGS_InstinctModeActive = 2,
	eHGS_IsHardToSee = 3,
	eHGS_Sneaking = 4,
	eHGS_InSequence = 5,
	eHGS_InCloseCombat = 6,
	eHGS_ItemHandlingActive = 7,
	eHGS_CamSwitched = 8,
	eHGS_SniperMode = 9,
	eHGS_OTSMode = 10,
	eHGS_DualWielding = 11,
	eHGS_PreciseAim = 12,
	eHGS_ActivatingAltFire = 13,
	eHGS_FiredLastFrFocusBurnRate = 14,
	eHGS_FiredLastFrFocusGainValue = 15,
	eHGS_BurningFocus = 16,
	eHGS_InsideCloset = 17,
	eHGS_Peeking = 18,
	eHGS_FocusedInteraction = 19,
	eHGS_HoldsUtility = 20,
	eHGS_FacingRight = 21,
	eHGS_MvAgility = 22,
	eHGS_MvCover = 23,
	eHGS_MvDragging = 24,
	eHGS_MvDrainPipe = 25,
	eHGS_MvLedgeWalk = 26,
	eHGS_MvLedgeHang = 27,
	eHGS_MvLocomotion = 28,
	eHGS_MvCloseCombat = 29,
	eHGS_MvSurrendering = 30,
	eHGS_MvFriskComplying = 31,
	eHGS_MvShowItem = 32,
	eHGS_MvThrow = 33,
	eHGS_MvFiberWireKill = 34,
	eHGS_MvAlign = 35,
	eHGS_MvTakedown = 36,
	eHGS_MvSubAction = 37,
	eHGS_MvNewFullBody = 38,
	eHGS_NUM = 39,
};

// Size: 0x4
enum class ZHM5ItemInteractionEventConsumer_EHM5SoundItemInteractionEvent
{
	EIIE_ItemImpactBack = 0,
	EIIE_ItemImpactFront = 1,
	EIIE_ImpactLow = 2,
	EIIE_ItemPullOut = 3,
	EIIE_ItemOnDeadlyThrow = 4,
	EIIE_ItemSlitThroat = 5,
	EIIE_ItemSoundGeneric01 = 6,
	EIIE_ItemSoundGeneric02 = 7,
	EIIE_ItemSoundGeneric03 = 8,
};

// Size: 0x1
enum class ETessellationFactorMode
{
	TESSELLATIONFACTORMODE_FIXED = 0,
	TESSELLATIONFACTORMODE_OBJECT = 1,
	TESSELLATIONFACTORMODE_TRIANGLE = 2,
};

// Size: 0x4
enum class ETargetType
{
	eTDS_None = 0,
	eTDS_LookAtTarget = 1,
	eTDS_Spatial = 2,
	eTDS_Linked = 3,
};

// Size: 0x4
enum class EActorBumpType
{
	EABT_NONE = 0,
	EABT_UPPERBODY = 1,
	EABT_HEAD = 2,
};

// Size: 0x50
class alignas(16) ZSituationOrder
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class ZHM5GenericEventConsumer_EEvent
{
	eGeneric00 = 0,
	eGeneric01 = 1,
	eGeneric02 = 2,
	eGeneric03 = 3,
	eGeneric04 = 4,
	eGeneric05 = 5,
	eGeneric06 = 6,
	eGeneric07 = 7,
};

// Size: 0x4
enum class ZValueInt_Comparator_Poll_EEvaluationType
{
	EQUAL = 0,
	NOT_EQUAL = 1,
	LESS = 2,
	LESS_OR_EQUAL = 3,
	HIGHER = 4,
	HIGHER_OR_EQUAL = 5,
};

// Size: 0x8
class alignas(4) ZBehaviorTreeVariable
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class EHM5SoundFootstepStance
{
	EFSS_SNEAK = 0,
	EFSS_SNEAKRUN = 1,
	EFSS_WALKSLOWLY = 2,
	EFSS_WALK = 3,
	EFSS_RUN = 4,
	EFSS_ANY = 5,
};

// Size: 0x18
class alignas(8) SCppEntitySubsetInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString name; // 0x0
	uint32 flags; // 0x10
};

// Size: 0x28
class alignas(8) SCppEntityBlueprint
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TypeID typeName; // 0x0
	uint32 typeFlags; // 0x8
	TArray<SCppEntitySubsetInfo> subsets; // 0x10
};

// Size: 0x4
enum class EGestureCategory
{
	EGC_None = 0,
	EGC_AmbientDialog = 1,
	EGC_TrespassWarn1 = 2,
	EGC_TrespassWarn2 = 3,
	EGC_TrespassWarn3 = 4,
	EGC_StopWarn = 5,
};

// Size: 0x4
enum class eWeaponOperation
{
	WO_SEMI_AUTO = 0,
	WO_FULL_AUTO = 1,
};

// Size: 0x8
class alignas(4) SMusicGridData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 m_fGridDurationSec; // 0x0
	float32 m_fGridOffsetSec; // 0x4
};

// Size: 0x18
class alignas(8) ZAISetpieceDistractionContextEntity_SAIDistractionContextEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_DistractedActor; // 0x0
	ZGameTime m_CooldownExpirationTimestamp; // 0x8
	bool m_DistractionIsActive; // 0x10
};

// Size: 0x1
enum class ERayDetailLevel
{
	RAYDETAILS_NONE = 0,
	RAYDETAILS_BONES = 1,
	RAYDETAILS_MESH = 2,
};

// Size: 0x4
enum class EVictimMovementType
{
	eVictimMovementNone = -1,
	eVictimMovementPullVictimFromWindow = 0,
	eVictimMovementThrowBodyOverRail = 1,
	eVictimMovementDumpBodyOverLedge = 2,
	eVictimMovementTakeDown = 3,
	eVictimMovementRecoveryFinisher = 4,
	eVictimMovementGrabVictim = 5,
	eVictimMovementPushVictimThroughWindowAndRail = 6,
	eVictimMovementContextKill = 7,
	eVictimMovementKickVictimOverLedge = 8,
	eVictimMovementCoupDeGrace = 9,
	eVictimMovementCloseCombat = 10,
	eVictimMovementLast = 11,
};

// Size: 0x4
enum class ZHM5WeaponBasicConfigEntity_EWeaponBasicConfigAudioImpactType
{
	eWBC_AudioImpactType_Normal = 0,
	eWBC_AudioImpactType_Sweetener = 1,
};

// Size: 0x4
enum class ECameraShakerChannel
{
	eCameraShakerChannel_Default = 0,
	eCameraShakerChannle_Locomotion = 1,
	eCameraShakerChannel_Ambient = 2,
	eCameraShakerChannel_Weapon = 3,
	eCameraShakerChannel_CloseCombat = 4,
	eCameraShakerChannel_Num = 5,
};

// Size: 0x4
enum class CrowdUtil_ECrowdActorMood
{
	CM_AMBIENT = 0,
	CM_ALERTED = 1,
	CM_SCARED = 2,
	CM_PANICED = 3,
	CM_DEAD = 4,
	CM_DISABLED = 5,
	NUM_ACTOR_MOOD_TYPES = 6,
};

// Size: 0x4
enum class ESituationType
{
	AIST_Any = 0,
	AIST_DetectedInPrivate = 1,
	AIST_HandleDistraction = 2,
	AIST_Spectator = 3,
	AIST_InvestigateWeapon = 4,
	AIST_GuardBody = 5,
	AIST_Entourage = 6,
	AIST_HandleTrespassing = 7,
	AIST_DeadBody = 8,
	AIST_InvestigateCautious = 9,
	AIST_Sentry = 10,
	AIST_HandleDisguise = 11,
	AIST_SC_Curious = 12,
	AIST_SC_Alerted = 13,
	AIST_SC_Combat = 14,
	AIST_SniperCombat = 15,
	AIST_Arrest = 16,
	AIST_StandOff = 17,
	AIST_RecoverUnconscious = 18,
	AIST_AvoidExplosion = 19,
	AIST_Evacuate = 20,
	AIST_ProtoCombat = 21,
	AIST_DangerousArea = 22,
	AIST_CloseCombat = 23,
	AIST_Infected = 24,
	ESituationType_Count = 25,
};

// Size: 0x4
enum class EItemLocation
{
	eIL_Anywhere = 0,
	eIL_Inventory = 1,
	eIL_RightHand = 2,
	eIL_LeftHand = 3,
	eIL_FreeBone = 4,
	eIL_Count = 5,
};

// Size: 0x4
enum class ZContextKillGuide_EContextKillType
{
	eCKT_TOILET_DROWN = 0,
	eCKT_SNAP_AND_TOSS = 1,
	eCKT_PUSH = 2,
	eCKT_NO_ANIMATION = 3,
	eCKT_END = 4,
};

// Size: 0x4
enum class MenuWeaponUpgradeData_EUpgradeAction
{
	EUPGRADE_ACTION_NONE = 0,
	EUPGRADE_ACTION_INSTALL = 1,
	EUPGRADE_ACTION_REMOVE = 2,
	EUPGRADE_ACTION_UNLOCK_SLOT = 3,
	EUPGRADE_ACTION_BUY_NEXT_LEVEL = 4,
	EUPGRADE_ACTION_EQUIP_WEAPON = 5,
	EUPGRADE_ACTION_UNEQUIP_WEAPON = 6,
	EUPGRADE_ACTION_CLEAR_LEVELS = 7,
};

// Size: 0x4
enum class EBoolStateRequirement
{
	eBSR_Any = 0,
	eBSR_RequireTrue = 1,
	eBSR_RequireFalse = 2,
};

// Size: 0x4
enum class EIntelType
{
	eIT_DATA = 0,
	eIT_OPPORTUNITY = 1,
	eIT_BACKGROUND = 2,
	eIT_HANDLER = 3,
	eIT_UNDEFINED = 4,
};

// Size: 0x4
enum class ERayLayer
{
	eRayLayer_COLLIDE_WITH_ALL = 0,
	eRayLayer_CAMERA_COLI = 1,
	eRayLayer_CAMERA_COLI_CAMERA_OBSTACE_ONLY = 2,
	eRayLayer_HERO_FIRE = 3,
	eRayLayer_ACTOR_FIRE = 4,
	eRayLayer_ACTOR_LINE_OF_FIRE = 5,
	eRayLayer_FOOTSTEPS_COLI = 7,
	eRayLayer_BLOODSPLATDECAL_COLI = 8,
	eRayLayer_COLLIDE_WITH_STATIC = 9,
	eRayLayer_COLLIDE_WITH_STATIC_EXCL_TRANSPARENT = 10,
	eRayLayer_PARTICLES = 11,
	eRayLayer_COVERSEARCH = 12,
	eRayLayer_ACTOR_VISIBILITY = 13,
	eRayLayer_ACTOR_VISIBILITY_AMBIENT = 14,
	eRayLayer_PICKUP = 16,
	eRayLayer_HERO_PROXY = 17,
	eRayLayer_COLLIDE_WITH_STATIC_AND_SLOPE = 19,
	eRayLayer_COLLIDE_WITH_STATIC_AND_SLOPE_EXCL_TRANSPARENT = 20,
	eRayLayer_HERO_PROXY_NO_VOLUMES = 22,
	eRayLayer_PHYSICS_MANIPULATOR = 23,
	eRayLayer_UNUSED_LAST = 24,
};

// Size: 0x2
class alignas(1) SRepositionOrderSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bStrafe; // 0x0
	bool m_bAimAtTarget; // 0x1
};

// Size: 0x4
enum class EMultiplayerLobbyRequestType
{
	LOBBY_REQUEST_VOID = 0,
	LOBBY_REQUEST_IDLE = 1,
	LOBBY_REQUEST_CREATE = 2,
	LOBBY_REQUEST_CREATE_LOCALHOST = 3,
	LOBBY_REQUEST_JOIN = 4,
};

// Size: 0x4
enum class EExclusionLayer
{
	EL_NONE = 0,
	EL_STORY = 1,
	EL_AMBIENT = 2,
};

// Size: 0x4
enum class IContractObjective_Type
{
	CONTRACT_OBJ_EVENT_BASED = 0,
	CONTRACT_OBJ_SM_BASED = 1,
};

// Size: 0x18
class alignas(8) SObjetiveSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	IContractObjective_Type m_eType; // 0x0
	ZVariant m_SaveData; // 0x8
};

// Size: 0x1
enum class AudioEventCullingBehavior
{
	AutoSendStop = 0,
	AutoSendStopAfterTriggered = 1,
	NoAutoSendStop = 2,
	NoDistanceCulling = 3,
};

// Size: 0x4
enum class EConversationRole
{
	eCR_Leader = 0,
	eCR_Assistant = 1,
};

// Size: 0x4
enum class Network_PacketPriority
{
	IMMEDIATE_PRIORITY = 0,
	HIGH_PRIORITY = 1,
	MEDIUM_PRIORITY = 2,
	LOW_PRIORITY = 3,
	NUMBER_OF_PRIORITIES = 4,
};

// Size: 0x4
enum class EReplicaMode
{
	E_RM_STATIC_OBJECT = 0,
	E_RM_DYNAMIC = 1,
};

// Size: 0xC
class alignas(4) SVector3
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
};

// Size: 0x10
class alignas(4) SVector4
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
	float32 w; // 0xC
};

// Size: 0x20
class alignas(4) SSpatialSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bVisible; // 0x0
	SVector3 m_vPosition; // 0x4
	SVector4 m_vQuaternionRotation; // 0x10
};

// Size: 0x4
enum class ZValueInt_Comparator_EEvaluationType
{
	EQUAL = 0,
	NOT_EQUAL = 1,
	LESS = 2,
	LESS_OR_EQUAL = 3,
	HIGHER = 4,
	HIGHER_OR_EQUAL = 5,
};

// Size: 0x4
enum class ZSpatialEntity_ERoomBehaviour
{
	ROOM_STATIC = 0,
	ROOM_DYNAMIC = 1,
	ROOM_STATIC_OUTSIDE_CLIENT = 2,
};

// Size: 0x4
enum class ZActorPicker_EKeywordEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
};

// Size: 0x4
enum class ZOnlineManager_EError
{
	eNONE = 0,
	eGENERAL = 1000,
	eNETWORK_UNKNOWN = 1001,
	eNETWORK_SEND_FAILED = 1002,
	eAPI_VERSION = 1003,
	eAUTHENTICATION_UNAUTHORIZED = 1004,
	eAUTHENTICATION_PROXY = 1005,
	eAUTHENTICATION_SERVER_ERROR = 1006,
	eAUTHENTICATION_USER_GONE = 1007,
	eAUTHENTICATION_STEAM_GENERAL = 1008,
	eAUTHENTICATION_PSN_GENERAL = 1009,
	eAUTHENTICATION_PSN_NP_CHECK = 1010,
	eAUTHENTICATION_NO_PRIMARY_USER = 1011,
	eAUTHENTICATION_XBLIVE_GENERAL = 1012,
	eAUTHENTICATION_XBLIVE_SIGNED_OUT = 1013,
	eAUTHENTICATION_XBLIVE_USER_CHANGED = 1014,
	ePLATFORM_USERINFO = 1015,
	eCONFIGURATION = 1016,
	eENTITLEMENTS = 1017,
	ePROFILE = 1018,
	eGAME_SESSION = 1019,
	eGENERAL_SERVER_ERROR = 1020,
	eGENERAL_SERVER_BUSY = 1021,
	eGENERAL_CLIENT_ERROR = 1022,
	eDYNAMIC_RESOURCES_CONFIG_ERROR = 1023,
	eDYNAMIC_RESOURCES_UPDATEFAILED = 1024,
	eDYNAMIC_RESOURCES_OUTDATED = 1025,
	eCANCELLED = 1026,
	eERROR_MAX = 1027,
};

// Size: 0x4
enum class EDetachUsage
{
	EDU_NEVER = 0,
	EDU_ALWAYS = 1,
	EDU_RAGDOLL_ONLY = 2,
};

// Size: 0x8
class alignas(4) ZRuntimeResourceID
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_IDHigh; // 0x0
	uint32 m_IDLow; // 0x4
};

// Size: 0xA0
class alignas(8) SWeaponStatusUIData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZRuntimeResourceID icon; // 0x0
	ZRuntimeResourceID containedIcon; // 0x8
	ZString sWeaponName; // 0x10
	ZString sContainedItemName; // 0x20
	int32 nWeaponType; // 0x30
	int32 nItemHUDType; // 0x34
	int32 nAmmoRemaining; // 0x38
	int32 nAmmoTotal; // 0x3C
	int32 nAmmoInClip; // 0x40
	bool bSilenced; // 0x44
	bool bIsFirearm; // 0x45
	bool bHolstered; // 0x46
	bool bCannotBeHolstered; // 0x47
	bool bHasItemToShow; // 0x48
	bool bSuspicious; // 0x49
	bool bIllegal; // 0x4A
	bool bCanReload; // 0x4B
	bool bIsReloading; // 0x4C
	float32 fReloadDuration; // 0x50
	bool bInfiniteAmmo; // 0x54
	bool bIsContainer; // 0x55
	bool bContainsItem; // 0x56
	int32 nContainedItemHUDType; // 0x58
	bool bContainedItemIllegal; // 0x5C
	bool bContainedItemSuspicious; // 0x5D
	bool bContainedItemDetectedDuringFrisk; // 0x5E
	float32 fLastBulletFiredTime; // 0x60
	float32 fTimeBetweenBullets; // 0x64
	TArray<ZString> aPerks; // 0x68
	TArray<ZString> aAmmoTypes; // 0x80
	uint32 nCurrentAmmoType; // 0x98
};

// Size: 0x1
enum class EDestructibleInteractionType
{
	eDIT_SHOT = 0,
	eDIT_EXPLOSION = 1,
	eDIT_COLLISION = 2,
	eDIT_FRACTURE_AND_DETACH_ALL = 3,
	eDIT_OUT_OF_WORLD = 4,
	eDIT_COUNT = 5,
};

// Size: 0x4
enum class EGameEventType
{
	GET_GameplayStart = 0,
	GET_GameplayStop = 1,
	GET_IntroCutStart = 2,
	GET_IntroCutEnd = 3,
	GET_ProfilingStart = 4,
	GET_SavegameRestored = 5,
	GET_PlayingAfterLoad = 6,
	GET_COUNT = 7,
};

// Size: 0x4
enum class eParticleEmitterMeshEntity_SpawnModes
{
	MESH_SPAWNMODE_VERTEX = 0,
	MESH_SPAWNMODE_EDGE = 1,
	MESH_SPAWNMODE_FACE = 2,
};

// Size: 0x4
enum class eWeaponType
{
	WT_HANDGUN = 0,
	WT_SLOWGUN = 1,
	WT_ASSAULTRIFLE = 2,
	WT_SMG = 3,
	WT_SNIPER = 4,
	WT_RPG = 5,
	WT_KNIFE = 6,
	WT_SHOTGUN = 7,
	WT_SPOTTER = 8,
};

// Size: 0x8
class alignas(0) IMorphemeEventConsumer
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class ERatingTitle
{
	ERatingTitle_SilentAssassin = 0,
	ERatingTitle_PerfectAssassin = 1,
	ERatingTitle_Ninja = 2,
	ERatingTitle_GloryBlazer = 3,
	ERatingTitle_Eraser = 4,
	ERatingTitle_Exhibitionist = 5,
	ERatingTitle_Trickster = 6,
	ERatingTitle_Chameleon = 7,
	ERatingTitle_Spider = 8,
	ERatingTitle_Angel = 9,
	ERatingTitle_COUNT = 10,
};

// Size: 0x4
enum class ECameraControls
{
	eCameraControlsNormal = 0,
	eCameraControlsOTS = 1,
};

// Size: 0x4
enum class EHM5SoundRicochetType
{
	ESRT_VARIATION1 = 0,
	ESRT_VARIATION2 = 1,
};

// Size: 0x4
enum class ECollidableShape
{
	ECOLLIDABLESHAPE_SPHERE = 0,
	ECOLLIDABLESHAPE_CAPSULE = 1,
	ECOLLIDABLESHAPE_BOX = 2,
};

// Size: 0x4
enum class ZUISplashHintDataProviderEntity_ESplashHintType
{
	SHT_GlobalHint = 0,
	SHT_TutorialHint = 1,
	SHT_ControlHint = 2,
};

// Size: 0x4
enum class ZInteractionEventConsumer_EEvent
{
	eActivate = 0,
	eRH_Place = 1,
	eRH_Retrieve = 2,
	eRH_Swap = 3,
	eRH_Show = 4,
	eRH_Hide = 5,
	eLH_Place = 6,
	eLH_Retrieve = 7,
	eLH_Swap = 8,
	eLH_Show = 9,
	eLH_Hide = 10,
	eObjectEvent01 = 11,
	eObjectEvent02 = 12,
	eObjectEvent03 = 13,
	eObjectEvent04 = 14,
	eSoundEvent01 = 15,
	eSoundEvent02 = 16,
	eSoundEvent03 = 17,
	eSoundEvent04 = 18,
};

// Size: 0x20
class alignas(4) SCrowdPoseBoneSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SVector4 mQuaterion; // 0x0
	SVector4 mTranslation; // 0x10
};

// Size: 0x18
class alignas(8) SCrowdPoseSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SCrowdPoseBoneSaveData> m_aBones; // 0x0
};

// Size: 0x20
class alignas(8) SCrowdPoseCollectionSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint64 m_id; // 0x0
	TArray<SCrowdPoseSaveData> m_aPoses; // 0x8
};

// Size: 0x18
class alignas(8) SCrowdDeadPoseRepositorySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SCrowdPoseCollectionSaveData> m_aPoseCollections; // 0x0
};

// Size: 0x4
enum class BoneId_Enum
{
	GROUND = 0,
	PELVIS = 1,
	SPINE = 2,
	SPINE_1 = 3,
	SPINE_2 = 4,
	NECK = 5,
	NECK1 = 6,
	HEAD = 7,
	LEFT_THIGH = 8,
	LEFT_THIGH_TWIST = 9,
	LEFT_THIGH_TWIST1 = 10,
	LEFT_THIGH_TWIST2 = 11,
	LEFT_CALF = 12,
	LEFT_FOOT = 13,
	LEFT_TOE = 14,
	LEFT_TOENUB = 15,
	RIGHT_THIGH = 16,
	RIGHT_THIGH_TWIST = 17,
	RIGHT_THIGH_TWIST1 = 18,
	RIGHT_THIGH_TWIST2 = 19,
	RIGHT_CALF = 20,
	RIGHT_FOOT = 21,
	RIGHT_TOE = 22,
	RIGHT_TOENUB = 23,
	LEFT_CLAVICLE = 24,
	LEFT_UPPER_ARM = 25,
	LEFT_UPPER_ARM_TWIST = 26,
	LEFT_UPPER_ARM_TWIST1 = 27,
	LEFT_UPPER_ARM_TWIST2 = 28,
	LEFT_FOREARM = 29,
	LEFT_FORETWIST = 30,
	LEFT_FORETWIST1 = 31,
	LEFT_FORETWIST2 = 32,
	LEFT_HAND = 33,
	LEFT_FINGER_0 = 34,
	LEFT_FINGER_01 = 35,
	LEFT_FINGER_02 = 36,
	LEFT_FINGER_1 = 37,
	LEFT_FINGER_11 = 38,
	LEFT_FINGER_12 = 39,
	LEFT_FINGER_2 = 40,
	LEFT_FINGER_21 = 41,
	LEFT_FINGER_22 = 42,
	LEFT_FINGER_3 = 43,
	LEFT_FINGER_31 = 44,
	LEFT_FINGER_32 = 45,
	LEFT_FINGER_4 = 46,
	LEFT_FINGER_41 = 47,
	LEFT_FINGER_42 = 48,
	RIGHT_CLAVICLE = 49,
	RIGHT_UPPER_ARM = 50,
	RIGHT_UPPER_ARM_TWIST = 51,
	RIGHT_UPPER_ARM_TWIST1 = 52,
	RIGHT_UPPER_ARM_TWIST2 = 53,
	RIGHT_FOREARM = 54,
	RIGHT_FORETWIST = 55,
	RIGHT_FORETWIST1 = 56,
	RIGHT_FORETWIST2 = 57,
	RIGHT_HAND = 58,
	RIGHT_FINGER_0 = 59,
	RIGHT_FINGER_01 = 60,
	RIGHT_FINGER_02 = 61,
	RIGHT_FINGER_1 = 62,
	RIGHT_FINGER_11 = 63,
	RIGHT_FINGER_12 = 64,
	RIGHT_FINGER_2 = 65,
	RIGHT_FINGER_21 = 66,
	RIGHT_FINGER_22 = 67,
	RIGHT_FINGER_3 = 68,
	RIGHT_FINGER_31 = 69,
	RIGHT_FINGER_32 = 70,
	RIGHT_FINGER_4 = 71,
	RIGHT_FINGER_41 = 72,
	RIGHT_FINGER_42 = 73,
	XTRA_MUS_R_HIP = 74,
	XTRA_MUS_L_HIP = 75,
	RIGHT_HAND_ATTACHER = 76,
	LEFT_HAND_ATTACHER = 77,
	HIP_ATTACHER = 78,
	BACK_ATTACHER = 79,
	FREE_ATTACHER = 80,
	CAMERA_ATTACHER_01 = 81,
	CAMERA_ATTACHER_02 = 82,
	FREE_ATTACHER_PROP_01 = 83,
	FREE_ATTACHER_PROP_02 = 84,
	LEFT_EYE = 85,
	LEFT_EYE_LID = 86,
	RIGHT_EYE = 87,
	RIGHT_EYE_LID = 88,
	LOWER_LIP = 89,
	JAW = 90,
	HOLSTER_ATTACHER = 91,
	LEFT_WRIST_EFFECTOR = 92,
	LEFT_FINGER_0_EFFECTOR = 93,
	LEFT_FINGER_1_EFFECTOR = 94,
	LEFT_FINGER_2_EFFECTOR = 95,
	LEFT_FINGER_3_EFFECTOR = 96,
	LEFT_FINGER_4_EFFECTOR = 97,
	RIGHT_WRIST_EFFECTOR = 98,
	RIGHT_FINGER_0_EFFECTOR = 99,
	RIGHT_FINGER_1_EFFECTOR = 100,
	RIGHT_FINGER_2_EFFECTOR = 101,
	RIGHT_FINGER_3_EFFECTOR = 102,
	RIGHT_FINGER_4_EFFECTOR = 103,
	XTRA_MUS_L_PEC = 104,
	XTRA_MUS_R_PEC = 105,
	XTRA_MUS_NECK = 106,
	XTRA_MUS_L_ELBOW = 107,
	XTRA_MUS_R_ELBOW = 108,
	XTRA_MUS_L_ASS = 109,
	XTRA_MUS_R_ASS = 110,
	XTRA_MUS_L_TOE = 111,
	XTRA_MUS_L_KNEE = 112,
	XTRA_MUS_L_FOOT = 113,
	XTRA_MUS_R_TOE = 114,
	XTRA_MUS_R_KNEE = 115,
	XTRA_MUS_R_FOOT = 116,
	XTRA_TARGET_R_FOOT = 117,
	XTRA_PIVOT_R_HEEL = 118,
	XTRA_TARGET_R_KNEE = 119,
	XTRA_ALIGN_R_KNEE = 120,
	XTRA_TARGET_L_FOOT = 121,
	XTRA_PIVOT_L_HEEL = 122,
	XTRA_TARGET_L_KNEE = 123,
	XTRA_ALIGN_L_KNEE = 124,
	XTRA_TARGET_R_ASS = 125,
	XTRA_TARGET_L_ASS = 126,
	XTRA_ALIGN_L_ASS = 127,
	XTRA_ALIGN_R_ASS = 128,
	XTRA_UP_THIGH = 129,
	XTRA_TARGET_R_PEC = 130,
	XTRA_ALIGN_R_ELBOW = 131,
	XTRA_TARGET_R_ELBOW = 132,
	XTRA_TARGET_L_PEC = 133,
	XTRA_ALIGN_L_ELBOW = 134,
	XTRA_TARGET_L_ELBOW = 135,
	XTRA_ALIGN_L_PEC = 136,
	XTRA_UP_PEC = 137,
	XTRA_ALIGN_R_PEC = 138,
	XTRA_ALIGN_NECK = 139,
	HEAD_ATTACHER = 140,
	RIFLE_HOLSTER_ATTACHER = 141,
	SPINE1_ATTACHER = 142,
	PISTOL_HOLSTER_ATTACHER = 143,
	BONEID_LAST = 144,
};

// Size: 0x4
enum class ZHM5IndicatorManager_EIndicatorType
{
	eActorAmbient = 0,
	eActorAlertedLow = 1,
	eActorAlertedHigh = 2,
	eActorArrest = 3,
	eActorCombat = 4,
	eExplosion = 5,
	eObjective = 6,
	ePointOfInterest = 7,
	eContractExit = 8,
	eEasterActor = 9,
};

// Size: 0x4
enum class ZVsTargetPicker_ETargetSelectionType
{
	eTST_Random = 0,
	eTST_Fair = 1,
	eTST_Max = 2,
};

// Size: 0x4
enum class ZAvoidDangerousAreaGroup_EAvoidDangerousAreaGroupState
{
	IGS_SelectDestination = 0,
	IGS_Move = 1,
	IGS_Jump = 2,
	IGS_Wait = 3,
	IGS_Completed = 4,
	IGS_Max = 5,
};

// Size: 0x4
enum class EActorLookAtTargetType
{
	eALAT_Invalid = 0,
	eALAT_PositionTarget = 1,
	eALAT_KnownEntityType = 2,
	eALAT_PointOfInterest = 3,
	eALAT_Hero = 4,
	eALAT_Screenplay = 5,
	eALAPT_Max = 6,
};

// Size: 0x4
enum class EWeaponSpecialSituation
{
	WSS_NORMAL = 0,
	WSS_BAREHANDS = 1,
	WSS_EXPLOSION = 2,
	WSS_ACCIDENT = 3,
	WSS_NPC_FRIENDLY_FIRE = 4,
	WSS_EXECUTE_PISTOL = 5,
	WSS_ANY_WEAPON = 6,
	WSS_INVISIBLE = 7,
};

// Size: 0x4
enum class ECustomSoundDefType
{
	eCSDT_Distraction_InvestigationAck = 0,
	eCSDT_Distraction_InvestigationInvestigate = 1,
	eCSDT_Distraction_InvestigationStnd = 2,
};

// Size: 0x4
enum class EAIModifierScope
{
	AIMS_Volume = 0,
	AIMS_Behavior = 1,
	AIMS_Role = 2,
	AIMS_Item = 3,
	AIMS_Situation = 4,
	AIMS_Outfit = 5,
	AIMS_Override = 6,
	AIMS_Status = 7,
};

// Size: 0x4
enum class ZHM5WeaponEventConsumer_EAnimWeapon
{
	eHM5Weapon_HideClip = 0,
	eHM5Weapon_ShowClip = 1,
	eHM5Weapon_SpawnPhysicsClip = 2,
	eHM5Weapon_EjectCartridge = 3,
};

// Size: 0x4
enum class EStashpointContainedEntityType
{
	PICKUP_NONE = 0,
	PICKUP_ITEMS = 1,
	PICKUP_OUTFIT = 2,
	PICKUP_PICKEDUP = 3,
};

// Size: 0x4
enum class ESoundCollisionType
{
	Impact = 0,
	Rolling = 1,
	Sliding = 2,
};

// Size: 0x4
enum class ICloset_EClosetType
{
	eTypeClosetNormal = 0,
	eTypeClosetCake = 1,
	eTypeClosetDumpster = 2,
	eTypeClosetLast = 3,
};

// Size: 0x4
enum class EHitmanPermissionFlag
{
	eHPFlag_InventorySelect = 0,
	eHPFlag_CanHolsterItem = 1,
	eHPFlag_CanDropItem = 2,
	eHPFlag_CanDualWield = 3,
	eHPFlag_CameraControl = 4,
	eHPFlag_MovementControl = 5,
	eHPFlag_AimControl = 6,
	eHPFlag_CanOpenNotebook = 7,
	eHPFlag_CanOpenPauseMenu = 8,
	eHPFlag_PermissionsNUM = 9,
};

// Size: 0x4
enum class EActionRadialArcIconType
{
	EARAIT_NoIcon = 0,
	EARAIT_Locked = 1,
	EARAIT_NeedTool = 2,
	EARAIT_IsRunning = 3,
	EARAIT_Crowbar = 4,
	EARAIT_Wrench = 5,
	EARAIT_Card = 6,
	EARAIT_Lockpick = 7,
	EARAIT_Screwdriver = 8,
	EARAIT_AmmoBullet = 9,
	EARAIT_Flower = 10,
	EARAIT_ChemicalTube = 11,
	EARAIT_Golfball = 12,
	EARAIT_Keypad = 13,
	EARAIT_Key = 14,
	EARAIT_Coin = 15,
	EARAIT_Poison = 16,
	EARAIT_Exsplosive = 17,
};

// Size: 0x4
enum class ZPatrolBehaviorEntity_ERotationAlignment
{
	RA_NONE = 0,
	RA_LOOSE = 1,
	RA_EXACT = 2,
};

// Size: 0x4
enum class EParticleDecalSpawnEntity_Constraints
{
	FACTOR_AND_RANDOMIZE = 0,
	SIZE_RANGE = 1,
};

// Size: 0x10
class alignas(8) ZDynamicObject
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZVariant m_value; // 0x0
};

// Size: 0x20
class alignas(8) SChallengeSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString m_sId; // 0x0
	ZDynamicObject m_State; // 0x10
};

// Size: 0x4
enum class ZActBehaviorEntity_ERotationAlignment
{
	RA_NONE = 0,
	RA_LOOSE = 1,
	RA_EXACT = 2,
};

// Size: 0x4
enum class ZInputListenerActorPool_eInputListenerButtons
{
	EILB_UP = 0,
	EILB_LEFT = 1,
	EILB_DOWN = 2,
	EILB_RIGHT = 3,
};

// Size: 0x4
enum class CrowdRegionType
{
	CROWDSPHERE_NONE = 0,
	CROWDSPHERE_SAFE = 1,
	CROWDSPHERE_POI = 2,
	CROWDSPHERE_AVOID = 3,
	CROWDSPHERE_RELOCATE = 4,
	CROWDSPHERE_STOP = 5,
	CROWDSPHERE_ALERT = 6,
	CROWDSPHERE_SCARE = 7,
	CROWDSPHERE_GETDOWN = 8,
	CROWDSPHERE_DIE = 9,
};

// Size: 0x4
enum class EDramaEventAction
{
	eDEA_NONE = 0,
	eDEA_TERMINATE_DRAMA = 1,
	eDEA_DONE_DRAMA = 2,
	eDEA_STOP_BEHAVIOR = 4,
	eDEA_DONT_STOP_SPEAK = 8,
	eDEA_RESET_CASTING = 16,
	eDEA_RESET_STATE = 32,
};

// Size: 0x4
enum class ZRecoverUnconsciousGroup_EInvestigateGroupState
{
	IGS_InitialState = 0,
	IGS_WaitingForVictim = 1,
	IGS_Recovering = 2,
	IGS_Relocating = 3,
	IGS_Reporting = 4,
	IGS_Completed = 5,
	IGS_Max = 6,
};

// Size: 0xC
class alignas(4) STimerEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int32 m_nInterval; // 0x0
	bool m_bEnabled; // 0x4
	float32 m_fTimeToNextEvent; // 0x8
};

// Size: 0x30
class alignas(8) STimerEntitiesSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint32> m_aEntities; // 0x0
	TArray<STimerEntitySaveData> m_aData; // 0x18
};

// Size: 0x14
class alignas(4) SRandomTimerEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bEnabled; // 0x0
	bool m_bRegistered; // 0x1
	float32 m_fMinTime; // 0x4
	float32 m_fMaxTime; // 0x8
	float32 m_fProbability; // 0xC
	int32 m_nRemaining; // 0x10
};

// Size: 0x30
class alignas(8) SRandomTimerEntitiesSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint32> m_aEntities; // 0x0
	TArray<SRandomTimerEntitySaveData> m_aData; // 0x18
};

// Size: 0xA8
class alignas(8) STimerManagerSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	STimerEntitiesSaveData m_TimersData; // 0x0
	SRandomTimerEntitiesSaveData m_RandomTimersData; // 0x30
	SGameTimersSaveData m_GameTimersData; // 0x60
};

// Size: 0x4
enum class ZHM5HIKEventConsumer_EBlend
{
	eBlendIn = 0,
	eBlendOut = 1,
	eInstantOn = 2,
	eInstantOff = 3,
};

// Size: 0x4
enum class ECharacterActionRequests
{
	eSM_AR_None = 0,
	eSM_AR_ReloadR = 1,
	eSM_AR_ReloadL = 2,
	eSM_AR_ShootR = 3,
	eSM_AR_ShootL = 4,
	eSM_AR_SwapHands = 5,
	eSM_AR_HolsterR = 6,
	eSM_AR_HolsterL = 7,
	eSM_AR_UnholsterR = 8,
	eSM_AR_UnholsterL = 9,
	eSM_AR_PickupItemR = 10,
	eSM_AR_PickupItemL = 11,
	eSM_AR_InteractionR = 12,
	eSM_AR_InteractionL = 13,
	eSM_AR_InteractionSwipe = 14,
	eSM_AR_InteractionSwipeR = 15,
	eSM_AR_InteractionSwipeL = 16,
	eSM_AR_OpenDoor = 17,
	eSM_AR_OpenDoorR = 18,
	eSM_AR_OpenDoorL = 19,
	eSM_AR_CloseCombat = 20,
	eSM_AR_Movement = 21,
	eSM_AR_Pretend = 22,
	eSM_AR_Sniping = 23,
	eSM_AR_EndSniping = 24,
	eSM_AR_RetrieveFromSuitcase = 25,
	eSM_AR_Marking = 26,
	eSM_AR_ChangeAmmo = 27,
	eSM_AR_Assemble = 28,
	eSM_AR_Assemble_UnequippedContainer = 29,
	eSM_AR_Disassemble = 30,
	eSM_AR_Disassemble_PickingUp = 31,
	eSM_AR_AssembleUB = 32,
	eSM_AR_DisassembleUB = 33,
	eSM_AR_Cancel = 34,
	eSM_AR_Sprint = 35,
};

// Size: 0x4
enum class EWeaponUpgradeIcon
{
	WEAPON_UPGRADE_ICON_NONE = 0,
	WEAPON_UPGRADE_ICON_SILENCER = 1,
	WEAPON_UPGRADE_ICON_RED_DOT_SIGHT = 2,
	WEAPON_UPGRADE_ICON_AMMUNITION = 3,
	WEAPON_UPGRADE_ICON_MAGAZINE = 4,
	WEAPON_UPGRADE_ICON_EXTCLIP = 5,
	WEAPON_UPGRADE_ICON_SHELLS = 6,
	WEAPON_UPGRADE_ICON_SLIDE = 7,
	WEAPON_UPGRADE_ICON_BOLT = 8,
	WEAPON_UPGRADE_ICON_BARREL = 9,
	WEAPON_UPGRADE_ICON_HAMMER = 10,
	WEAPON_UPGRADE_ICON_CHUTE = 11,
	WEAPON_UPGRADE_ICON_DUALWIELD = 12,
	WEAPON_UPGRADE_ICON_MAGNUM = 13,
	WEAPON_UPGRADE_ICON_STOCK = 14,
};

// Size: 0x4
enum class ZDramaSituationEntity_EReentryBehavior
{
	RB_CONTINUE = 0,
	RB_TERMINATE = 1,
	RB_RESTART = 2,
	RB_RECASTANDRESTART = 3,
	RB_RECASTANDCONTINUE = 4,
};

// Size: 0x1
enum class ECollisionResponse
{
	REFLECT_VELOCITY = 0,
	SLIDE_ON = 1,
	STAY_AT_COLLISION_POINT = 2,
	CUSTOM = 3,
};

// Size: 0x4
enum class IScatterContainerEntity_EResizeMode
{
	MODE_CLEAR = 0,
	MODE_KEEPASCENTER = 1,
	MODE_SCALE = 2,
};

// Size: 0xC
class alignas(4) SGateSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rEntity; // 0x0
	bool m_bIsOpen; // 0x4
	float32 m_fOpenFraction; // 0x8
};

// Size: 0x4
enum class ZBoneWeightRotationEntity_eRotationAxises
{
	AXIS_X = 0,
	AXIS_Y = 1,
	AXIS_Z = 2,
};

// Size: 0x4
enum class ERegionMask
{
	eRM_None = 1,
	eRM_LowCover = 2,
	eRM_HighCover = 4,
	eRM_Stairs = 8,
	eRM_Separator = 16,
	eRM_User_1 = 32,
	eRM_User_2 = 64,
	eRM_User_3 = 128,
	eRM_User_4 = 256,
	eRM_User_5 = 512,
	eRM_User_6 = 1024,
	eRM_User_7 = 2048,
	eRM_User_8 = 4096,
};

// Size: 0x28
class alignas(8) SEntityTemplatePropertyAlias
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString sAliasName; // 0x0
	int32 entityID; // 0x10
	ZString sPropertyName; // 0x18
};

// Size: 0x4
enum class ECharacterAnimEvent
{
	eCAE_ReloadStarted = 699,
	eCAE_ReloadedClip = 700,
	eCAE_ReloadCompleted = 701,
	eCAE_ReloadedOneBullet = 711,
	eCAE_ReloadUpdate = 702,
	eCAE_ReloadSwapRHandAttacher = 703,
	eCAE_ReloadResetRHandSwap = 704,
	eCAE_ChangeAmmoCompleted = 712,
	eCAE_UnholsterAttachL = 9010,
	eCAE_UnholsterCompletedL = 9011,
	eCAE_UnholsterAttachR = 9012,
	eCAE_UnholsterCompletedR = 9013,
	eCAE_HolsterDetachL = 9020,
	eCAE_HolsterCompletedL = 9021,
	eCAE_HolsterDetachR = 9022,
	eCAE_HolsterCompletedR = 9023,
	eCAE_PickupActivate = 9030,
	eCAE_PickupCompleted = 9031,
	eCAE_SwipeActivate = 9030,
	eCAE_SwipeCompleted = 9031,
	eCAE_InteractionActivate = 5001,
	eCAE_InteractionCompleted = 5000,
	eCAE_SwapHandsRtoL = 9040,
	eCAE_SwapHandsRtoLCompleted = 9041,
	eCAE_SwapHandsLtoR = 9042,
	eCAE_SwapHandsLtoRCompleted = 9043,
	eCAE_OpenDoorActivate = 9051,
	eCAE_OpenDoorCompleted = 9050,
	eCAE_FlavorIdleCompleted = 9060,
	eCAE_AssembleContainerAttach = 9074,
	eCAE_AssemblePlaceAlignCompleted = 9070,
	eCAE_AssembleAttach = 9071,
	eCAE_AssembleEarlyOut = 9075,
	eCAE_AssembleToSneak = 9073,
	eCAE_AssembleCompleted = 9072,
	eCAE_HandIKEnableLeft = 10000,
	eCAE_HandIKDisableLeft = 10001,
	eCAE_HandIKEnableRight = 10002,
	eCAE_HandIKDisableRight = 10003,
	eCAE_EarlyExit = 50,
};

// Size: 0x38
class alignas(8) SDrama2ActorSaveState
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
	uint32 m_rSequence; // 0x4
	uint32 m_rBehavior; // 0x8
	uint32 m_rCurrentSpeakEntity; // 0xC
	uint32 m_rScreenplay; // 0x10
	ZString m_sMatchName; // 0x18
	ZGameTime m_tActorSpeakEnd; // 0x28
	bool m_bIsDone; // 0x30
	bool m_bIsPaused; // 0x31
	bool m_bIsSpeaking; // 0x32
	bool m_bOwnsCurrentBehavior; // 0x33
	bool m_bActive; // 0x34
	bool m_bRequired; // 0x35
};

// Size: 0x4
enum class EMatchOverCondition
{
	CompletedNormally = 0,
	OpponentsDisconnected = 1,
	OpponentsAbandoned = 2,
};

// Size: 0x4
enum class CrowdUtil_ECrowdStandingPush
{
	PUSH_FRONT = 0,
	PUSH_FRONT_LEFT = 1,
	PUSH_LEFT = 2,
	PUSH_BACK_LEFT = 3,
	PUSH_BACK = 4,
	PUSH_BACK_RIGHT = 5,
	PUSH_RIGHT = 6,
	PUSH_FRONT_RIGHT = 7,
};

// Size: 0x4
enum class EDialogueLine
{
	Hello = 0,
	MoveAlong = 1,
	WhatsGoingOn = 2,
	DropWeapon01 = 3,
	DropWeapon02 = 4,
	DropWeapon03 = 5,
	DropWeapon04 = 6,
	DropWeaponSecondWarning = 7,
	Comply01 = 8,
	Comply02 = 9,
	YouAskedForIt = 10,
	DropWeapon_Single01 = 11,
	DropWeapon_Double01 = 12,
	DropWeapon_Multiple01 = 13,
	DropWeapon_Comply_Single01 = 14,
	DropWeapon_Comply_Double01 = 15,
	DropWeapon_Comply_Multiple01 = 16,
	DropWeapon_RunAway01 = 17,
	DropWeapon_RunAway_Comply01 = 18,
	DropWeapon_Escalate_Single01 = 19,
	DropWeapon_Escalate_Double01 = 20,
	DropWeapon_Escalate_Multiple01 = 21,
};

// Size: 0x4
enum class EPostProcessorComponentType
{
	MRP_LOOKAT = 1,
	MRP_AIM = 2,
	MRP_LEDGEFEETLOCK = 16,
	MRP_LEDGEHANG = 32,
	MRP_IMPACT = 1024,
	MRP_BLINDFIRE = 2048,
};

// Size: 0x4
enum class EActionPromptState
{
	eActionPromptState_Disabled = 0,
	eActionPromptState_Enabled = 1,
	eActionPromptState_Activated = 2,
	eActionPromptState_Held = 3,
};

// Size: 0x60
class alignas(8) SHUDPromptDisplayInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bActive; // 0x0
	EActionPromptState m_eState; // 0x4
	int32 m_nIconId; // 0x8
	int32 m_eTypeId; // 0xC
	float32 m_fProgress; // 0x10
	float32 m_fDistance; // 0x14
	bool m_bShowWarning; // 0x18
	bool m_bNoActionAvailable; // 0x19
	ZString m_sLabel; // 0x20
	ZString m_sDescription; // 0x30
	ZString m_sGlyph; // 0x40
	float32 m_fOpacity; // 0x50
	bool m_bIllegalItem; // 0x54
	bool m_bSuspiciousItem; // 0x55
	bool m_bDropTempHolsterableItems; // 0x56
	int32 m_nFontSize; // 0x58
};

// Size: 0x4
enum class WebSocketUtils_ECloseStatus
{
	eCS_NORMAL = 1000,
	eCS_GOINGAWAY = 1001,
	eCS_PROTOCOLERROR = 1002,
	eCS_INVALIDDATA = 1003,
	eCS_1004 = 1004,
	eCS_NOSTATUSRCVD = 1005,
	eCS_ABNORMALCLOSURE = 1006,
	eCS_INVALIDPAYLOAD = 1007,
	eCS_POLICYVIOLATION = 1008,
	eCS_MSGTOOBIG = 1009,
	eCS_MANDATORYEXT = 1010,
	eCS_INTERNALSRVERR = 1011,
	eCS_TLSHANDSHAKE = 1015,
};

// Size: 0x28
class alignas(8) ZDisguiseSituation_SSituationSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_pLeader; // 0x0
	TArray<int32> m_aInvestigateDisguiseGroups; // 0x8
	EAISharedEventType m_eEventSetOnEscalation; // 0x20
};

// Size: 0x4
enum class EControlButtonName
{
	eCN_ABORT = 0,
	eCN_ACTION = 1,
	eCN_ACTIVATE_PROP = 2,
	eCN_AGILITY_DOWN = 3,
	eCN_AGILITY_ENTERWINDOW = 4,
	eCN_AGILITY_SNEAKPASTWINDOW = 5,
	eCN_AGILITY_THROWOVERRAIL = 6,
	eCN_AGILITY_UP = 7,
	eCN_AIM = 8,
	eCN_COVER_ENTER = 9,
	eCN_COVER_TAKEDOWN = 10,
	eCN_COVER_TO_COVER = 11,
	eCN_CROUCH = 12,
	eCN_DRAGBODY = 13,
	eCN_DUMPBODY = 14,
	eCN_FIBERWIRE = 15,
	eCN_INSTINCT = 16,
	eCN_INVENTORY_HOLSTER = 17,
	eCN_INVENTORY_LONGRANGE = 18,
	eCN_MARK_TARGET = 19,
	eCN_CHANGE_AMMO_NEXT = 20,
	eCN_CHANGE_AMMO_PREVIOUS = 21,
	eCN_INVENTORY_PROP = 22,
	eCN_INVENTORY_SHORTRANGE = 23,
	eCN_ITEM_DROP = 24,
	eCN_ITEM_THROW = 25,
	eCN_MELEE_HIT = 26,
	eCN_MELEE_TAKEDOWN = 27,
	eCN_PICKUP = 28,
	eCN_RUN = 29,
	eCN_WALK_SLOW = 30,
	eCN_CONCEAL_RETRIEVE = 31,
	eCN_SB_ACTIVATE = 32,
	eCN_SB_CANCEL = 33,
	eCN_SB_EXECUTE = 34,
	eCN_SB_REMOVETAG = 35,
	eCN_SHOOT = 36,
	eCN_NOTEBOOK = 37,
	eCN_PAUSE = 38,
	eCN_NO_ICON = 39,
};

// Size: 0x4
enum class ZInvestigateDisguiseGroup_EState
{
	eInit = 0,
	eGuardBanter = 1,
	eAcknowledge = 2,
	eMain = 3,
	eSearch = 4,
	eMoveback = 5,
	eStandDown = 6,
	eEscalate = 7,
	eDone = 8,
};

// Size: 0x1
enum class ECOMUsage
{
	ECOMUSAGE_AUTOCOMPUTE = 0,
	ECOMUSAGE_PIVOT = 1,
};

// Size: 0x4
enum class EActorEmotionState
{
	AES_Ambient = 0,
	AES_Alerted = 1,
	AES_Scared = 2,
	AES_Hunt = 3,
	AES_Combat = 4,
	AES_None = 268435455,
};

// Size: 0x4
enum class EChatState
{
	NOT_TALKING = 0,
	TALKING = 1,
	MUTED = 2,
	RESTRICTED = 3,
};

// Size: 0x18
class alignas(4) SStepCounterEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 m_nIndex; // 0x0
	int32 m_nLoopIndex; // 0x4
	bool m_bFirst; // 0x8
	bool m_bEnabled; // 0x9
	float32 m_nCountFrom; // 0xC
	float32 m_nCountTo; // 0x10
	float32 m_nStepSize; // 0x14
};

// Size: 0x4
enum class eAmmoType
{
	eAmmoGun = 0,
	eAmmoRevolver = 1,
	eAmmoSMG = 2,
	eAmmoRifle = 3,
	eAmmoShotgun = 4,
	eAmmoSniper = 5,
	eAmmoMG = 6,
	eAmmoRPG = 7,
	eAmmoFake = 8,
	eAmmoLightPistol = 9,
	eAmmoDartTranquilizer = 10,
	eAmmoShotgunBeanbag = 11,
	eUnknownAmmoType = 12,
};

// Size: 0x4
enum class ZEntityPropertyReplica_EReplicationStrategy
{
	REP_ALL_PROPERTIES = 0,
	REP_ALL_EXCEPT = 1,
	REP_ONLY_SPECIFIC = 2,
};

// Size: 0x10
class alignas(8) SLoadRuntimeResourceResult
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString sFilePath; // 0x0
};

// Size: 0x4
enum class ZApproachOrder_EApproachStyle
{
	AS_AUTO = 0,
	AS_SPRINT = 1,
	AS_JOG = 2,
	AS_WALK = 3,
};

// Size: 0x4
enum class ZInvestigateCautiousSituation_EBystanderState
{
	BS_SelectCandidate = 0,
	BS_SelectPoint = 1,
	BS_SearchDangerField = 2,
};

// Size: 0x4
class alignas(4) SHeroEscortSituation2Actors
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
};

// Size: 0x4
enum class ZSmuggleSituationEntity_ESmuggleState
{
	ESS_Idle = 0,
	ESS_Evaluate = 1,
	ESS_FindJob = 2,
	ESS_OnRouteToLocation = 3,
	ESS_PickingUp = 4,
	ESS_PuttingDown = 5,
	ESS_OnABreak = 6,
};

// Size: 0x4
enum class ZSniperCombatSituation_ESituationState
{
	SS_Main = 0,
	SS_StandDown = 1,
	SS_InvalidSituation = 2,
};

// Size: 0x14
class alignas(4) SSpatialMoverEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 m_fSpeed; // 0x0
	SVector3 m_vPosition; // 0x4
	bool m_bEnabled; // 0x10
	bool m_bBackwards; // 0x11
	bool m_bIsFrameUpdateRegistered; // 0x12
};

// Size: 0x1
enum class EValueUpdateStrategy
{
	UPDATE_STRATEGY_REPLACE = 0,
	UPDATE_STRATEGY_ADD_TO = 1,
	UPDATE_STRATEGY_MULTIPLY = 2,
};

// Size: 0x4
enum class IItemWeapon_EDeadlyThrowType
{
	DEADLYTHROW_NONE = 0,
	DEADLYTHROW_LIGHT = 1,
	DEADLYTHROW_HEAVY = 2,
};

// Size: 0x2
class alignas(1) SLayerBehaviorConfiguration
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bTrigger; // 0x0
	bool m_bCollector; // 0x1
};

// Size: 0x4
enum class EOnlineEventInvestigationType
{
	OEIT_Generic = 0,
	OEIT_HearBulletImpact = 1,
	OEIT_HearFootsteps = 2,
	OEIT_CarAlarm = 3,
	OEIT_HearBark = 4,
	OEIT_HearPain = 5,
	OEIT_HearRadio = 6,
	OEIT_HearItemToss = 7,
	OEIT_SeeItemToss = 8,
	OEIT_HearAccident = 9,
	OEIT_CuriousSound = 10,
	OEIT_CuriousItemSound = 11,
	OEIT_SeeWeapon = 12,
	OEIT_SeeItem = 13,
	OEIT_Perceptible = 14,
	OEIT_Toss = 15,
	OEIT_CrowdCurious = 16,
	OEIT_CameraDefect = 17,
};

// Size: 0x8
class alignas(0) IBodybagEntity
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class ZEscortSituationEntity_ETargetState
{
	ETS_Unknown = 0,
	ETS_NoTarget = 1,
	ETS_RunningActBehavior = 2,
	ETS_RunningDummyBehavior = 3,
	ETS_RunningOtherBehavior = 4,
	ETS_Dead = 5,
	ETS_TargetIsHitman = 6,
};

// Size: 0x4
enum class ECoverPosition
{
	COVER_POSITION_NONE = 0,
	COVER_POSITION_LEFT = 1,
	COVER_POSITION_RIGHT = 2,
	COVER_POSITION_MIDDLE = 3,
};

// Size: 0x4
enum class IRenderCompositorEntity_EViewportAnchor
{
	eFill = 0,
	eTopLeft = 1,
	eTopRight = 2,
	eBottomLeft = 3,
	eBottomRight = 4,
};

// Size: 0x4
enum class SUITestData_ETestEnum
{
	ETestEnum_Value_One = 1,
	ETestEnum_Value_Two = 2,
	ETestEnum_Value_Three = 3,
};

// Size: 0x4
enum class EAgilityState
{
	eAgState_JumpToHangFromLocomotion = 0,
	eAgState_ClimbOnToLedgeFromLocomotion = 1,
	eAgState_ClimbToHangFromLocomotion = 2,
	eAgState_WalkOnFromLocomotion = 3,
	eAgState_WalkOffToLocomoton = 4,
	eAgState_PullUpToLedgeWalk = 5,
	eAgState_PullUpToLocomotion = 6,
	eAgState_LedgeJumpOffToLocomotion = 7,
	eAgState_VaultOverLedgeFromCover = 8,
	eAgState_ClimbOnToLedgeFromCover = 9,
	eAgState_LedgeHangDefault = 10,
	eAgState_LedgeWalkDefault = 11,
	eAgState_TransLedgeHangDownToWalk = 12,
	eAgState_TransLedgeHangUpToWalk = 13,
	eAgState_TransLedgeWalkDownToHang = 14,
	eAgState_TransLedgeWalkUpToHang = 15,
	eAgState_TransLedgeHangUpToRail = 16,
	eAgState_TransLedgeHangToLocomotion = 17,
	eAgState_TransLedgeWalkToLocomotion = 18,
	eAgState_LedgeHangJumpLeft = 19,
	eAgState_LedgeHangJumpRight = 20,
	eAgState_LedgeWalkJumpLeft = 21,
	eAgState_LedgeWalkJumpRight = 22,
	eAgState_SneakPastWindowLeftToRight = 23,
	eAgState_SneakPastWindowRightToLeft = 24,
	eAgState_ClimbWindowFromLedgeToLocomotion = 25,
	eAgState_ClimbWindowFromLocomotionToLedge = 26,
	eAgState_ClimbWindowFromLocomotionToLocomotion = 27,
	eAgState_ClimbWindowFromCoverToLocomotion = 28,
	eAgState_ClimbWindowFromCoverToLedge = 29,
	eAgState_ClimbOnToLedgeFromDrainPipe = 30,
	eAgState_ClimbToHangFromDrainPipe = 31,
	eAgState_ClimbToWalkFromDrainPipeLeft = 32,
	eAgState_ClimbToWalkFromDrainPipeRight = 33,
	eAgState_Deactivate = 34,
	eAgState_Unknown = 35,
};

// Size: 0x4
enum class EOutfitType
{
	eOT_None = 0,
	eOT_Suit = 1,
	eOT_Guard = 2,
	eOT_Worker = 3,
	eOT_Waiter = 4,
	eOT_LucasGrey = 5,
};

// Size: 0x60
class alignas(16) ZRayQueryInput
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x18
class alignas(8) ZKeywordCalculator_SCollection
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<int32> aKeywords; // 0x0
};

// Size: 0x4
enum class ZActorTensionEntity_ETensionCheckMode
{
	ETCM_INSIDE_VOLUME_OR_LIST = 0,
	ETCM_INSIDE_VOLUME_AND_LIST = 1,
};

// Size: 0x4
enum class ZScreenplay_EState
{
	State_Idle = 0,
	State_Running = 1,
	State_Paused = 2,
	State_Failed = 3,
	State_Done = 4,
};

// Size: 0x1
enum class AudioBusFlags
{
	AudioBus_Master = 1,
	AudioBus_Primary = 2,
};

// Size: 0x4
enum class ZInputListenerButtonEntity_eInputListenerButtons
{
	EILB_UP = 0,
	EILB_LEFT = 1,
	EILB_DOWN = 2,
	EILB_RIGHT = 3,
};

// Size: 0x4
enum class EDifficultyParameter
{
	EDP_Invalid = 0,
	EDP_AIAttentionGainMultiplier = 1,
	EDP_AIAudioPerceptionAlwaysEmitFootstepSoundEvents = 2,
	EDP_AICombat_ActiveCombatants_MinimumNumber = 3,
	EDP_AICombat_ActiveCombatants_MinimumNumberWhenAllVIPsAreDead = 4,
	EDP_AICombat_ActiveCombatants_MaximumNumber = 5,
	EDP_AICombat_ActiveCombatants_MinimumAmountForMedium = 6,
	EDP_AICombat_ActiveCombatants_MinimumAmountForMany = 7,
	EDP_AICombat_ShootingAccuracyResetPeriod_Minimum = 8,
	EDP_AICombat_ShootingAccuracyResetPeriod_Maximum_FewCombatants = 9,
	EDP_AICombat_ShootingAccuracyResetPeriod_Maximum_MediumCombatants = 10,
	EDP_AICombat_ShootingAccuracyResetPeriod_Maximum_ManyCombatants = 11,
	EDP_AICombat_Leaders_NumberOfActiveCombatantsNeededForOneLeader = 12,
	EDP_AICombat_Leaders_NumberOfActiveCombatantsNeededForTwoLeaders = 13,
	EDP_AICombat_MaximumInterestingCombatLifetime = 14,
	EDP_AICombat_MaximumInterestingTimeSinceLastCombat = 15,
	EDP_AICombat_ShootingAccuracyInitialBuildUp_MinimumDuration = 16,
	EDP_AICombat_ShootingAccuracyInitialBuildUp_MaximumDuration = 17,
	EDP_AICombat_ShootingAccuracy_MinimumDistance = 18,
	EDP_AICombat_FlashGrenadeThrow_GlobalCooldown = 19,
	EDP_AICombat_FlashGrenadeThrow_AggressionTriggerCooldown = 20,
	EDP_AICombat_FlashGrenadeThrow_TargetCampingTriggerCooldown = 21,
	EDP_AICombat_FlashGrenadeThrow_LargeRelocationTriggerCooldown = 22,
	EDP_AIDisguise_FollowWarningsDelay = 23,
	EDP_AIDisguise_BreakOnVeryCloseDistance = 24,
	EDP_AIEscortOut_MaxForbiddenMovement = 25,
	EDP_AIEscortOut_EscortEscalateDistance = 26,
	EDP_AIEscortOut_MaxTimeToHonorWarning = 27,
	EDP_AIEscortOut_EscortHardWarningDistance = 28,
	EDP_AIIllegalActionAttentionModifier = 29,
	EDP_AIInvestigateCautious_Disturbance_Radius = 30,
	EDP_AIInvestigateCautious_Search_ClearDisturbanceBackRadius = 31,
	EDP_AIInvestigateCautious_Search_ClearDisturbanceFrontRadius = 32,
	EDP_AIInvestigateCautious_Search_ClearDisturbanceRespectSoftReservationThreshold = 33,
	EDP_AIInvestigateCautiousAttentionToPersonEnabled = 34,
	EDP_AIInvestigateDisguiseMembersFollowDistance = 35,
	EDP_AILongTermMemory_DisableArrest = 36,
	EDP_AIRunningAttentionModifier = 37,
	EDP_AISentry_WarningDelay = 38,
	EDP_AISuspiciousMovementDisguiseAttentionModifier = 39,
	EDP_AISuspiciousMovementSensorEnabled = 40,
	EDP_AISuspiciousLostTargetTime = 41,
	EDP_AllowInstinctGlow = 42,
	EDP_ArrestEscalateIllegalWeapon = 43,
	EDP_ArrestEscalateMaximum = 44,
	EDP_ArrestEscalateMoving = 45,
	EDP_ArrestEscalateRunning = 46,
	EDP_ArrestTargetLostTime = 47,
	EDP_CloseCombatChainFailDamage = 48,
	EDP_CloseCombatChoiceWindowLength = 49,
	EDP_CloseCombatChokePressCount_Civilian = 50,
	EDP_CloseCombatChokePressCount_Elite = 51,
	EDP_CloseCombatChokePressCount_Guard = 52,
	EDP_CloseCombatCounterEndLength = 53,
	EDP_CloseCombatCounterFailDamage = 54,
	EDP_CloseCombatShowSnapNeckPressCount_Civilian = 55,
	EDP_CloseCombatShowSnapNeckPressCount_Elite = 56,
	EDP_CloseCombatShowSnapNeckPressCount_Guard = 57,
	EDP_DamageMultiplierHandgun = 58,
	EDP_DamageMultiplierSlowgun = 59,
	EDP_DamageMultiplierAssaultRifle = 60,
	EDP_DamageMultiplierSMG = 61,
	EDP_DamageMultiplierSniper = 62,
	EDP_DamageMultiplierRPG = 63,
	EDP_DamageMultiplierKnife = 64,
	EDP_DamageMultiplierShotgun = 65,
	EDP_DamageMultiplierSpotter = 66,
	EDP_DamageMultiplierHandgun_NPC = 67,
	EDP_DamageMultiplierSlowgun_NPC = 68,
	EDP_DamageMultiplierAssaultRifle_NPC = 69,
	EDP_DamageMultiplierSMG_NPC = 70,
	EDP_DamageMultiplierSniper_NPC = 71,
	EDP_DamageMultiplierRPG_NPC = 72,
	EDP_DamageMultiplierKnife_NPC = 73,
	EDP_DamageMultiplierShotgun_NPC = 74,
	EDP_DamageMultiplierSpotter_NPC = 75,
	EDP_DisguiseRuiningEnabled = 76,
	EDP_GameMissionSaveLimit = 77,
	EDP_GameOpportunitiesEnabled = 78,
	EDP_HearRangeBulletImpact = 79,
	EDP_HearRangeBulletImpactOnBody = 80,
	EDP_HearRangeCloseCombatBreakNeck = 81,
	EDP_HearRangeCloseCombatChoke = 82,
	EDP_HearRangeCloseCombatFiberWire = 83,
	EDP_HearRangeCloseCombatHitFromBehind = 84,
	EDP_HearRangeCloseCombatL1 = 85,
	EDP_HearRangeCloseCombatL2 = 86,
	EDP_HearRangeCloseCombatL3 = 87,
	EDP_HearRangeEventAccident = 88,
	EDP_HearRangeEventAlarm = 89,
	EDP_HearRangeEventExplosion = 90,
	EDP_HearRangeEventRadio = 91,
	EDP_HearRangeEventStrange = 92,
	EDP_HearRangeEventThrownItem = 93,
	EDP_HearRangeFootstepWalkSlow = 94,
	EDP_HearRangeFootstepWalk = 95,
	EDP_HearRangeFootstepRun = 96,
	EDP_HearRangeFootstepCrouchWalkSlow = 97,
	EDP_HearRangeFootstepCrouchWalk = 98,
	EDP_HearRangeFootstepCrouchRun = 99,
	EDP_HearRangeFootstepVegetationLVAWalkSlow = 100,
	EDP_HearRangeFootstepVegetationLVAWalk = 101,
	EDP_HearRangeFootstepVegetationLVARun = 102,
	EDP_HearRangeFootstepVegetationLVACrouchWalkSlow = 103,
	EDP_HearRangeFootstepVegetationLVACrouchWalk = 104,
	EDP_HearRangeFootstepVegetationLVACrouchRun = 105,
	EDP_HearRangeGunEmpty = 106,
	EDP_HearRangeGunShot = 107,
	EDP_HearRangeGunSilenced = 108,
	EDP_HearRangeGunSuperSilenced = 109,
	EDP_HearRangeSpeakAngry = 110,
	EDP_HearRangeSpeakHelp = 111,
	EDP_HearRangeSpeakHelpLoud = 112,
	EDP_HearRangeSpeakPain = 113,
	EDP_HearRangeSpeakPainLow = 114,
	EDP_HearRangeSpeakWarning = 115,
	EDP_HitmanDamageReceivedMultiplier = 116,
	EDP_InstinctModeBurnRate = 117,
	EDP_InstinctRegenCap = 118,
	EDP_InstinctRegenRate = 119,
	EDP_ManhuntGroupMaxSearchTime = 120,
	EDP_ManhuntGroupSearchAreaHackMaxDistance = 121,
	EDP_ManhuntGroupSearchAreaRadius = 122,
	EDP_MaxCoverShootActorCountMultiplier = 123,
	EDP_MinAttentionToForceLookAt = 124,
	EDP_MinAttentionToForceLookAtIfIncreasing = 125,
	EDP_NPCDamageReceivedMultiplier = 126,
	EDP_PlayerDamagePerSecondDistance = 127,
	EDP_PlayerDamagePerSecondLimitFar = 128,
	EDP_PlayerDamagePerSecondLimitNear = 129,
	EDP_PlayerDamagePerSecondThreshold = 130,
	EDP_PlayerHitPointsMax = 131,
	EDP_PlayerHitPointsRegenerationDelay = 132,
	EDP_PlayerHitPointsRegenerationPerSecond = 133,
	EDP_SecurityCameras = 134,
	EDP_SightReactionMinAttention = 135,
	EDP_SightInvestigationMinAttention = 136,
	EDP_ShootSpreadMax = 137,
	EDP_ShootSpreadMin = 138,
	EDP_ShootSpreadRange = 139,
	EDP_SocialGreetingAngle = 140,
	EDP_SocialGreetingCooldown = 141,
	EDP_SocialGreetingCooldownAlertLevel = 142,
	EDP_SocialGreetingCooldownLastSpeak = 143,
	EDP_SocialGreetingCooldownPlayer = 144,
	EDP_SocialGreetingCooldownSequence = 145,
	EDP_SocialGreetingDistance = 146,
	EDP_SocialLookAtTimeMax = 147,
	EDP_SocialLookAtTimeMin = 148,
	EDP_SocialSillyCooldown = 149,
	EDP_SocialSillyDistance = 150,
	EDP_SocialSillyTriggerTime = 151,
	EDP_SocialStandingCooldown = 152,
	EDP_SocialStandingDistance = 153,
	EDP_SocialStandingDistanceImmediate = 154,
	EDP_SocialStandingTriggerTime = 155,
	EDP_SpotHitmanShootingDistance = 156,
	EDP_StrictItemRules = 157,
	EDP_COUNT = 158,
};

// Size: 0x4
enum class EEquipAbility
{
	EA_EQUIP_IN_HANDS = 0,
	EA_CANNOT_BE_EQUIPPED = 1,
};

// Size: 0x3
class alignas(1) SContextActionSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bEnabled; // 0x0
	bool m_bTriggered; // 0x1
	bool m_bShouldShow; // 0x2
};

// Size: 0x4
enum class EAISituationEvent
{
	AISE_Any = 0,
	AISE_ActorJoined = 1,
	AISE_ActorLeft = 2,
	AISE_Data = 3,
};

// Size: 0x4
enum class IKEndEffector
{
	BEE_Pelvis = 0,
	BEE_SpineOrigin = 1,
	BEE_SpineEnd = 2,
	BEE_Head = 3,
	BEE_LeftUpperArm = 4,
	BEE_RightUpperArm = 5,
	BEE_LeftForeArm = 6,
	BEE_RightForeArm = 7,
	BEE_LeftHand = 8,
	BEE_LeftHandThumb = 9,
	BEE_LeftHandIndex = 10,
	BEE_LeftHandMiddle = 11,
	BEE_LeftHandRing = 12,
	BEE_LeftHandPinky = 13,
	BEE_RightHand = 14,
	BEE_RightHandThumb = 15,
	BEE_RightHandIndex = 16,
	BEE_RightHandMiddle = 17,
	BEE_RightHandRing = 18,
	BEE_RightHandPinky = 19,
	BEE_LeftFoot = 20,
	BEE_RightFoot = 21,
	BEE_LeftToe = 22,
	BEE_RightToe = 23,
	BEE_Count = 24,
};

// Size: 0x4
enum class ESmartWaitCondition
{
	SWC_Time = 0,
	SWC_Distance = 1,
	SWC_Executing = 2,
	SWC_Executed = 3,
};

// Size: 0x4
enum class ERegionId
{
	RegionId_Default = 0,
	RegionId_Japan = 1,
	RegionId_Asia = 2,
};

// Size: 0x4
enum class ZActorPickerEffectTrack_EEffectPhaseAction
{
	EPA_ATTACH = 0,
	EPA_DETACH = 1,
};

// Size: 0x4
enum class EVolumeTriggerEntityTypeFlags
{
	VTET_Hitman = 1,
	VTET_ActorAlive = 2,
	VTET_ActorDead = 4,
	VTET_ActorPacified = 8,
	VTET_ThrownItem = 16,
	VTET_Spatial = 32,
	VTET_SoundSweetener = 64,
	VTET_ExplodeableItem = 128,
	VTET_Item = 256,
	VTET_SpatialVisible = 512,
};

// Size: 0x50
class alignas(16) SActorThrowSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rItem; // 0x0
	float4 m_vStartPosition; // 0x10
	float4 m_vEndPosition; // 0x20
	float4 m_vItemVelocity; // 0x30
	float32 m_fDistance; // 0x40
};

// Size: 0x18
class alignas(8) SIntelListDisplayInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int32 index; // 0x0
	bool active; // 0x4
	bool newInfo; // 0x5
	ZString label; // 0x8
};

// Size: 0x4
enum class ZSniperCombatGroup_EGroupState
{
	IGS_WaitingForActors = 0,
	IGS_Move = 1,
	IGS_Siege = 2,
	IGS_Completed = 3,
	IGS_Max = 4,
};

// Size: 0x4
enum class ZLeadEscortSituationEntity_EEscortState
{
	EES_Idle = 0,
	EES_Evaluate = 1,
	EES_Escorting = 2,
	EES_Intermediate = 3,
};

// Size: 0x4
enum class ZHM5WeaponBasicConfigEntity_EWeaponBasicConfigAudioFireType
{
	eWBC_AudioFireType_Full_Automatic = 0,
	eWBC_AudioFireType_Single = 1,
};

// Size: 0x4
class alignas(4) ZDetectedInPrivateSituation_SSituationSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int32 m_pDetectedInPrivateGroup; // 0x0
};

// Size: 0x4
enum class EButtonPressType
{
	BUTTON_PRESS = 0,
	BUTTON_HOLD = 1,
	BUTTON_REPEAT = 2,
	BUTTON_TAP = 3,
	BUTTON_ROTATE_CCW = 4,
	BUTTON_PRESS_TYPE_MAX = 5,
};

// Size: 0x4
enum class EImpactEffectsOptions
{
	eIE_None = 0,
	eIE_BloodSplatter = 1,
	eIE_Decals = 2,
	eIE_MaterialImpactEffects = 4,
	eIE_AmmoImpactEffect = 8,
	eIE_All = 16,
};

// Size: 0x4
enum class EFSMStateStatus
{
	eInactive = 0,
	eActive = 1,
	eCompleted = 2,
	eFailed = 3,
	eInterrupted = 4,
};

// Size: 0x18
class alignas(8) SFSMSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	EFSMStateStatus m_eStateStatus; // 0x0
	int32 m_state; // 0x4
	int32 m_prevState; // 0x8
	ZGameTime m_tCurrentStateEnterTime; // 0x10
};

// Size: 0x4
enum class EDisturbanceType
{
	DT_Generic = 0,
	DT_SeeWeapon = 1,
	DT_BodyNeedsBagging = 2,
	DT_SoundCloseCombat = 3,
	DT_SoundGunSilenced = 4,
	DT_SoundBulletImpact = 5,
	DT_SoundNeckBreak = 6,
	DT_SoundSpeakPain = 7,
	DT_SoundGunshot = 8,
	DT_SoundExplosion = 9,
	DT_SeeExplosion = 10,
	DT_DeadBody = 11,
	DT_HitmanNearDeadBody = 12,
	DT_HitmanNearPacifiedBody = 13,
	DT_SeeTakeKeyCard = 14,
	DT_SeeTakeSecurityTape = 15,
	DT_SeeChangeOutfit = 16,
	DT_SeeTrespasser = 17,
	DT_SeeBrokenDisguise = 18,
	DT_SeeIllegalWeapon = 19,
	DT_SeeDraggingBody = 20,
	DT_SeeDeath = 21,
	DT_SeeKilling = 22,
	DT_UnconsciousVictim = 23,
	DT_HuntTarget = 24,
	DT_CrowdAlerted = 25,
	DT_SeeGunshotVictim = 26,
	DT_SoundThrownItem = 27,
	DT_SoundThrownItemSeenThrowing = 28,
	DT_HitByItemOrCoin = 29,
	DT_PrivateAreaViolated = 30,
	DT_SetpieceInteraction = 31,
	DT_IllegalAction = 32,
	DT_KnockdownMelee = 33,
	DT_KnockdownThrow = 34,
	DT_BumpedTooMuch = 35,
	DT_Murder = 36,
	DT_Strangle = 37,
	DT_GotShot = 38,
	DT_MurderAttempt = 39,
	DT_LongTermMemory = 40,
	DT_Accident = 41,
	DT_MAX = 42,
};

// Size: 0x90
class alignas(16) SGetHelpGroupSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float4 m_vLastKnownTargetPosition; // 0x0
	uint16 m_rReturnNode; // 0x10
	TArray<uint16> m_blocked; // 0x18
	bool m_bReportingToHitman; // 0x30
	bool m_bStartedReportDialog; // 0x31
	bool m_bMultipleBodies; // 0x32
	bool m_bGetHelpOrderCompleted; // 0x33
	bool m_bDoneReporting; // 0x34
	ZGameTime m_tGetHelpCompleted; // 0x38
	SFSMSaveData m_fsmState; // 0x40
	EDisturbanceType m_type; // 0x58
	uint32 m_target; // 0x5C
	uint32 m_pReporter; // 0x60
	uint32 m_pGuard; // 0x64
	uint32 m_IllegalItem; // 0x68
	TArray<uint32> m_additionalGuards; // 0x70
};

// Size: 0x4
enum class EBooleanOption
{
	BO_Off = 0,
	BO_On = 1,
	BO_Default = 2,
};

// Size: 0x4
enum class EStandRepositionStrategy
{
	SRS_InPlaceRepositioning = 0,
	SRS_NoRepositioning = 1,
};

// Size: 0x4
class alignas(4) SActorDynamicTemplateManipulatorSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
};

// Size: 0x4
enum class ZLookAtLogic_EAxisSelect
{
	eX = 0,
	eX_NEG = 1,
	eY = 2,
	eY_NEG = 3,
	eZ = 4,
	eZ_NEG = 5,
};

// Size: 0x4
enum class ESituationStateChangeReason
{
	eSSCR_NONE = 0,
	eSSCR_C_DIED = 16,
	eSSCR_C_DEACTIVATED = 32,
	eSSCR_C_CONTROLLED = 64,
	eSSCR_C_CLOSE_COMBAT = 128,
	eSSCR_C_HERO_ACTION = 256,
	eSSCR_C_PACIFIED = 512,
	eSSCR_CL_CHILD_DRAMA = 1024,
	eSSCR_CL_OTHER_DRAMA = 2048,
	eSSCR_CL_SYSTEMIC = 4096,
	eSSCR_S_DISABLED = 8192,
	eSSCR_S_DONE = 16384,
	eSSCR_S_TERMINATED = 32768,
	eSSCR_S_STARTED = 65536,
	eSSCR_S_RESUMING = 131072,
	eSSCR_S_UNPAUSE = 262144,
	eSSCR_R_RESOURCE_UNAVAILABLE = 524288,
	eSSCR_PAUSED_FROM_PLAYING = 1048576,
	eSSCR_PAUSED_FROM_RESUMING = 2097152,
};

// Size: 0x1
enum class EMaterialRegistrationState
{
	eMRS_None = 0,
	eMRS_Pending = 1,
	eMRS_Success = 2,
	eMRS_Failed = 3,
};

// Size: 0x4
enum class ZHeroEscortSituationEntity_ETargetState
{
	ETS_Unknown = 0,
	ETS_NoTarget = 1,
	ETS_RunningActBehavior = 2,
	ETS_RunningDummyBehavior = 3,
	ETS_RunningOtherBehavior = 4,
	ETS_Dead = 5,
	ETS_TargetIsHitman = 6,
};

// Size: 0x4
enum class CrowdReactionAIEventType
{
	CROWDAIEVENT_NONE = 0,
	CROWDAIEVENT_CURIOUS = 1,
	CROWDAIEVENT_ALERTED = 2,
	CROWDAIEVENT_BLAME_FOR_WEAPON = 3,
	CROWDAIEVENT_BLAME_FOR_KILL = 4,
};

// Size: 0x4
enum class ZRenderPostfilterParametersEntity_EDOFBlurType
{
	eFastest = 0,
	eLowRezLensBlur = 1,
	eLowRezLensBlurSoft = 2,
	eHighRezLensBlur = 3,
};

// Size: 0x4
enum class ZAIPerceptibleEntity_EReactionBehaviorMode
{
	FullBehavior = 0,
	StopOnInvestigate = 1,
	StopOnReacted = 2,
};

// Size: 0x4
enum class CrowdUtil_EDefaultStateTypes
{
	STATE_IDLE = 0,
	STATE_WALK = 1,
	STATE_PENDINGWALK = 2,
	STATE_DEAD = 3,
	STATE_SCARED = 4,
	STATE_PENDINGSCARED = 5,
	STATE_POSSESSED = 6,
	STATE_ALERT = 7,
	STATE_PRONE = 8,
	STATE_RELOCATE = 9,
	STATE_PENDINGRELOCATE = 10,
	NUM_DEFAULT_STATES = 11,
};

// Size: 0x4
enum class EGameEventArgType
{
	GE_ARGS_KILL = 0,
	GE_ARGS_PRIORITYKILL = 1,
	GE_ARGS_SITUATION = 2,
	GE_ARGS_INVENTORY = 3,
	GE_ARGS_EXPLODINGPROP = 4,
	GE_ARGS_EVENT = 5,
	GE_ARGS_CHECKPOINTEVENT = 6,
	GE_ARGS_AI_SITUATION = 7,
};

// Size: 0x8
class alignas(8) SCautiousVIPGroupState
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZGameTime m_tMove; // 0x0
};

// Size: 0x4
enum class ZCautiousSearchGroup_ESearchGroupState
{
	SGS_Acknowledge = 0,
	SGS_Approach = 1,
	SGS_Approaching = 2,
	SGS_Waiting = 3,
	SGS_Completed = 4,
};

// Size: 0x60
class alignas(8) SInventoryItem
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString sInstanceId; // 0x0
	ZString sUnlockableId; // 0x10
	ZRepositoryID repositoryId; // 0x20
	TArray<ZRepositoryID> aRepositoryAssetIds; // 0x30
	TArray<ZRepositoryID> aModifierIds; // 0x48
};

// Size: 0x70
class alignas(8) SContainerItemInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString m_sContainerInstanceId; // 0x0
	SInventoryItem m_concealedItem; // 0x10
};

// Size: 0x90
class alignas(8) SInventoryInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SInventoryItem> m_aPockets; // 0x0
	SInventoryItem m_CarriedItem; // 0x18
	TArray<SContainerItemInfo> m_aContainerItems; // 0x78
};

// Size: 0x40
class alignas(8) SAgencyPickupInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZRepositoryID m_AgencyPickupId; // 0x0
	TArray<ZRepositoryID> m_aItemIds; // 0x10
	TArray<ZRepositoryID> m_aModifierIds; // 0x28
};

// Size: 0x10
class alignas(4) SSoundAmbienceSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rCurrentAmbience; // 0x0
	uint32 m_rCurrentGate; // 0x4
	float32 m_fTransitionAmount; // 0x8
	bool m_bEnteredFromSide0; // 0xC
	bool m_bInTransition; // 0xD
};

// Size: 0x18
class alignas(8) SChallengesSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SChallengeSaveData> m_mChallengeStates; // 0x0
};

// Size: 0x1D8
class alignas(8) SLevelSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int64 m_nGameTime; // 0x0
	int64 m_nGameTimePrev; // 0x8
	int64 m_nGameTimeDelta; // 0x10
	ZString m_sScene; // 0x18
	ZString m_sLocationId; // 0x28
	ZString m_sContractId; // 0x38
	ZString m_sContractSessionId; // 0x48
	ZString m_sLastEventToken; // 0x58
	ZRepositoryID m_EnabledEntranceId; // 0x68
	ZRepositoryID m_StartupDisguiseId; // 0x78
	ZVariant m_contractData; // 0x88
	ZGuid m_trackedOpportunity; // 0x98
	SInventoryInfo m_aStartupInventory; // 0xA8
	SAgencyPickupInfo m_aStartupAgencyPickupSelection; // 0x138
	TArray<SObjetiveSaveData> m_aObjectives; // 0x178
	TArray<ZVariant> m_aGameChangers; // 0x190
	SSoundAmbienceSaveData m_SoundAmbienceData; // 0x1A8
	SChallengesSaveData m_ChallengesSaveData; // 0x1B8
	int32 m_nSaveGameLimit; // 0x1D0
	float32 m_fLastKillTimestamp; // 0x1D4
};

// Size: 0x4
enum class ZMoveToPositionBehaviorEntity_ERotationAlignment
{
	RA_NONE = 0,
	RA_LOOSE = 1,
	RA_EXACT = 2,
};

// Size: 0x4
enum class ZDebugHM5GameTimeMultiplierEnt_eTMLDReason
{
	eTMLDR_HintMessages = 0,
	eTMLDR_Sequence = 1,
	eTMLDR_ActionKillHeadShot = 2,
	eTMLDR_ActionKillCCProp = 3,
	eTMLDR_ActionKillExplosion = 4,
	eTMLDR_ActionKillLastEnemyInEncounter = 5,
	eTMLDR_ActionKillLastEnemyInCheckPoint = 6,
	eTMLDR_NOTSET = 7,
};

// Size: 0x4
enum class IRoomEntity_EReasoningGridImportance
{
	RGI_NoGrid = 0,
	RGI_Low = 1,
	RGI_Normal = 2,
	RGI_High = 3,
	RGI_Extreme = 4,
};

// Size: 0x4
enum class ZOnlineManager_EState
{
	eTRIGGER_FLOW = 1,
	eOFFLINE = 2,
	eSUSPEND = 3,
	eDISCONNECTED = 4,
	eBEGIN_CONNECTION_FLOW = 5,
	ePREAUTHENTICATE = 6,
	eFETCH_API_VERSION = 7,
	eFETCHING_API_VERSION = 8,
	eAPI_VERSION_RECEIVED = 9,
	eONLINE_CONSENT_CONFIRMATION = 10,
	ePREAUTHENTICATION_ENTITLEMENTS_SYNCHRONIZE_INPROGRESS = 11,
	ePREAUTHENTICATION_ENTITLEMENTS_SYNCHRONIZE_DONE = 12,
	eAUTHENTICATING = 13,
	eAUTHENTICATION_RECEIVED = 14,
	eENTITLEMENTS_SYNCHRONIZE_INPROGRESS = 15,
	eENTITLEMENTS_SYNCHRONIZE_DONE = 16,
	eAUTHENTICATING_GAMESERVICE = 17,
	eAUTHENTICATION_GAMESERVICE_RECEIVED = 18,
	eFETCHING_OFFLINE_CACHE_DB_DIFF = 19,
	eFETCHING_OFFLINE_CACHE_DB_DIFF_RECEIVED = 20,
	eFETCHING_DYNAMIC_RESOURCES = 21,
	eDYNAMIC_RESOURCES_MOUNTED = 22,
	eCHECK_FOR_DLC_UPDATES = 23,
	eFETCHING_PLATFORM_USERINFO = 24,
	ePLATFORM_USERINFO_RECEIVED = 25,
	eFETCHING_CONFIGURATION = 26,
	eCONFIGURATION_RECEIVED = 27,
	eFETCHING_PROFILE = 28,
	ePROFILE_RECEIVED = 29,
	eSYNCHRONIZING_PROFILE = 30,
	ePROFILE_SYNCHRONIZED = 31,
	eRETRIEVING_EVENTS = 32,
	eEVENTS_RETRIEVED = 33,
	eWAITING_FOR_SYNCHRONIZING_EVENTS = 34,
	eCONNECTED = 35,
	eCONNECT_TO_GAME_SESSION = 36,
	eCONNECTING_TO_GAME_SESSION = 37,
	eRETRY_SAVE_EVENTS = 38,
	eRETRY_SAVE_EVENTS_INTERNAL = 39,
	eREAUTHENTICATE = 40,
	eSTATE_MAX = 41,
};

// Size: 0x4
enum class EFSMInternalEvent
{
	eFSMEvent_Completed = 0,
	eFSMEvent_Failed = 1,
	eFSMEvent_Choice = 2,
	eFSMEvent_Max = 3,
};

// Size: 0x4
enum class ECautiousDisturbanceState
{
	eCDS_Pending = 0,
	eCDS_Expired = 1,
	eCDS_Handled = 2,
	eCDS_GetHelpGroup = 3,
	eCDS_InvestigationGroup = 4,
	eCDS_InvestigateAfterExplosion = 5,
	eCDS_Ignored = 6,
	eCDS_NoInvestigator = 7,
	eCDS_Similar = 8,
	eCDS_ManHunt = 9,
	eCDS_CombatSuppressGunshots = 10,
};

// Size: 0x4
enum class ZUIControlEntity_ELayoutMode
{
	E_LAYOUT_MODE_Absolute = 0,
	E_LAYOUT_MODE_Proportional = 1,
	E_LAYOUT_MODE_Proportional_MaintainAspect = 2,
	E_LAYOUT_MODE_Proportional_MaintainAspect_Fill = 3,
	E_LAYOUT_MODE_Proportional_Scale_Fit = 4,
	E_LAYOUT_MODE_Proportional_Scale_MaintainAspect = 5,
	E_LAYOUT_MODE_Proportional_Scale_MaintainAspect_Fill = 6,
};

// Size: 0x4
class alignas(4) SActorKeywordProxySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
};

// Size: 0x4
enum class ZValueBool_Operation_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
	NOT_ALL = 3,
	ALL_EQUAL = 4,
	ONE_TRUE = 5,
};

// Size: 0x18
class alignas(8) SHUDPromptDisplayInfoArray_Dummy
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SHUDPromptDisplayInfo> dummy; // 0x0
};

// Size: 0x14
class alignas(4) SCombatSituationMemberSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 m_fDistanceToTarget; // 0x0
	float32 m_fDistanceFieldValue; // 0x4
	EDisturbanceType m_civilianJoinReason; // 0x8
	bool m_bIsPreferredToFire; // 0xC
	bool m_bDialogPreventShooting; // 0xD
	bool m_bCanFlee; // 0xE
	bool m_bCantFleeNoPath; // 0xF
	bool m_bReportedToGuard; // 0x10
	bool m_bStandAndShoot; // 0x11
};

// Size: 0x4
enum class IContractObjective_SCounterData_ECounterType
{
	eDEFAULT = 0,
	ePERCENTAGE = 1,
};

// Size: 0x4
enum class ECCNodeType
{
	eCCNodeType_Counter = 0,
	eCCNodeType_ExecutePistol = 1,
	eCCNodeType_React = 2,
	eCCNodeType_SilentTakeDownEnd = 3,
	eCCNodeType_SilentKill = 4,
	eCCNodeType_SlitThroat1H = 5,
	eCCNodeType_Swing1H = 6,
	eCCNodeType_Bash1H = 7,
	eCCNodeType_Stab1H = 8,
	eCCNodeType_Syringe1H = 9,
	eCCNodeType_Strangle1H = 10,
	eCCNodeType_Smash1H = 11,
	eCCNodeType_Swing2H = 12,
	eCCNodeType_Stab2H = 13,
	eCCNodeType_Bash2H = 14,
	eCCNodeType_Strangle2H = 15,
	eCCNodeType_Axe = 16,
	eCCNodeType_Sword1H = 17,
	eCCNodeType_AttackChain = 18,
	eCCNodeType_AttackChainCivilian = 19,
	eCCNodeType_AttackChainHeavy = 20,
	eCCNodeType_FailChain = 21,
	eCCNodeType_FinishChainHigh = 22,
	eCCNodeType_FinishChainLow = 23,
	eCCNodeType_FinishChainKill = 24,
	eCCNodeType_StairsChain = 25,
	eCCNodeType_CounterChain = 26,
	eCCNodeType_AttackIdle = 27,
	eCCNodeType_AttackPassify = 28,
	eCCNodeType_FailChainPush = 29,
	eCCNodeType_Count = 30,
};

// Size: 0x4
enum class ZHM5CrowdGenericEventConsumer_EEvent
{
	eFootstep = 0,
	eClothRustle = 1,
	ePushReaction = 2,
	ePanic = 3,
	eGeneric00 = 4,
	eGeneric01 = 5,
	eGeneric02 = 6,
	eGeneric03 = 7,
};

// Size: 0x4
enum class EFontFlags
{
	FV_Original = 16,
	FV_NoAutoFit = 32,
	FV_Normal = 0,
	FV_Italic = 1,
	FV_Bold = 2,
	FV_BoldItalic = 3,
	FV_FauxItalic = 4,
	FV_FauxBold = 8,
	FV_FauxBoldItalic = 12,
};

// Size: 0x4
enum class EDeathBehavior
{
	eDB_IMPACT_ANIM = 0,
	eDB_NO_IMPACT_ANIM = 1,
	eDB_NO_VELOCITY = 2,
	eDB_NO_RAGDOLL = 3,
};

// Size: 0x4
enum class CrowdMapImpl_CellFlags
{
	CELLFLAG_RESTRICTED_A = 1,
	CELLFLAG_RESTRICTED_B = 2,
	CELLFLAG_RESTRICTED_C = 4,
	CELLFLAG_WALKABLE = 8,
	CELLFLAG_TELEPORT_IN = 16,
	CELLFLAG_TELEPORT_OUT = 32,
	CELLFLAG_UNUSED = 64,
	CELLFLAG_PANIC_ONLY = 128,
};

// Size: 0x4
enum class ESoundGateType
{
	SOUNDGATE_TYPE_ROUND = 0,
	SOUNDGATE_TYPE_SHARPCORNERS = 1,
};

// Size: 0x4
enum class EAIModifiers
{
	AIM_Invalid = 0,
	AIM_IgnoreLowNoise = 1,
	AIM_IgnoreHitmanPropToss = 2,
	AIM_IgnoreAnnoyingHitman = 4,
	AIM_IgnoreSneakyHitman = 8,
	AIM_IgnoreAgileHitman = 16,
	AIM_IgnoreSillyHitman = 30,
	AIM_PreferredInvestigator = 32,
	AIM_AccidentShy = 64,
	AIM_PreferredAccidentInvestigator = 128,
	AIM_BlockFiberWireInteraction = 256,
	AIM_BlockCloseCombatInteraction = 512,
	AIM_BlockDragBodyInteraction = 1024,
	AIM_BlockAllInteractions = 1792,
	AIM_IgnoreDistractions = 2048,
	AIM_IgnoreTrespassing = 4096,
	AIM_IgnoreWeapons = 8192,
	AIM_IgnoreLockdown = 16384,
	AIM_DisableHelpCivilian = 32768,
	AIM_WantsPrivacy = 65536,
	AIM_ConversationHelper = 131072,
	AIM_ConversationHelperFast = 262144,
	AIM_OneHitpoint = 524288,
	AIM_BlockDeadlyThrow = 1048576,
	AIM_SuppressSocialGreeting = 2097152,
	AIM_NeverInvestigateAccidents = 4194304,
	AIM_BlockDeath = 8388608,
	AIM_IgnoreDeadBody = 16777216,
	AIM_NeverSpectate = 33554432,
};

// Size: 0x4
enum class ZBoneAttachEntity_EResetMode
{
	eAtBoneOrigin = 0,
	eKeepOffset = 1,
};

// Size: 0x4
enum class ZUIFlowLayoutEntity_EFlowType
{
	E_FLOW_TYPE_HORIZONTAL = 0,
	E_FLOW_TYPE_VERTICAL = 1,
};

// Size: 0x4
enum class ZChannelKeywordCondition_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
	ANY_TRUE_IF_NO_REQS = 3,
};

// Size: 0x4
enum class ZTrackDollyControllerQueryEntity_ETrackPointQueryType
{
	Closest = 0,
	ClosestNext = 1,
	ClosestPrevious = 2,
};

// Size: 0x4
enum class EConversationID
{
	eCI_GuardCivilian_Distraction_Investigation = 0,
	eCI_HearBulletImpact_Distraction_Investigation = 1,
	eCI_HearItemImpact_Distraction_Investigation = 2,
	eCI_HearCarAlarm_Distraction_Investigation = 3,
	eCI_SeeItemToss_Distraction_Investigation = 4,
	eCI_HearRadio_Distraction_Investigation = 5,
	eCI_HearPain_Distraction_Investigation = 6,
	eCI_HearAccident_Distraction_Investigation = 7,
	eCI_HearCuriousItemSound_Distraction_Investigation = 8,
	eCI_HearCuriousSound_Distraction_Investigation = 9,
	eCI_SeeSuspiciousPerceptible_Distraction_Investigation = 10,
	eCI_SeeInterestingItem_Distraction_Investigation = 11,
	eCI_HearFootSteps_Distraction_Investigation = 12,
	eCI_HearAngryDialog_Distraction_Investigation = 13,
	eCI_HearHelpDialog_Distraction_Investigation = 14,
	eCI_HearWarning_Distraction_Investigation = 15,
	eCI_SightInvestigation_Distraction_Investigation = 16,
	eCI_HearBulletImpact_Distraction_StandDown = 17,
	eCI_HearItemImpact_Distraction_StandDown = 18,
	eCI_HearCarAlarm_Distraction_StandDown = 19,
	eCI_SeeItemToss_Distraction_StandDown = 20,
	eCI_HearRadio_Distraction_StandDown = 21,
	eCI_HearPain_Distraction_StandDown = 22,
	eCI_HearAccident_Distraction_StandDown = 23,
	eCI_HearCuriousItemSound_Distraction_StandDown = 24,
	eCI_HearCuriousSound_Distraction_StandDown = 25,
	eCI_SeeSuspiciousPerceptible_Distraction_StandDown = 26,
	eCI_SeeInterestingItem_Distraction_StandDown = 27,
	eCI_HearFootSteps_Distraction_StandDown = 28,
	eCI_HearAngryDialog_Distraction_StandDown = 29,
	eCI_HearHelpDialog_Distraction_StandDown = 30,
	eCI_HearWarning_Distraction_StandDown = 31,
	eCI_SightInvestigation_Distraction_StandDown = 32,
	eCI_Suitcase_Distraction_DeliverToGuard = 33,
	eCI_Suitcase_Distraction_RadioRequestHelp = 34,
	eCI_Count = 35,
};

// Size: 0x4
enum class ESubcontrollerInventorySlot
{
	eSIS_Invalid = 0,
	eSIS_LeftHand = 1,
	eSIS_RightHand = 2,
};

// Size: 0x4
enum class IHM5Door_EInitialState
{
	IS_CLOSED = 0,
	IS_OPEN = 1,
	IS_OPEN_IN = 2,
	IS_OPEN_OUT = 3,
};

// Size: 0x4
enum class ZDebugTextEntity_EHorizontalAlignment
{
	HA_LEFT = 1,
	HA_CENTER = 0,
	HA_RIGHT = 2,
};

// Size: 0x4
enum class EActionType
{
	AT_INVALID = 0,
	AT_OPENDOOR = 1,
	AT_CLOSEDOOR = 2,
	AT_PICKUP = 4,
	AT_GENERIC = 8,
	AT_REMOTE = 16,
	AT_OUTFIT = 32,
	AT_CLOTHBUNDLE = 64,
	AT_DRAGBODY = 128,
	AT_RETRIEVE_ITEM_FROM_CONTAINER = 256,
	AT_HERO_MOVEMENT = 1024,
	AT_SWAPITEM = 2048,
	AT_DUMPBODY = 4096,
	AT_COUP_DE_GRACE = 8192,
	AT_INTERACTION_GROUP = 16384,
	AT_USE_NORMAL = 32768,
	AT_STASHPOINT_PICKUP = 65536,
	AT_ENTERCLOSET = 131072,
	AT_EXITCLOSET = 262144,
	AT_ENTERSAFEZONE = 524288,
	AT_EXITSAFEZONE = 1048576,
	AT_CANCEL = 2097152,
	AT_CONTAINERFLUSHBODY = 4194304,
	AT_PLACE_ITEM_IN_CONTAINER = 16777216,
	AT_USE_DOWN = 33554432,
	AT_USE_HOLD = 67108864,
	AT_CONTEXTACTION = 134217728,
	AT_INTERRUPTIBLE_TAP = 268435456,
	AT_ITEMCONTAINER = 536870912,
	AT_USE_QUICK = 1073741824,
	AT_ITEM_INTERACTION = -2147483648,
};

// Size: 0x4
enum class ERANDOM_DISTRIBUTION
{
	RND_UNIFORM = 0,
	RND_SAWTOOTH = 1,
};

// Size: 0x4
enum class ERatingCategory
{
	ERatingCategory_Invalid = 0,
	ERatingCategory_Flawless = 1,
	ERatingCategory_Violence = 2,
	ERatingCategory_Cunning = 3,
	ERatingCategory_Noise = 4,
	ERatingCategory_COUNT = 5,
};

// Size: 0x4
enum class InputControlNamesp_eHM5InputActionType
{
	eTypeGet = 0,
	eTypeHold = 1,
	eTypeRepeat = 2,
	eTypeTap = 3,
	eTypeRelease = 4,
	eTypeDownedge = 5,
	eTypeFastTap = 6,
	eTypeHoldDown = 7,
	eTypeFireOnceHoldDown = 8,
	eTypeClickHold = 9,
	eTypePress = 10,
	eTypeANALOG = 11,
	eTypeANALOGRAW = 12,
	eTypeRELATIVE = 13,
	eTYPE_INVALID = 14,
};

// Size: 0x10
class alignas(8) SVariantStruct
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZVariant m_Data; // 0x0
};

// Size: 0x4
enum class EDebugSpatialInfoVerbosity
{
	EDSIV_Overview = 0,
	EDSIV_HierachicalView = 1,
	EDSIV_Full = 2,
};

// Size: 0x4
enum class ZHM5FaceFXSpecificEventConsumer_EEvent
{
	eNone = 0,
	eGetInCombatCoverExhalation = 1,
	eLeaveCombatCoverExhalation = 2,
	eAgilityStrainedInhaleExhale = 3,
	eAgilityGroan = 4,
	eCloseCombatAttackSnarl = 5,
	eCloseCombatStainedGroan = 6,
	eCloseCombatSilentKillShush = 7,
};

// Size: 0x4
enum class EPlayMode
{
	PLAYMODE_STOPPED = 1,
	PLAYMODE_PAUSED = 2,
	PLAYMODE_PLAYING = 3,
};

// Size: 0x4
enum class EHintMessageType
{
	EHintMessageType_Hint = 0,
	EHintMessageType_InstinctHint = 1,
	EHintMessageType_InstinctPrompt = 2,
	EHintMessageType_Tutorial = 3,
};

// Size: 0x18
class alignas(8) SBehaviorTreeEntityReference
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bList; // 0x0
	ZString m_sName; // 0x8
};

// Size: 0x30
class alignas(8) SBehaviorTreeInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SBehaviorTreeEntityReference> m_references; // 0x0
	TArray<SBehaviorTreeInputPinCondition> m_inputPinConditions; // 0x18
};

// Size: 0x4
enum class EHUDMessageStatus
{
	HUD_MESSAGE_UNUSED = 0,
	HUD_MESSAGE_ATTACH = 1,
	HUD_MESSAGE_FADEIN = 2,
	HUD_MESSAGE_DISPLAY = 3,
	HUD_MESSAGE_FADEOUT = 4,
};

// Size: 0x4
enum class ZHM5HitmanHealthModifier_EHealthValue
{
	eHealth0 = 0,
	eHealth10 = 10,
	eHealth20 = 20,
	eHealth30 = 30,
	eHealth40 = 40,
	eHealth50 = 50,
	eHealth60 = 60,
	eHealth70 = 70,
	eHealth80 = 80,
	eHealth90 = 90,
	eHealth100 = 100,
};

// Size: 0x4
enum class ZSecuritySystemCameraConfiguration_ECameraEscalationSituations
{
	eCES_Arrest = 0,
	eCES_Combat = 1,
};

// Size: 0x4
enum class EObjectiveType
{
	OBJECTIVE_PRIMARY = 0,
	OBJECTIVE_SECONDARY = 1,
	OBJECTIVE_TERTIARY = 2,
};

// Size: 0x2
class alignas(1) SShotListenerSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bEnabled; // 0x0
	bool m_bNPCShotProcessed; // 0x1
};

// Size: 0x4
enum class EWeaponUpgradeUse
{
	eWUU_PrimaryOnly = 0,
	eWUU_SecondaryOnly = 1,
	eWUU_AllFireModes = 2,
};

// Size: 0x8
class alignas(4) SKeywordSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_HolderSaveableId; // 0x0
	int32 m_KeywordID; // 0x4
};

// Size: 0x4
enum class EActorSoundDefs
{
	_NoSound = 0,
	Dth_BrkNck = 1,
	Dth_Fll = 2,
	Dth_GnSht = 3,
	Dth_HdSht = 4,
	Dth_Mpct = 5,
	Dth_SltThrt = 6,
	Dth_Strngl = 7,
	Dth_Xplo = 8,
	Dth_PrpF = 9,
	Dth_Electro = 10,
	Dth_Burn = 11,
	Dth_Crush = 12,
	Dth_Scrm = 13,
	Dth_Hrt = 14,
	Dth_SrpsGrab = 15,
	Dth_HumShldStrain = 16,
	Dth_Snore = 17,
	Dth_Groan = 18,
	Dth_Dump = 19,
	Dth_PrpTssFrntAck = 20,
	Dth_Headlock = 21,
	Dth_Blinded = 22,
	Dth_BeeSting = 23,
	Gen_Grt47 = 24,
	Gen_GrtGrd47WGun = 25,
	Gen_GrtTrgt = 26,
	Gen_GrtTrgtRsp = 27,
	Gen_NPC2NPCGrt = 28,
	Gen_NPC2NPCRsp = 29,
	Gen_GtHlp = 30,
	Gen_GtHlpLd = 31,
	Gen_GtHlp47Knwn = 32,
	Gen_Mssng = 33,
	Gen_HMHere = 34,
	Gen_HMThere = 35,
	Gen_SrpsLow = 36,
	Gen_SrpsLowShort = 37,
	Gen_Srps = 38,
	Gen_SrpsLd = 39,
	Gen_StndRsp = 40,
	Gen_Stop = 41,
	Gen_StopLd = 42,
	Gen_Reveal = 43,
	Gen_ThumbsUp = 44,
	Gen_BrknAck = 45,
	Gen_Ack = 46,
	Gen_AckLd = 47,
	Gen_AckNtnse = 48,
	Gen_BumpAck = 49,
	Gen_Curse = 50,
	Gen_CurseLow = 51,
	Gen_DrpGun = 52,
	Gen_DrpCase = 53,
	Gen_CoinCurse = 54,
	Gen_TransportGreet = 55,
	Gen_Thanks = 56,
	Gen_ReturnItem2Guard = 57,
	Gen_NoWay1 = 58,
	Gen_NoWay2Kidding = 59,
	Gen_NoWay3Joke = 60,
	Gen_NoWay44Real = 61,
	Gen_NoWay5DntBeliv = 62,
	Gen_NoWay6Serious = 63,
	Gen_NoWay7Horrible = 64,
	Gen_Way1 = 65,
	Gen_Way2Kidding = 66,
	Gen_Way3Joke = 67,
	Gen_Way44Real = 68,
	Gen_Way5DntBeliv = 69,
	Gen_Way6Serious = 70,
	Gen_Way7Horrible = 71,
	Gen_NkdRunAck = 72,
	Gen_Grasp = 73,
	Gen_Amused = 74,
	Gen_Annoyed = 75,
	Gen_BdygrdArrive = 76,
	Gen_BdygrdMovOut = 77,
	Gen_GiveUp = 78,
	Gen_Off = 79,
	Gen_On = 80,
	Gen_PanicLow = 81,
	Gen_Sick = 82,
	Gen_SmellAck = 83,
	Gen_SmrtPhnAct = 84,
	Gen_PhoneAct = 85,
	Gen_OutbreakInfect = 86,
	Gen_OutbreakSick = 87,
	Gen_OutbreakWhine = 88,
	Gtag = 89,
	ClsCmbt_Ack = 90,
	ClsCmbt_Tnt = 91,
	Cmbt_BackupCll = 92,
	Cmbt_BadDsg = 93,
	Cmbt_Beg = 94,
	Cmbt_ClsAck = 95,
	Cmbt_Fire = 96,
	Cmbt_FireLdr = 97,
	Cmbt_GtHit = 98,
	Cmbt_HitHM = 99,
	Cmbt_HMClsCmbtAck = 100,
	Cmbt_HMCvr = 101,
	Cmbt_HMFire = 102,
	Cmbt_HMFlnk = 103,
	Cmbt_HMHeadPopr = 104,
	Cmbt_HMKll = 105,
	Cmbt_HMKllCiv = 106,
	Cmbt_HMKllName = 107,
	Cmbt_HMKllPrpTss = 108,
	Cmbt_HMMssTnt = 109,
	Cmbt_HMShrpShtr = 110,
	Cmbt_HMSpttd = 111,
	Cmbt_HMVnshd = 112,
	Cmbt_Hold = 113,
	Cmbt_HoldLdr = 114,
	Cmbt_HumShldRls1 = 115,
	Cmbt_HumShldRls2 = 116,
	Cmbt_HumShldRls3 = 117,
	Cmbt_HumShldRlsFem1 = 118,
	Cmbt_HumShldRlsFem2 = 119,
	Cmbt_HumShldRlsFem3 = 120,
	Cmbt_HumShldVctm = 121,
	Cmbt_HumShldLdr = 122,
	Cmbt_LngLst = 123,
	Cmbt_LngLstRsp = 124,
	Cmbt_LstMnStn = 125,
	Cmbt_LstSght = 126,
	Cmbt_LstSghtRsp = 127,
	Cmbt_NdrAttck = 128,
	Cmbt_Relod = 129,
	Cmbt_Scrm = 130,
	Cmbt_ThrowFlash = 131,
	Cmbt_ThrowFlashMiss = 132,
	Cmbt_ThrowFlashMiss2 = 133,
	Cmbt_ThrowFlashWin = 134,
	Cmbt_ThrowFlashWin2 = 135,
	Cmbt_TkDwnLdr = 136,
	Cmbt_VntAck = 137,
	Cmbt_Whmp = 138,
	Cmbt_StalemateHold = 139,
	Cmbt_StalemateTnt = 140,
	Cmbt_TriggerTheAlarm = 141,
	Cmbt_47Mpty = 142,
	Cmbt_47SuperSize = 143,
	Evac_PrtTrgtSolo = 144,
	Evac_PrtTrgtAck = 145,
	Evac_PrtTrgtAckLdr = 146,
	Evac_PrtTrgtEscrt = 147,
	Evac_PrtTrgtStop = 148,
	Evac_PrtTrgtStnd = 149,
	Evac_PrtTrgtStndRsp = 150,
	Evac_Cornered = 151,
	Evac_MovOut = 152,
	Evac_PathChange = 153,
	Evac_PeelOff = 154,
	Evac_LastPeelOff = 155,
	Evac_ShltrArrv = 156,
	Evac_ShltrBad = 157,
	Evac_ShltrLdr = 158,
	Evac_ShltrRsp = 159,
	Evac_TrgtHitRsp = 160,
	AvoidXplo_Ack = 161,
	AvoidXplo_Stnd = 162,
	Ar_47BadAction = 163,
	Ar_47X = 164,
	Ar_BadDsg = 165,
	Ar_BlmeKll = 166,
	Ar_BlameKnckDwn = 167,
	Ar_BlameKnckDwnPT = 168,
	Ar_BlameKllPT = 169,
	Ar_47BadActionPT = 170,
	Ar_DrgBody = 171,
	Ar_FkeSrrdrTnt = 172,
	Ar_HMDoor = 173,
	Ar_Strangle = 174,
	Ar_Trspss = 175,
	Ar_WeapWrn1 = 176,
	Ar_WeapWrn2 = 177,
	Ar_Wrn1 = 178,
	Ar_Wrn2 = 179,
	Ar_Wrn3 = 180,
	Ar_VictimAck = 181,
	Ar_Thief = 182,
	Ar_Rsp = 183,
	Sniper_Ack = 184,
	InCa_BackupCll = 185,
	InCa_ChckCvr = 186,
	InCa_CivRptFail = 187,
	InCa_CivUpset = 188,
	InCa_ClstTnt = 189,
	InCa_HMTnt = 190,
	InCa_Idle = 191,
	InCa_NitiateHMKnwn = 192,
	InCa_SrchLdr = 193,
	InCa_Stnd = 194,
	InCa_StndAgtd = 195,
	InCa_StndAgtdLdr = 196,
	InCa_StndAgtdHMKnwn = 197,
	InCa_StndAgtdHMKnwnLdr = 198,
	InCa_StndHMKnwn = 199,
	InCa_StndHMKnwnLdr = 200,
	InCa_StndLdr = 201,
	InCa_StndRsp = 202,
	InCa_StndLckDwnFlsAlrm = 203,
	InCa_VntTnt = 204,
	InCa_Brk2Civ = 205,
	InCa_Brk2Grd = 206,
	InCa_Brk2Rdo = 207,
	InCa_BrkAsk = 208,
	InCa_GhostAsk = 209,
	InCa_TriggerTheAlarm = 210,
	InCa_Xpln47Thief = 211,
	InCa_DstrssInv = 212,
	InCa_DstrssLdr = 213,
	InCa_DstrssInvLdr = 214,
	InCa_WakeAsk = 215,
	InCa_47Rcall = 216,
	InCa_WakerStnd = 217,
	InCa_ClsCmbtAck = 218,
	InCa_SeeDthInv = 219,
	InCa_SeeDthInvLdr = 220,
	InCa_SeeDthLdr = 221,
	InCa_XploInv = 222,
	InCa_XploInvLdr = 223,
	InCa_XploLdr = 224,
	InCa_AlarmAck = 225,
	InCa_GnShtInv = 226,
	InCa_GnShtInvLdr = 227,
	InCa_GnShtLdr = 228,
	InCa_RecurSvrInv = 229,
	InCa_RecurSvrInvLdr = 230,
	InCa_RecurSvrInvRsp = 231,
	InCa_RecurSvrLdr = 232,
	InCa_RecurSvrRsp = 233,
	InCa_LckDwnGtOutLdr = 234,
	InCa_LckDwnGtOutRsp = 235,
	InCa_LckDwnWrn1 = 236,
	InCa_LckDwnWrn2 = 237,
	InCa_LckDwnWrn3 = 238,
	InCa_LckDwnCivCmnt = 239,
	InCa_FrskAck = 240,
	InCa_Frsk = 241,
	InCa_FrskCln = 242,
	InCa_FrskWpn = 243,
	InCa_Xpln47Wpn = 244,
	InCa_XplnAccdnt = 245,
	InCa_XplnDedBdy = 246,
	InCa_XplnDedBdyMassive = 247,
	InCa_XplnDrgBdy = 248,
	InCa_XplnDstrss = 249,
	InCa_XplnExplo = 250,
	InCa_XplnGhost = 251,
	InCa_XplnGnsht = 252,
	InCa_XplnNkdBdy = 253,
	InCa_XplnPcfdBdy = 254,
	InCa_XplnSeeDth = 255,
	InCa_XplnTrspss = 256,
	InCa_XplnX = 257,
	InCa_XplnWpn = 258,
	InCa_XplnDsg = 259,
	InCa_XplnImposter = 260,
	InCa_XplnRecurSvr = 261,
	InCa_XplnRsp = 262,
	InCa_XplnAckRdo = 263,
	InCa_XplnKnckDwn = 264,
	InCa_XplnKnckDwnVctm = 265,
	InCa_XplnKnckDwnGhost = 266,
	InCa_XplnSeeStrngl = 267,
	InCa_XplnHuntTargetWin = 268,
	InCa_XplnHuntTargetFail = 269,
	InCa_VIPDownAck = 270,
	InCa_VIPKillAck = 271,
	Accdnt_Inv = 272,
	InDedBdy_BloodPllAck = 273,
	InDedBdy_Ack = 274,
	InDedBdy_NkdAck = 275,
	InDedBdy_Inv = 276,
	InDedBdy_BllPllRpt = 277,
	InDedBdy_Massive = 278,
	InDedBdy_PcfdInv = 279,
	InDedBdy_CntnAck = 280,
	InDedBdy_Stnd = 281,
	InDedBdy_CircleBdy = 282,
	InDedBdy_CivCmnt = 283,
	InDedBdy_PrmtrBrchWrn1 = 284,
	InDedBdy_PrmtrBrchWrn2 = 285,
	InDedBdy_47AsGrdAck = 286,
	InDedBdy_BodyGone = 287,
	InDedBdy_VctmRcvr = 288,
	InDedBdy_WakerWake = 289,
	InDedBdy_WakeRsp = 290,
	InDedBdy_WakeNkdLdr = 291,
	InDedBdy_WakeNkdRsp = 292,
	Rcvr_Xpln47 = 293,
	Rcvr_XplnDsg = 294,
	Rcvr_XplnKnckDwn = 295,
	InDsg_FllwWrn1 = 296,
	InDsg_FllwWrn2 = 297,
	InDsg_FllwWrn3 = 298,
	InDsg_Pzzl = 299,
	InDsg_Stnd = 300,
	InDsg_StndDistance = 301,
	InDsg_StndHidden = 302,
	InDsg_HdNPlnSght = 303,
	InDsg_FllwWrn1Ack = 304,
	InDsg_FllwWrn1BadAction = 305,
	InDsg_FllwWrn1Wpn = 306,
	InDsg_FllwWrn1BadSound = 307,
	InDsg_FllwWrnJoinr = 308,
	InDsg_FllwWrn1ShadyItem = 309,
	Trspss_Stnd = 310,
	Trspss_Wrn1 = 311,
	Trspss_Wrn2 = 312,
	Trspss_Wrn3 = 313,
	Trspss_Rsp = 314,
	Trspss_SrchAckLegal47 = 315,
	Trspss_EscortAck = 316,
	Trspss_EscortRequest = 317,
	Trspss_EscortRequestRepeat = 318,
	Trspss_EscortStayClose = 319,
	Trspss_EscortOk = 320,
	Trspss_EscortStnd = 321,
	Trspss_EscortArrest = 322,
	Trspss_EscortExit = 323,
	Trspss_EscortStayRequest = 324,
	InCu_Brk2Rdo = 325,
	InCu_CivCmnd = 326,
	InCu_Stnd = 327,
	InCu_CivRsp = 328,
	InCu_BackupRqst = 329,
	InCu_CrAlrmAck = 330,
	InCu_CrAlrmLdr = 331,
	InCu_CrAlrmStndRsp = 332,
	InCu_FtStpsAck = 333,
	InCu_FtStpsStnd = 334,
	InCu_PrpTssHearAck = 335,
	InCu_PrpTssHearInv = 336,
	InCu_PrpTssHearLdr = 337,
	InCu_PrpTssHearStndRsp = 338,
	InCu_PrpTssSeeAck = 339,
	InCu_PrpTssSeeInv = 340,
	InCu_PrpTssSeeLdr = 341,
	InCu_PrpTssSeeStndRsp = 342,
	InCu_RdoAck = 343,
	InCu_RdoInv = 344,
	InCu_RdoLdr = 345,
	InCu_RdoStndRsp = 346,
	InCu_WpnInv = 347,
	InCu_RecurAck = 348,
	InCu_RecurInv = 349,
	InCu_RecurLdr = 350,
	InCu_RecurRsp = 351,
	InCu_ItemAckLdr = 352,
	InCu_CrAlrmStndStndRsp = 353,
	InCu_EscrtTrgtRedLight = 354,
	InCu_EscrtTrgtGreenLight = 355,
	InSt_HMAglty = 356,
	InSt_HMBz = 357,
	InSt_HMBzStnd = 358,
	InSt_HMEntXit = 359,
	InSt_HMInCvr = 360,
	InSt_HMSnkng = 361,
	InSt_PrpTssSee = 362,
	InSt_Stnd = 363,
	InSt_Wrn = 364,
	InSt_HM2Cls = 365,
	InSt_SickAck = 366,
	InSt_AdiosRequest = 367,
	InSt_PQ = 368,
	FseBx_Fixed = 369,
	FseBx_Fixing = 370,
	FseBx_GoFix = 371,
	FseBx_SabAck = 372,
	Sentry_DenyEntry = 373,
	Sentry_Frsk = 374,
	Sentry_FrskRequest = 375,
	Sentry_ItemRequest = 376,
	Sentry_Accepted = 377,
	Sentry_FrskWpnAck = 378,
	Sentry_47LoiterAck = 379,
	Sentry_DenyDsg = 380,
	Sentry_PostCommentLdr = 381,
	Sentry_PostCommentRsp = 382,
	VIP_MssgnA_Ldr = 383,
	VIP_MssgnB_Rsp = 384,
	VIP_MssgnC_Ldr = 385,
	VIP_MssgnD_Rsp = 386,
	VIP_MssngCallOut = 387,
	Dth_Sick = 388,
	Dth_Poison = 389,
	Gen_Avoid = 390,
	Gen_CloseCall = 391,
	Gen_PhnPckUP = 392,
	Gen_PhoneActLockdown = 393,
	Cmbt_FlushOutLdr = 394,
	Cmbt_HMPrptssKnckOut = 395,
	InCa_FrskHeadsUpLdr = 396,
	InCa_FrskHeadsUpRdo = 397,
	InCa_XplnLOS = 398,
	InCa_XplnGotShot = 399,
	InDedBdy_CivCmntPhone = 400,
	InDedBdy_NoFaulVctmXpln = 401,
	InDsg_FllwWrn1Nkd = 402,
	Ar_BlameKnckDwnMelee = 403,
	Exp_Carry = 404,
	Exp_ClearThroat = 405,
	Exp_Cough = 406,
	Exp_Drink = 407,
	Exp_Exhale = 408,
	Exp_Idle = 409,
	Exp_Inhale = 410,
	Exp_InhaleFast = 411,
	Exp_Sniff = 412,
	Exp_Swallow = 413,
	Exp_Think = 414,
	Exp_Scared = 415,
	Exp_Gld = 416,
	Exp_Dsppntd = 417,
	Exp_InPain = 418,
	InCa_AckBdy = 419,
	InCa_AckBdyLdr = 420,
	InDedBdy_CivCmntPcfd = 421,
	InDedBdy_CivCmntPhonePcfd = 422,
	Gen_SocialAck = 423,
};

// Size: 0x4
enum class ZAT2Controller_EFoot
{
	FOOT_LEFT = 0,
	FOOT_RIGHT = 1,
};

// Size: 0x8
class alignas(4) ZAT2Controller_SGeneratedFootstepEvent
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZAT2Controller_EFoot m_eFoot; // 0x0
	float32 m_fFrame; // 0x4
};

// Size: 0x4
enum class Network_OrderingChannel
{
	SYSTEM_INTERNAL = 0,
	PLAYER_INPUT = 1,
	SYNCH_POINT = 2,
	CAMERA = 3,
	PROJECTILE = 4,
	PIN_SIGNAL = 5,
	GAME_STATE = 6,
	HERO_STATE = 7,
	NPC_STATE = 8,
	WEAPONS = 9,
	INTERACTIONS = 10,
	ACTS = 11,
	ANIMATION = 12,
	MISC = 13,
	MAX_CHANNELS = 16,
};

// Size: 0xC
class alignas(4) SProgressTimerEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int32 m_nInterval; // 0x0
	int32 m_nRemaining; // 0x4
	bool m_bValue; // 0x8
};

// Size: 0x4
enum class ZRenderPostfilterParametersEntity_EHDRAdaptationType
{
	eMedian = 0,
	eGeometricMean = 1,
};

// Size: 0x4
enum class ECheatGroup
{
	eCGNone = 0,
	eCGPistols = 1,
	eCGSMGs = 2,
	eCGAssaultRifles = 3,
	eCGShotguns = 4,
	eCGSniper = 5,
	eCGExotics = 6,
	eCGDevices = 7,
};

// Size: 0x28
class alignas(8) ZTrespassingSituation_SState
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZTrespassingSituation_ESituationState m_eSituationState; // 0x0
	ZGameTime m_tDeepTrespassingTime; // 0x8
	ZGameTime m_tStartStandDown; // 0x10
	ZGameTime m_tLastTargetVisible; // 0x18
	bool m_bStopWarningGiven; // 0x20
};

// Size: 0x4
enum class EReplicaOperation
{
	E_Created = 0,
	E_Destroyed = 1,
};

// Size: 0x24
class alignas(4) SMatrix33
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SVector3 XAxis; // 0x0
	SVector3 YAxis; // 0xC
	SVector3 ZAxis; // 0x18
};

// Size: 0x4
enum class ECCEmitterEffect
{
	eCCEmitterEffect_None = 0,
	eCCEmitterEffect_Stab = 1,
	eCCEmitterEffect_Blunt1H = 2,
	eCCEmitterEffect_Blunt2H = 3,
	eCCEmitterEffect_Slash1H = 4,
	eCCEmitterEffect_Shatter = 5,
	eCCEmitterEffect_AxeCleave = 6,
	eCCEmitterEffect_AxePull = 7,
	eCCEmitterEffect_AxeSlitThroat = 8,
	eCCEmitterEffect_SlitThroat = 9,
	eCCEmitterEffect_FacePunch = 10,
	eCCEmitterEffect_Blood = 11,
};

// Size: 0x4
enum class ECommunicationBarState
{
	COMMUNICATION_BAR_NONE = 0,
	COMMUNICATION_BAR_CLEAR = 1,
	COMMUNICATION_BAR_SEARCHING = 2,
	COMMUNICATION_BAR_SUSPICIOUS = 3,
	COMMUNICATION_BAR_HUNTING = 4,
	COMMUNICATION_BAR_HOSTILE = 5,
	COMMUNICATION_BAR_BLOOD_FOUND = 6,
	COMMUNICATION_BAR_BODY_FOUND = 7,
	COMMUNICATION_BAR_GUARDS_ALERTED = 8,
	COMMUNICATION_BAR_BACKUP_ARRIVED = 9,
};

// Size: 0x4
enum class EButtonDisplay
{
	BUTTON_DISPLAY_AT_OPENDOOR = 0,
	BUTTON_DISPLAY_AT_PICKUP = 1,
	BUTTON_DISPLAY_AT_STARTDIALOG = 2,
	BUTTON_DISPLAY_AT_RESET = 3,
	BUTTON_DISPLAY_AT_OUTFIT = 4,
	BUTTON_DISPLAY_AT_CLOTHBUNDLE = 5,
	BUTTON_DISPLAY_AT_DRAGBODY = 6,
	BUTTON_DISPLAY_AT_SWITCHBOX = 7,
	BUTTON_DISPLAY_AT_SWAPITEM = 8,
	BUTTON_DISPLAY_AT_DUMPBODY = 9,
	BUTTON_DISPLAY_AT_OPENLID = 10,
	BUTTON_DISPLAY_AT_CHECKPOINTDOOR = 11,
	BUTTON_DISPLAY_AT_SIMPLE = 12,
	BUTTON_DISPLAY_AT_ENTERCLOSET = 13,
	BUTTON_DISPLAY_AT_EXITCLOSET = 14,
	BUTTON_DISPLAY_AT_ENTERSAFEZONE = 15,
	BUTTON_DISPLAY_AT_EXITSAFEZONE = 16,
	BUTTON_DISPLAY_AT_DISABLEFUSEBOX = 17,
	BUTTON_DISPLAY_AT_CONTAINERFLUSHBODY = 18,
	BUTTON_DISPLAY_AT_CONTEXTACTION = 19,
	BUTTON_DISPLAY_AT_HEALTHSTATION = 20,
	BUTTON_DISPLAY_AT_KEYCARDREADER = 21,
	BUTTON_DISPLAY_AT_ITEMCONTAINER = 22,
	BUTTON_DISPLAY_AT_USE_QUICK = 23,
	BUTTON_DISPLAY_AT_USE = 24,
	BUTTON_DISPLAY_RELOAD = 25,
	BUTTON_DISPLAY_HOLSTER = 26,
	BUTTON_DISPLAY_CHANGE_WEAPON_MODE = 27,
	BUTTON_DISPLAY_REMOTE_DETONATE = 28,
	BUTTON_DISPLAY_INVENTORY_ACCEPT = 29,
	BUTTON_DISPLAY_INVENTORY_CANCEL = 30,
	BUTTON_DISPLAY_HINTMESSAGE_CONTINUE = 31,
	BUTTON_DISPLAY_CLOSECOMBAT_TAKEDOWN = 32,
	BUTTON_DISPLAY_CLOSECOMBAT_COUNTERATTACK = 33,
	BUTTON_DISPLAY_CLOSECOMBAT_SILENT = 34,
	BUTTON_DISPLAY_CLOSECOMBAT_SNAPNECK = 35,
	BUTTON_DISPLAY_CLOSECOMBAT_CHOKE = 36,
	BUTTON_DISPLAY_CLOSECOMBAT_CHOKE_TARGET = 37,
	BUTTON_DISPLAY_CLOSECOMBAT_CHAIN_HIT = 38,
	BUTTON_DISPLAY_PISTOL_FINISHER = 39,
	BUTTON_DISPLAY_PEEK_VENT = 40,
	BUTTON_DISPLAY_PEEK_CLOSET = 41,
	BUTTON_DISPLAY_CLIMB_LADDER = 42,
	BUTTON_DISPLAY_SLIDE_LADDER = 43,
	BUTTON_DISPLAY_LEDGE = 44,
	BUTTON_DISPLAY_LEDGE_STEPON = 45,
	BUTTON_DISPLAY_LEDGEJUMP = 46,
	BUTTON_DISPLAY_LEDGE_PULL_UP = 47,
	BUTTON_DISPLAY_LEDGE_CLIMB_DOWN = 48,
	BUTTON_DISPLAY_LEDGE_DROP_DOWN = 49,
	BUTTON_DISPLAY_WINDOW = 50,
	BUTTON_DISPLAY_WINDOWSNEAK = 51,
	BUTTON_DISPLAY_PULLVICTIM = 52,
	BUTTON_DISPLAY_PUSHVICTIM = 53,
	BUTTON_DISPLAY_SURRENDER = 54,
	BUTTON_DISPLAY_COVERTOCOVER = 55,
	BUTTON_DISPLAY_COVERCORNER = 56,
	BUTTON_DISPLAY_COVEREXITFORWARD = 57,
	BUTTON_DISPLAY_COVERSCALEEXIT = 58,
	BUTTON_DISPLAY_TAKEDISGUISE = 59,
	BUTTON_DISPLAY_DROPBODY = 60,
	BUTTON_DISPLAY_ABORT_CHECKPOINTDOOR = 61,
	BUTTON_DISPLAY_QUICKSWAP = 62,
	BUTTON_DISPLAY_OPERATE_LEVER = 63,
	BUTTON_DISPLAY_CLOSECOMBAT_CHAIN_HIGH = 64,
	BUTTON_DISPLAY_CLOSECOMBAT_CHAIN_LOW = 65,
	BUTTON_DISPLAY_CLOSECOMBAT_CHAIN_COUNTER = 66,
	BUTTON_DISPLAY_FIBERWIRE_KILL = 67,
	BUTTON_DISPLAY_DROP_ITEM = 68,
	BUTTON_DISPLAY_ABORT_MINIGAME = 69,
	BUTTON_DISPLAY_CONTRACT_MARK = 70,
	BUTTON_DISPLAY_CONTRACT_UNMARK = 71,
	BUTTON_DISPLAY_COMPLY = 72,
	BUTTON_DISPLAY_MAX = 73,
};

// Size: 0x38
class alignas(8) SCrowdBodySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_pCorpseBodybagEntity; // 0x0
	uint32 m_rCrowdEntity; // 0x4
	uint16 m_iActorIndex; // 0x8
	uint32 m_rPerceptibleEntity; // 0xC
	TArray<uint32> m_aKnownBy; // 0x10
	ZGameTime m_tStart; // 0x28
	bool m_bManaged; // 0x30
	int32 m_rBagSharedKnowledge; // 0x34
};

// Size: 0x4
enum class ZEscortSituation2Entity_EEscortState
{
	EES_Idle = 0,
	EES_Evaluate = 1,
	EES_Escorting = 2,
	EES_Searching = 3,
	EES_Intermediate = 4,
};

// Size: 0x1C
class alignas(4) SEscortSituation2ActorStateSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_nID; // 0x0
	bool m_bAllocatedForSituation; // 0x4
	ZEscortSituation2Entity_EEscortState m_eState; // 0x8
	ZEscortSituation2Entity_EEscortState m_eStatePrevious; // 0xC
	float32 m_fDistanceToTarget; // 0x10
	uint32 m_rCurrentScreenplay; // 0x14
	uint32 m_rPreferredIntermediateScreenplay; // 0x18
};

// Size: 0x4
enum class EAimAssistActivationState
{
	eAAAS_Activated = 0,
	eAAAS_Activating = 1,
	eAAAS_Deactivated = 2,
	eAAAS_Deactivating = 3,
};

// Size: 0x4
enum class ZValueBool_OperationRecalc_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
	NOT_ALL = 3,
	ALL_EQUAL = 4,
	ONE_TRUE = 5,
};

// Size: 0x4
enum class EHM5SoundBulletType
{
	ESBT_SMALL = 0,
	ESBT_MEDIUM = 1,
	ESBT_LARGE = 2,
	ESBT_GORGEOUS = 3,
	ESBT_ANY = 4,
};

// Size: 0x4
enum class EContinuity
{
	C0 = 0,
	C1 = 1,
	C2 = 2,
};

// Size: 0x4
enum class ECharacterFullBodyStateType
{
	eSM_FB_OldMovementPlaceholder = 0,
	eSM_FB_Slave = 1,
	eSM_FB_Locomotion = 2,
	eSM_FB_CloseCombat = 3,
	eSM_FB_FlavorIdle = 4,
	eSM_FB_Sniping = 5,
	eSM_FB_AssemblePutOnTheFloor = 6,
	eSM_FB_AssembleAlignContainer = 7,
	eSM_FB_AssembleRetrieve = 8,
	eSM_FB_AssembleStore = 11,
};

// Size: 0x4
enum class ZHM5WeaponBasicConfigEntity_EWeaponBasicConfigAudioHeadTailType
{
	eWBC_AudioHeadTailType_DryFire = 0,
	eWBC_AudioHeadTailType_Normal = 1,
	eWBC_AudioHeadTailType_NormalSweetener = 2,
	eWBC_AudioHeadTailType_Silenced = 3,
	eWBC_AudioHeadTailType_SilencedSweetener = 4,
};

// Size: 0x4
enum class EControllerButton
{
	BUTTON_NONE = 0,
	BUTTON_CROSS = 1,
	BUTTON_TRIANGLE = 2,
	BUTTON_SQUARE = 3,
	BUTTON_CIRCLE = 4,
	BUTTON_UP = 5,
	BUTTON_RIGHT = 6,
	BUTTON_DOWN = 7,
	BUTTON_LEFT = 8,
	BUTTON_R1 = 9,
	BUTTON_R2 = 10,
	BUTTON_R3 = 11,
	BUTTON_R_STICK = 12,
	BUTTON_L1 = 13,
	BUTTON_L2 = 14,
	BUTTON_L3 = 15,
	BUTTON_L_STICK = 16,
	BUTTON_START = 17,
	BUTTON_SELECT = 18,
	BUTTON_UP_DOWN = 19,
	BUTTON_LEFT_RIGHT = 20,
	BUTTON_LEFT_RIGHT_UP_DOWN = 21,
	BUTTON_L1_R1 = 22,
	BUTTON_L2_R2 = 23,
	BUTTON_KEYBOARD = 24,
	BUTTON_ESCAPE = 25,
};

// Size: 0x4
enum class ZHM5HitmanHealthModifier_EHealthDrainType
{
	eRemoveHealthInstantly = 0,
	eDecreaseHealthToValue = 1,
};

// Size: 0x4
enum class ZCautiousBackupGroup_EGroupState
{
	GS_DistanceField = 0,
	GS_SendBackup = 1,
	GS_Waiting = 2,
	GS_Completed = 3,
};

// Size: 0x4
enum class ERayType
{
	ERAY_CLOSESTHIT_SIMPLE = 0,
	ERAY_CLOSESTHIT_DETAILED = 1,
};

// Size: 0x30
class alignas(8) SValueIntSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint32> m_aEntities; // 0x0
	TArray<int32> m_aData; // 0x18
};

// Size: 0x4
enum class ZHM5BodyContainer_EBCBodyMode
{
	BC_1_VICTIM = 0,
	BC_2_VICTIMS = 1,
	BC_1_VICTIM_FLUSHABLE = 2,
	BC_1_VICTIM_AUTOFLUSHABLE = 3,
};

// Size: 0x4
class alignas(4) SMovementLadderSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rLadder; // 0x0
};

// Size: 0x4
enum class ESoundMaterialType
{
	eGeneric = 0,
	eFlesh = 1,
	eSilent = 2,
};

// Size: 0x4
enum class EScreenAnchor
{
	SCREEN_ANCHOR_TOP_LEFT = 0,
	SCREEN_ANCHOR_TOP_CENTER = 1,
	SCREEN_ANCHOR_TOP_RIGHT = 2,
	SCREEN_ANCHOR_MIDDLE_LEFT = 3,
	SCREEN_ANCHOR_MIDDLE_CENTER = 4,
	SCREEN_ANCHOR_MIDDLE_RIGHT = 5,
	SCREEN_ANCHOR_BOTTOM_LEFT = 6,
	SCREEN_ANCHOR_BOTTOM_CENTER = 7,
	SCREEN_ANCHOR_BOTTOM_RIGHT = 8,
};

// Size: 0x28
class alignas(4) SAIModifierServiceActorSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActorRef; // 0x0
	bool m_bNeedsVolumeUpdate; // 0x4
	bool m_bNeedsKnowledgeUpdate; // 0x5
	uint32 m_uiModVolume; // 0x8
	uint32 m_uiModBehavior; // 0xC
	uint32 m_uiModRole; // 0x10
	uint32 m_uiModItem; // 0x14
	uint32 m_uiModSituation; // 0x18
	uint32 m_uiModOutfit; // 0x1C
	uint32 m_uiModOverride; // 0x20
	uint32 m_uiModStatus; // 0x24
};

// Size: 0x20
class alignas(8) SAIModifierServiceSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bFullVolumeUpdate; // 0x0
	TArray<SAIModifierServiceActorSaveData> m_aActors; // 0x8
};

// Size: 0x8
class alignas(0) ISoundGateController
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class eHitmanPermissionReason
{
	eHPReason_MovementContext = 1,
	eHPReason_ItemHandlingInProcess = 2,
	eHPReason_SniperMode = 4,
	eHPReason_CrippleBox = 8,
	eHPReason_LevelDesign = 16,
	eHPReason_PlayerInput = 32,
	eHPReason_InstinctBlendIn = 64,
	eHPReason_FocusInteraction = 128,
	eHPReason_NUM = 7,
	eHPReason_ALLReasons = -1,
};

// Size: 0x2
class alignas(2) ZDialogEventItemTypedIndex
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class EActorAnimationOrder
{
	AAO_None = 0,
	AAO_Stand = 1,
	AAO_Move = 2,
	AAO_React = 3,
	AAO_Act = 4,
	AAO_MoveToAct = 5,
	AAO_MoveToCover = 6,
	AAO_ShootFromCover = 7,
	AAO_PeekFromCover = 8,
	AAO_Death = 9,
	AAO_Impact = 10,
	AAO_Controlled = 11,
};

// Size: 0x4
enum class ESpeed
{
	eSpeed_Idle = 0,
	eSpeed_Slow = 1,
	eSpeed_Normal = 2,
	eSpeed_Fast = 3,
	eSpeed_Sprint = 4,
};

// Size: 0x1
enum class ESeamFixMode
{
	SEAMFIX_NONE = 0,
	SEAMFIX_X = 1,
	SEAMFIX_Y = 2,
	SEAMFIX_Z = 4,
	SEAMFIX_XZ = 5,
	SEAMFIX_XY = 3,
	SEAMFIX_XYZ = 7,
	SEAMFIX_YZ = 6,
};

// Size: 0x4
enum class ESyncEvent
{
	eSyncEvent_None = 0,
	eSyncEvent_LeftFoot = 100,
	eSyncEvent_RightFoot = 200,
	eSyncEvent_BothFeet = 300,
};

// Size: 0x4
enum class CrowdUtil_ECrowdDirection
{
	NORTH = 0,
	EAST = 1,
	SOUTH = 2,
	WEST = 3,
};

// Size: 0x4
enum class ZPreferenceItemEntity_EBoolOptions
{
	EBO_INVERTVERTICAL = 0,
	EBO_FIXEDMAP = 1,
};

// Size: 0x10
class alignas(4) SIntelSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rCurrentStage; // 0x0
	float32 m_fHandlerAudioPlayPosition; // 0x4
	bool m_bTracked; // 0x8
	bool m_bUnlocked; // 0x9
	bool m_bRegistered; // 0xA
	bool m_bIsLastTriggered; // 0xB
	bool m_bIsHandlerAudioPlaying; // 0xC
};

// Size: 0x4
enum class ZHM5WeaponBasicConfigEntity_EWeaponBasicConfigAudioFamily
{
	eWBC_AudioFamily_Exotics = 0,
	eWBC_AudioFamily_Heavy = 1,
	eWBC_AudioFamily_Light = 2,
	eWBC_AudioFamily_NPC = 3,
	eWBC_AudioFamily_Standard = 4,
};

// Size: 0x4
enum class ZHeroInventoryAction_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
};

// Size: 0x4
enum class ZStandOffSituation_EDialogState
{
	eDS_ReportTarget = 0,
	eDS_ArrestReason = 1,
	eDS_ArrestReasonWait = 2,
	eDS_Warning = 3,
	eDS_WarningWait = 4,
	eDS_WeaponWarning = 5,
	eDS_WeaponWarningWait = 6,
	eDS_StopWait = 7,
	eDS_Done = 8,
};

// Size: 0x4
enum class IContractObjective_Category
{
	PRIMARY = 0,
	SECONDARY = 1,
	CONDITION = 2,
};

// Size: 0x4
enum class ZHM5LedgeMount_ELedgeEndState
{
	eHang = 0,
	eStand = 1,
};

// Size: 0x4
enum class ZHUDTimerInstance_ETimeFormatChoice
{
	YES = 0,
	NO = 1,
	AUTO = 2,
};

// Size: 0x4
enum class ECollidablesType
{
	ECST_STATIC_AND_DYNAMIC = 0,
	ECST_STATIC_ONLY = 1,
	ECST_DYNAMIC_ONLY = 2,
};

// Size: 0x4
enum class EParticleModifierImpulseDirections
{
	TARGET_ZAXIS_DIRECTION = 0,
	TOWARDS_TARGET_PIVOT = 1,
	AWAY_FROM_TARGET_PIVOT = 2,
};

// Size: 0x4
enum class EItemPoisonType
{
	POISONTYPE_NONE = 0,
	POISONTYPE_LETHAL = 1,
	POISONTYPE_SEDATIVE = 2,
	POISONTYPE_EMETIC = 3,
};

// Size: 0x4
enum class EScreenplayTriggerEvent
{
	STT_ReportCrime = 0,
	STT_ReportCrimeToHitman = 1,
	STT_ReportCrimeMoveBack = 2,
};

// Size: 0x4
enum class ETakeDownAnim
{
	eCoverLowOverNarrowCloseFront = 0,
	eCoverLowOverNarrowCloseBack = 1,
	eCoverLowOverNarrowFarFront = 2,
	eCoverLowOverNarrowFarBack = 3,
	eCoverLowOverWideFront = 4,
	eCoverLowOverWideBack = 5,
	eCoverLowCornerFront = 6,
	eCoverLowCornerBack = 7,
	eCoverHighCornerFront = 8,
	eCoverHighCornerBack = 9,
	eLocomotionBack = 10,
	eLocomotionFallback = 11,
	eLocomotionChair = 12,
	eChokeGroundLoop = 13,
	eChokeGroundEndPacify = 14,
	eChokeGroundEndKill = 15,
	eChokeGroundFallBackLoop = 16,
	eChokeGroundFallBackEndPacify = 17,
	eChokeGroundFallBackEndKill = 18,
	eChokeChairLoop = 19,
	eChokeChairEndPacify = 20,
	eChokeChairEndKill = 21,
	eChokeChairEndLeft90 = 22,
	eChokeChairEndLeft45 = 23,
	eChokeChairEndFront = 24,
	eChokeChairEndRight45 = 25,
	eChokeChairEndRight90 = 26,
	eTakeDownAnimLast = 27,
};

// Size: 0x38
class alignas(8) SDramaActorSaveState
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
	uint32 m_rSequence; // 0x4
	uint32 m_rBehavior; // 0x8
	uint32 m_rCurrentSpeakEntity; // 0xC
	uint32 m_rScreenplay; // 0x10
	ZString m_sMatchName; // 0x18
	ZGameTime m_tActorSpeakEnd; // 0x28
	bool m_bIsDone; // 0x30
	bool m_bIsPaused; // 0x31
	bool m_bIsSpeaking; // 0x32
};

// Size: 0x8
class alignas(4) STrackerEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rTracker; // 0x0
	bool m_bIsVisible; // 0x4
	bool m_bIsEnabled; // 0x5
	bool m_bSpatialVisibility; // 0x6
};

// Size: 0x18
class alignas(8) STrackerManagerSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<STrackerEntitySaveData> m_aTrackerData; // 0x0
};

// Size: 0x4
enum class ZLogicMultipleGate_EGateType
{
	eFireEveryTime = 0,
	eFirePortOnce = 1,
	eFireOnce = 2,
};

// Size: 0x4
enum class ZActBehaviorEntity_EMovementType
{
	MT_WALK = 0,
	MT_SNAP = 1,
	MT_IGNORE_POSITION = 2,
};

// Size: 0x4
enum class ZHM5BodySoundEventConsumer_EAnimSoundBody
{
	eHM5AnimSoundBody_Buttocks = 0,
	eHM5AnimSoundBody_Back = 1,
	eHM5AnimSoundBody_Head = 2,
	eHM5AnimSoundBody_Knee_L = 3,
	eHM5AnimSoundBody_Knee_R = 4,
	eHM5AnimSoundBody_Elbow_L = 5,
	eHM5AnimSoundBody_Elbow_R = 6,
	eHM5AnimSoundBody_Hand_L = 7,
	eHM5AnimSoundBody_Hand_R = 8,
	eHM5AnimSoundBody_Foot_L = 9,
	eHM5AnimSoundBody_Foot_R = 10,
	eHM5AnimSoundBody_Shoulder_L = 11,
	eHM5AnimSoundBody_Shoulder_R = 12,
	eHM5AnimSoundBody_RollFwd = 13,
	eHM5AnimSoundBody_RollSide = 14,
};

// Size: 0x4
class alignas(4) ZHM5BodySoundEventConsumer_SBodySoundEventData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZHM5BodySoundEventConsumer_EAnimSoundBody m_nEvent; // 0x0
};

// Size: 0x4
enum class ZPatrolBehaviorEntity_EMovementType
{
	MT_WALK = 0,
	MT_SNAP = 1,
	MT_IGNORE_POSITION = 2,
};

// Size: 0x4
enum class EUIActionGroupIcon
{
	EUIAGI_NoIcon = 0,
	EUIAGI_GenericTool = 1,
	EUIAGI_Crowbar = 2,
	EUIAGI_Wrench = 3,
	EUIAGI_Screwdriver = 4,
	EUIAGI_ExplosiveDevice = 5,
	EUIAGI_Poison = 6,
	EUIAGI_Coin = 7,
	EUIAGI_Lockpick = 8,
	EUIAGI_LockpickElectic = 9,
	EUIAGI_Card = 10,
	EUIAGI_Key = 11,
	EUIAGI_Password = 12,
	EUIAGI_SAPIENZA_GolfBall = 13,
	EUIAGI_SAPIENZA_ChemicalTube = 14,
	EUIAGI_SAPIENZA_FlowBouquet = 15,
	EUIAGI_SAPIENZA_Ammunitions = 16,
	EUIAGI_RatFood = 17,
	EUIAGI_Gunpowder = 18,
	EUIAGI_Cannonball = 19,
	EUIAGI_FuguFish = 20,
	EUIAGI_CakeTopper = 21,
	EUIAGI_Knife = 22,
	EUIAGI_SpaghettiCan = 23,
	EUIAGI_MAX = 24,
};

// Size: 0x4
enum class ESilenceRating
{
	eSR_NotSilenced = 0,
	eSR_Silenced = 1,
	eSR_SuperSilenced = 2,
	eSR_CompletelySilenced = 3,
};

// Size: 0x1
enum class EFilterMaskBit
{
	eFilterMaskBit_ObjectCollision = 0,
	eFilterMaskBit_OpaqueCollision = 1,
	eFilterMaskBit_UNUSED_LAST = 2,
};

// Size: 0x3
class alignas(1) SRemoteControlReceiverSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bEnabled; // 0x0
	bool m_bReceiverActivated; // 0x1
	bool m_bDestroyed; // 0x2
};

// Size: 0x4
enum class ZHM5BodyContainer_EBCState
{
	BC_CLOSED = 0,
	BC_OPEN = 1,
	BC_FLUSH = 2,
	BC_OPENING = 3,
	BC_CLOSING = 4,
	BC_FLUSHING = 5,
};

// Size: 0x10
class alignas(4) SBodyContainerSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZHM5BodyContainer_EBCState m_eBCState; // 0x0
	float32 m_fLidAutoCloseTime; // 0x4
	float32 m_fLidOpenFraction; // 0x8
	bool m_bFrameUpdateActive; // 0xC
};

// Size: 0x1
enum class ECollisionPriority
{
	ECOLLISIONPRIORITY_LOW = 0,
	ECOLLISIONPRIORITY_NORMAL = 1,
	ECOLLISIONPRIORITY_HIGH = 2,
	ECOLLISIONPRIORITY_CRITICAL = 3,
};

// Size: 0x4
enum class EHM5SoundFootstepEvent
{
	EFSE_START = 0,
	EFSE_STOP = 1,
	EFSE_LEFT = 2,
	EFSE_RIGHT = 3,
	EFSE_TURN = 4,
	EFSE_SLIDE = 5,
	EFSE_JUMP = 6,
	EFSE_LAND = 7,
};

// Size: 0x4
class alignas(4) ZHM5FootstepEventConsumer_SFootstepSoundEventData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	EHM5SoundFootstepEvent m_nEvent; // 0x0
};

// Size: 0x4
enum class ZActStateCondition_EState
{
	MOVING = 0,
	ENTERING = 1,
	PLAYING = 2,
};

// Size: 0x4
enum class ELedgeDismountBehavior
{
	eLDB_DontCare = 0,
	eLDB_Stand = 1,
	eLDB_Crouch = 2,
};

// Size: 0x4
enum class ZValueInt_Evaluation_EEvaluationType
{
	EQUAL = 0,
	NOT_EQUAL = 1,
	LESS = 2,
	LESS_OR_EQUAL = 3,
	HIGHER = 4,
	HIGHER_OR_EQUAL = 5,
};

// Size: 0x4
enum class IScatterContainerEntity_ECanvasSize
{
	SIZE_128 = 0,
	SIZE_256 = 1,
	SIZE_512 = 2,
	SIZE_1024 = 3,
	SIZE_2048 = 4,
	SIZE_4096 = 5,
};

// Size: 0x4
enum class ZMoveToOrder_EMoveSpeed
{
	MS_AUTO = 0,
	MS_SPRINT = 1,
	MS_JOG = 2,
	MS_WALK = 3,
};

// Size: 0x4
enum class ECCDecalEffect
{
	eCCDecalEffect_None = 0,
	eCCDecalEffect_Stab = 1,
	eCCDecalEffect_Blunt1H = 2,
	eCCDecalEffect_Blunt2H = 3,
	eCCDecalEffect_Slash1H = 4,
	eCCDecalEffect_Shatter = 5,
	eCCDecalEffect_AxeCleave = 6,
	eCCDecalEffect_AxePull = 7,
	eCCDecalEffect_AxeSlitThroat = 8,
	eCCDecalEffect_SlitThroat = 9,
	eCCDecalEffect_FacePunch = 10,
	eCCDecalEffect_Bruise = 11,
};

// Size: 0x14
class alignas(4) ZRecoverUnconsciousSituation_SSituationSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rVictim; // 0x0
	int32 m_pInvestigateDisguiseGroup; // 0x4
	int32 m_pRecoverUnconsciousGroup; // 0x8
	int32 m_pObserversGroup; // 0xC
	bool m_bEscalate; // 0x10
	bool m_bVictimPacified; // 0x11
};

// Size: 0x4
enum class IScatterContainerEntity_ECanvasClearMode
{
	CLEAR_ALL = 0,
	CLEAR_INTENSITY = 1,
	CLEAR_SPECIFICMATERIAL = 2,
	CLEAR_ALLMATERIALS = 3,
	CLEAR_SETINTENSITYVALUECLEARMATERIAL = 4,
	CLEAR_SETINTENSITYVALUEKEEPMATERIAL = 5,
	CLEAR_SETINTENSITYVALUEANDMATERIAL = 6,
	CLEAR_SETMATERIALKEEPINTENSITYVALUE = 7,
};

// Size: 0x4
enum class ZContractObjectiveHudHintEntity_EObjectiveHintIcon
{
	eNone = 0,
	eSuitcase = 1,
	eObjective_A = 3,
	eObjective_B = 4,
	eObjective_C = 5,
	eObjective_D = 6,
	eInfoIcon = 7,
	eExclamationMark = 8,
	eIntelIcon = 9,
	eDiscoveryIcon = 10,
	eDiscoveryIcon_A = 11,
	eDiscoveryIcon_B = 12,
	eDiscoveryIcon_C = 13,
	eDiscoveryIcon_A_Compleed = 14,
	eDiscoveryIcon_B_Compleed = 15,
	eDiscoveryIcon_C_Compleed = 16,
	eMissionObjective = 17,
	eExitMissionIcon = 18,
};

// Size: 0x8
class alignas(4) S3rdPersonCameraSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 m_fAngleYaw; // 0x0
	float32 m_fAnglePitch; // 0x4
};

// Size: 0x4
enum class ESpeechPriority
{
	SP_AMBIENT = 0,
	SP_ALERTED = 1,
	SP_PAIN = 2,
	SP_ALERTED_IMPORTANT = 3,
	SP_COMBAT = 4,
	SP_COMBAT_IMPORTANT = 5,
	SP_DEATH = 6,
	SP_MAX = 7,
	SP_COUNT__ = 8,
};

// Size: 0x4
enum class ECCWeaponAnimSet
{
	AS_SLIT_THROAT_1H = 0,
	AS_SWING_1H = 1,
	AS_BASH_1H = 2,
	AS_STAB_1H = 3,
	AS_SYRINGE_1H = 4,
	AS_SMASH_1H = 5,
	AS_STRANGLE = 6,
	AS_SWING_2H = 7,
	AS_BASH_2H = 8,
	AS_STAB_2H = 9,
	AS_STRANGLE_2H = 10,
	AS_SWORD_1H = 11,
	AS_AXE = 12,
};

// Size: 0x4
enum class ECompiledBehaviorType
{
	BT_ConditionScope = 0,
	BT_Random = 1,
	BT_Match = 2,
	BT_Sequence = 3,
	BT_BEHAVIORS_BEGIN = 4,
	BT_Dummy = 4,
	BT_Dummy2 = 5,
	BT_Error = 6,
	BT_Wait = 7,
	BT_WaitForStanding = 8,
	BT_WaitBasedOnDistanceToTarget = 9,
	BT_WaitForItemHandled = 10,
	BT_AbandonOrder = 11,
	BT_CompleteOrder = 12,
	BT_PlayAct = 13,
	BT_ConfiguredAct = 14,
	BT_PlayReaction = 15,
	BT_SimpleReaction = 16,
	BT_SituationAct = 17,
	BT_SituationApproach = 18,
	BT_SituationGetHelp = 19,
	BT_SituationFace = 20,
	BT_SituationConversation = 21,
	BT_Holster = 22,
	BT_SpeakWait = 23,
	BT_SpeakWaitWithFallbackIfAlone = 24,
	BT_ConfiguredSpeak = 25,
	BT_ConditionedConfiguredSpeak = 26,
	BT_ConditionedConfiguredAct = 27,
	BT_SpeakCustomOrDefaultDistractionAckSoundDef = 28,
	BT_SpeakCustomOrDefaultDistractionInvestigationSoundDef = 29,
	BT_SpeakCustomOrDefaultDistractionStndSoundDef = 30,
	BT_Pickup = 31,
	BT_Drop = 32,
	BT_PlayConversation = 33,
	BT_PlayAnimation = 34,
	BT_MoveToLocation = 35,
	BT_MoveToTargetKnownPosition = 36,
	BT_MoveToTargetActualPosition = 37,
	BT_MoveToInteraction = 38,
	BT_MoveToNPC = 39,
	BT_FollowTargetKnownPosition = 40,
	BT_FollowTargetActualPosition = 41,
	BT_PickUpItem = 42,
	BT_GrabItem = 43,
	BT_PutDownItem = 44,
	BT_Search = 45,
	BT_LimitedSearch = 46,
	BT_MoveTo = 47,
	BT_Reposition = 48,
	BT_SituationMoveTo = 49,
	BT_FormationMove = 50,
	BT_SituationJumpTo = 51,
	BT_AmbientWalk = 52,
	BT_AmbientStand = 53,
	BT_CrowdAmbientStand = 54,
	BT_AmbientItemUse = 55,
	BT_AmbientLook = 56,
	BT_Act = 57,
	BT_Patrol = 58,
	BT_MoveToPosition = 59,
	BT_AlertedStand = 60,
	BT_AlertedDebug = 61,
	BT_AttentionToPerson = 62,
	BT_StunnedByFlashGrenade = 63,
	BT_CuriousIdle = 64,
	BT_InvestigateWeapon = 65,
	BT_DeliverWeapon = 66,
	BT_RecoverUnconscious = 67,
	BT_GetOutfit = 68,
	BT_RadioCall = 69,
	BT_EscortOut = 70,
	BT_StashItem = 71,
	BT_CautiousSearchPosition = 72,
	BT_LockdownWarning = 73,
	BT_WakeUpUnconscious = 74,
	BT_DeadBodyInvestigate = 75,
	BT_GuardDeadBody = 76,
	BT_DragDeadBody = 77,
	BT_CuriousBystander = 78,
	BT_DeadBodyBystander = 79,
	BT_StandOffArrest = 80,
	BT_StandOffReposition = 81,
	BT_StandAndAim = 82,
	BT_CloseCombat = 83,
	BT_MoveToCloseCombat = 84,
	BT_MoveAwayFromCloseCombat = 85,
	BT_CoverFightSeasonTwo = 86,
	BT_ShootFromPosition = 87,
	BT_StandAndShoot = 88,
	BT_CheckLastPosition = 89,
	BT_ProtoSearchIdle = 90,
	BT_ProtoApproachSearchArea = 91,
	BT_ProtoSearchPosition = 92,
	BT_ShootTarget = 93,
	BT_TriggerAlarm = 94,
	BT_MoveInCover = 95,
	BT_MoveToCover = 96,
	BT_HomeAttackOrigin = 97,
	BT_Shoot = 98,
	BT_Aim = 99,
	BT_MoveToRandomNeighbourNode = 100,
	BT_MoveToRandomNeighbourNodeAiming = 101,
	BT_MoveToAndPlayCombatPositionAct = 102,
	BT_MoveToAimingAndPlayCombatPositionAct = 103,
	BT_PlayJumpyReaction = 104,
	BT_JumpyInvestigation = 105,
	BT_AgitatedPatrol = 106,
	BT_AgitatedGuard = 107,
	BT_HeroEscort = 108,
	BT_Escort = 109,
	BT_ControlledFormationMove = 110,
	BT_EscortSearch = 111,
	BT_LeadEscort = 112,
	BT_LeadEscort2 = 113,
	BT_AimReaction = 114,
	BT_FollowHitman = 115,
	BT_RideTheLightning = 116,
	BT_Scared = 117,
	BT_Flee = 118,
	BT_AgitatedBystander = 119,
	BT_SentryFrisk = 120,
	BT_SentryIdle = 121,
	BT_SentryWarning = 122,
	BT_SentryCheckItem = 123,
	BT_VIPScared = 124,
	BT_VIPSafeRoomTrespasser = 125,
	BT_DefendVIP = 126,
	BT_CautiousVIP = 127,
	BT_CautiousGuardVIP = 128,
	BT_InfectedConfused = 129,
	BT_EnterInfected = 130,
	BT_CureInfected = 131,
	BT_SickActInfected = 132,
	BT_Smart = 133,
	BT_Controlled = 134,
	BT_SpeakTest = 135,
	BT_Conversation = 136,
	BT_RunToHelp = 137,
	BT_WaitForDialog = 138,
	BT_WaitForConfiguredAct = 139,
	BT_TestFlashbangGrenadeThrow = 140,
	BT_BEHAVIORS_END = 141,
	BT_COMMANDS_BEGIN = 142,
	BT_RenewEvent = 142,
	BT_ExpireEvent = 143,
	BT_ExpireEvents = 144,
	BT_SetEventHandled = 145,
	BT_RenewSharedEvent = 146,
	BT_ExpireSharedEvent = 147,
	BT_ExpireAllEvents = 148,
	BT_CreateOrJoinSituation = 149,
	BT_JoinSituation = 150,
	BT_ForceActorToJoinSituation = 151,
	BT_JoinSituationWithActor = 152,
	BT_LeaveSituation = 153,
	BT_Escalate = 154,
	BT_GotoPhase = 155,
	BT_RenewGoal = 156,
	BT_ExpireGoal = 157,
	BT_RenewGoalOf = 158,
	BT_ExpireGoalOf = 159,
	BT_SetTension = 160,
	BT_TriggerSpotted = 161,
	BT_CopyKnownLocation = 162,
	BT_UpdateKnownLocation = 163,
	BT_TransferKnownObjectPositions = 164,
	BT_WitnessAttack = 165,
	BT_Speak = 166,
	BT_StartDynamicEnforcer = 167,
	BT_StopDynamicEnforcer = 168,
	BT_StartRangeBasedDynamicEnforcer = 169,
	BT_StopRangeBasedDynamicEnforcerForLocation = 170,
	BT_StopRangeBasedDynamicEnforcer = 171,
	BT_SetDistracted = 172,
	BT_IgnoreAllDistractionsExceptTheNewest = 173,
	BT_IgnoreDistractions = 174,
	BT_PerceptibleEntityNotifyWillReact = 175,
	BT_PerceptibleEntityNotifyReacted = 176,
	BT_PerceptibleEntityNotifyInvestigating = 177,
	BT_PerceptibleEntityNotifyInvestigated = 178,
	BT_PerceptibleEntityNotifyTerminate = 179,
	BT_LeaveDistractionAssistantRole = 180,
	BT_LeaveDistractionAssitingGuardRole = 181,
	BT_RequestSuitcaseAssistanceOverRadio = 182,
	BT_RequestSuitcaseAssistanceFaceToFace = 183,
	BT_ExpireArrestReasons = 184,
	BT_SetDialogSwitch_NPCID = 185,
	BT_InfectedAssignToFollowPlayer = 186,
	BT_InfectedRemoveFromFollowPlayer = 187,
	BT_Log = 188,
	BT_COMMANDS_END = 189,
	BT_Invalid = 190,
};

// Size: 0x4
enum class EActorRole
{
	eActorRole_Default = 0,
	eActorRole_Bodyguard = 1,
	eActorRole_VIP = 2,
};

// Size: 0x50
class alignas(4) SItemSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SVector3 m_vPosition; // 0x0
	SVector4 m_vRotation; // 0xC
	bool m_bShowItem; // 0x1C
	bool m_bEnablePickup; // 0x1D
	bool m_bKinematic; // 0x1E
	bool m_bSleeping; // 0x1F
	bool m_bIsPerceptible; // 0x20
	bool m_bDestroyed; // 0x21
	SVector3 m_vVelocity; // 0x24
	uint32 m_rTransformParent; // 0x30
	uint32 m_rSpawner; // 0x34
	uint32 m_rOwner; // 0x38
	uint32 m_rHoldingContainer; // 0x3C
	uint32 m_pPreviousOwner; // 0x40
	bool m_bTurnedOn; // 0x44
	bool m_bEverOwnedByHitman; // 0x45
	bool m_bWasPlacedAndAttached; // 0x46
	bool m_bObjectInPhysicsWorld; // 0x47
	int32 m_nQuantity; // 0x48
	ERenderGlowTypes m_eGlowType; // 0x4C
};

// Size: 0x1
enum class ZWaveformGeneratorEntity_ECurveType
{
	CURVE_TYPE_SINE = 0,
	CURVE_TYPE_SQUARE = 1,
	CURVE_TYPE_TRIANGLE = 2,
	CURVE_TYPE_SAWTOOTH = 3,
	CURVE_TYPE_REVERSE_SAWTOOTH = 4,
};

// Size: 0x4
enum class EItemHUDType
{
	EIHT_None = 0,
	EIHT_GhostItem = 1,
	EIHT_OutbreakHealingItem = 2,
};

// Size: 0x4
enum class ZDetectedInPrivateGroup_EInvestigateGroupState
{
	IGS_Delay = 0,
	IGS_Talk = 1,
	IGS_Move = 2,
	IGS_Wait = 3,
	IGS_Completed = 4,
	IGS_Max = 5,
};

// Size: 0x48
class alignas(8) SCautiousSituationMemberSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZGameTime m_tLastDisturbance; // 0x0
	ZGameTime m_tLastSearchCalc; // 0x8
	ZGameTime m_tLastInfluenceCalc; // 0x10
	ZGameTime m_tLastSearchCompleted; // 0x18
	ZGameTime m_tLastInvestigationCompleted; // 0x20
	ZGameTime m_tTimeIdling; // 0x28
	uint32 m_pGuardDutyPoint; // 0x30
	int32 m_nBulletImpactsHeard; // 0x34
	int32 m_nPatrolWaypointIndex; // 0x38
	uint32 m_nPatrolWaypointSubIndex; // 0x3C
	bool m_bBanterCandidate; // 0x40
	bool m_bCivOccupant; // 0x41
	bool m_bRecievingNewHuntTarget; // 0x42
	bool m_bLockdownEnforcer; // 0x43
};

// Size: 0x4
enum class ZActorPickerFilterKeyword_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
};

// Size: 0x4
enum class ZHM5HIKEventConsumer_EEffector
{
	eLeftHand = 0,
	eRightHand = 1,
};

// Size: 0x8
class alignas(4) ZHM5HIKEventConsumer_SZHM5HIKEventData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZHM5HIKEventConsumer_EEffector m_nEffector; // 0x0
	ZHM5HIKEventConsumer_EBlend m_nBlend; // 0x4
};

// Size: 0x4
enum class ENetworkSystemID
{
	NSID_UNDEFINED = 0,
	NSID_NETWORK_CORE_SYSTEMS_BEGIN = 1,
	NSID_DEBUG_SWAP_PLAYER_RPC = 1,
	NSID_ROUNTTRIPTEST_REQUEST_RPC = 2,
	NSID_ROUNTTRIPTEST_RESOLVE_RPC = 3,
	NSID_CONNECTION_LOCALLY_DEREFERENCE_UPDATE_RPC = 4,
	NSID_CONNECTION_READY_FOR_REPLICATION_RPC = 5,
	NSID_NETPLAYER_LOGIN_RPC = 6,
	NSID_NETPLAYER_LOGIN_COLOR_SELECTION_RPC = 7,
	NSID_NETPLAYER_REPLICA = 8,
	NSID_NETGAME_REPLICA = 9,
	NSID_PLAYERREGISTRY_REPLICA = 10,
	NSID_NETPLAYER_CONTROLLER_REPLICA = 11,
	NSID_SYNCH_POINT_PLAYER_REPLICA = 12,
	NSID_SYNCH_POINT_REPLICA = 13,
	NSID_GAME_CHAT_RPC = 14,
	NSID_NETWORK_CORE_SYSTEMS_END = 15,
	NSID_NETWORK_SYNCHRONOUS_MULTIPLAYER_BEGIN = 16,
	NSID_PLAYER_INPUT_RPC = 16,
	NSID_PLAYER_INPUT_REPLICA = 17,
	NSID_GENERAL_ENTITY_PROPERTY_REPLICA = 18,
	NSID_ANIMATED_ACTOR_RPC = 19,
	NSID_CAMERA_REPLICA = 20,
	NSID_GENERAL_PIN_SIGNAL_RPC = 21,
	NSID_PIN_SIGNAL_RPC = 22,
	NSID_NPC_DIALOGUE_RPC = 23,
	NSID_GAME_STATE_REPLICA = 24,
	NSID_HERO_STATE_REPLICA = 25,
	NSID_NPC_STATE_REPLICA = 26,
	NSID_ANIMATION_REPLICA = 27,
	NSID_DESTRUCTIBLE_INTERACTIONS_RPC = 28,
	NSID_ACT_REQUEST_RPC = 29,
	NSID_CHARACTERSPEAK_REPLICA = 30,
	NSID_ITEM_WEAPON_RPC = 31,
	NSID_ITEM_REPLICA = 32,
	NSID_ACCESSORY_ITEM_REPLICA = 33,
	NSID_BULLET_IMPACT_RPC = 34,
	NSID_NETWORKED_TIME_CONTROL_RPC = 35,
	NSID_REQUEST_ACTION_SYCHRONIZATION_RPC = 36,
	NSID_PHYSICS_SYSTEM_REPLICA = 37,
	NSID_PHYSICS_OBJECT_REPLICA = 38,
	NSID_WATER_SPLASH_GENERATOR_RPC = 39,
	NSID_PROJECTILE_HIT_INFO_RPC = 40,
	NSID_PROJECTILE_HIT_EVENT_RPC = 41,
	NSID_INTERACTION_SUBACTION_EXECUTE_REQUEST = 42,
	NSID_INTERACTION_SUBACTION_EXECUTE_RESOLVE = 43,
	NSID_INTERACTION_SUBACTION_EXECUTE_SIGNAL_RESOLVE = 44,
	NSID_INTERACTION_INPUT_REQUEST_RESOLVE = 45,
	NSID_SUBCONTROLLER_REPLICA = 46,
	NSID_CONTRACT_EVENT_REPLICA = 47,
	NSID_NETWORK_SYNCHRONOUS_MULTIPLAYER_END = 48,
	NSID_SNIPERS_CHALLENGE_SCORING_EVENT_REPLICA = 49,
	NSID_CHARACTER_GHOST_REPLICA = 50,
	NSID_PIP_GHOST_REPLICA = 51,
	NSID_SPATIAL_GHOST_REPLICA = 52,
	NSID_VS_TARGET_PICKER_REPLICA = 53,
	NSID_VS_KILL_RPC = 54,
	NSID_VS_KILL_CONFIRM_RPC = 55,
	NSID_VS_CLIENT_DEAD_RPC = 56,
	NSID_VS_SETUP_SYNC_REPLICA = 57,
	NSID_VS_PIN_SIGNAL_RPC = 58,
	NSID_VS_ENTITY_PROPERTY_REPLICA = 59,
	NSID_VS_GENERIC_EVENT_RPC = 60,
	NSID_VS_PENALTY_KILL_RPC = 61,
	NSID_VS_ITEM_PICKUP_REQUEST_RPC = 62,
	NSID_VS_ITEM_PICKUP_RESPONSE_RPC = 63,
	NSID_VS_OUTFIT_PICK_REQUEST_RPC = 64,
	NSID_VS_OUTFIT_PICK_RESPONSE_RPC = 65,
	NSID_VS_PICKUP_SPAWNER_REPLICA = 66,
	NSID_VS_KILL_EVENT_RPC = 67,
	NSID_VS_PRE_SCORE_TIMER_RPC = 68,
	NSID_VS_TARGET_PACIFY_RPC = 69,
	NSID_VS_CONFIRM_TARGET_PACIFY_RPC = 70,
	NSID_VS_TARGET_PACIFIED_CONFIRMED_RPC = 71,
	NSID_MAX = 72,
};

// Size: 0x4
enum class ZConditionListEntity_EEvaluationType
{
	ALL_TRUE = 0,
	ANY_TRUE = 1,
};

// Size: 0x30
class alignas(8) SCrowdFlowChannel
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint8> m_aFlowVectorIndex; // 0x0
	TArray<uint16> m_aFlowCost; // 0x18
};

// Size: 0x4
enum class ZHM5FaceFXReactionEventConsumer_EEvent
{
	eHitByBullet = 0,
	eFireRegularWeapon = 1,
	eReloadRegularWeapon = 2,
	eFireHeavyWeapon = 3,
	eReloadHeavyWeapon = 4,
	eCCAttacking = 5,
	eCCGettingHit = 6,
	eCoverDodgebulletLeft = 7,
	eCoverDodgebulletRight = 8,
	eReactToExplosion = 9,
};

// Size: 0x4
enum class ZDebugSpatialEntity_EDrawLayer
{
	DL_DEFAULT = 0,
	DL_LIGHT = 1,
	DL_PARTICLES = 2,
	DL_PARTITIONING = 3,
	DL_DECALS = 4,
	DL_CROWD = 5,
	DL_PHYSICS = 6,
	DL_HERO = 7,
	DL_AI = 8,
	DL_AI_GRID = 9,
	DL_AI_SITUATION = 10,
	DL_NPC_LOCOMOTION = 11,
	DL_GAME = 12,
	DL_ALIGNMENT = 13,
	DL_ENGINE = 14,
	DL_SOUND = 15,
	DL_ANIMATION = 16,
	DL_CLOTH = 17,
	DL_SOUND_PARTITIONING = 18,
	DL_UI = 19,
};

// Size: 0x4
enum class EIntelTensionLevel
{
	eITL_Undefined = 0,
	eITL_Ambient = 1,
	eITL_Agitated = 2,
	eITL_Searching = 3,
	eITL_AlertedLow = 4,
	eITL_AlertedHigh = 5,
	eITL_Hunting = 6,
	eITL_Arrest = 7,
	eITL_Combat = 8,
};

// Size: 0x4
enum class CrowdUtil_ECrowdSide
{
	LEFT = 0,
	RIGHT = 1,
};

// Size: 0x4
enum class ESentryActionPrompt
{
	eSAP_None = 0,
	eSAP_Frisk = 1,
	eSAP_ShowItem = 2,
	eSAP_Max = 3,
};

// Size: 0x4
enum class EInventoryConfigCustomRule
{
	EICCR_None = 0,
	EICCR_Surrender = 1,
	EICCR_TempDropLeftHandItem = 2,
};

// Size: 0x4
enum class ZItemSpawner_EPhysicsMode
{
	EPM_DEFINED_BY_ITEM = 0,
	EPM_DYNAMIC = 1,
	EPM_SLEEPING = 2,
	EPM_KINEMATIC = 3,
};

// Size: 0x4
enum class EScreenPlayState
{
	State_Stopped = 0,
	State_Running = 1,
	State_Resuming = 2,
	State_Pausing = 3,
	State_Paused = 4,
	State_Done = 5,
	State_Terminated = 6,
};

// Size: 0xC
class alignas(4) SDrama2SetupSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bDoneTriggered; // 0x0
	EScreenPlayState m_eState; // 0x4
	uint32 m_rSituation; // 0x8
};

// Size: 0x30
class alignas(8) SDrama2SetupCollectionSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint32> m_aEntities; // 0x0
	TArray<SDrama2SetupSaveData> m_aStates; // 0x18
};

// Size: 0x18
class alignas(8) SBehaviorTreeEvaluationLogEntry
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_nBehaviorTreeIndex; // 0x0
	uint64 m_nConditionOffset; // 0x8
	bool m_bResult; // 0x10
};

// Size: 0x30
class alignas(8) SBehaviorTreeEvaluationLog
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<ZResourceID> m_BehaviorTrees; // 0x0
	TArray<SBehaviorTreeEvaluationLogEntry> m_Entries; // 0x18
};

// Size: 0x4
enum class EInteractionInputType
{
	EIIT_UNKNOWN = 0,
	EIIT_PRESS = 1,
	EIIT_HOLD = 2,
	EIIT_HOLD_DOWN = 3,
	EIIT_REPEAT = 4,
	EIIT_GUIDE = 5,
};

// Size: 0x4
enum class EBIEventTypes
{
	eBIL_HM_HitNPC = 0,
	eBIL_HM_HitNPCKilled = 1,
	eBIL_HM_HitNPCHeadShot = 2,
	eBIL_HM_HitNPCCloseCombatShot = 3,
	eBIL_NPC_HitHM = 4,
	eBIL_Geometry = 5,
};

// Size: 0x48
class alignas(8) STargetInfoObjectiveCondition
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString header; // 0x0
	ZString title; // 0x10
	ZString icon; // 0x20
	ZString type; // 0x30
	bool hardCondition; // 0x40
};

// Size: 0x58
class alignas(8) STargetInfoDisplayData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString npcName; // 0x0
	ZString disguiseName; // 0x10
	ZString objectiveType; // 0x20
	TArray<STargetInfoObjectiveCondition> objectiveConditions; // 0x30
	int32 fX; // 0x48
	int32 fY; // 0x4C
	float32 fAlpha; // 0x50
	bool bIsTarget; // 0x54
};

// Size: 0x18
class alignas(8) STargetInfoDisplayData_Dummy
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<STargetInfoDisplayData> __dummy; // 0x0
};

// Size: 0x4
enum class ICameraEntity_EProjectionType
{
	ePerspectiveRH = 0,
	eOrtogonalRH = 1,
	eCustom = 2,
};

// Size: 0x4
class alignas(4) SClothBundleSpawnSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rClothbundle; // 0x0
};

// Size: 0x4
enum class ZDeadBodySituation_ESituationFlavor
{
	SF_None = 0,
	SF_Unconscious = 1,
	SF_DeadBody = 2,
	SF_Accident = 3,
};

// Size: 0x4
enum class ZBoxReflectionEntity_EBoundsType
{
	eBox = 0,
	eRoom = 1,
};

// Size: 0x4
enum class ERatingTitleRequirement
{
	ERatingTitleRequirement_Optional = 0,
	ERatingTitleRequirement_Required = 1,
	ERatingTitleRequirement_Fails = 2,
};

// Size: 0x4
enum class ZSetVisibleEntity_StartBehavior
{
	SB_Nothing = 0,
	SB_MakeVisible = 1,
	SB_MakeInvisible = 2,
};

// Size: 0x4
enum class STestStruct_ETestEnum
{
	ETomato = 3,
	EPotato = 5,
};

// Size: 0x18
class alignas(4) SAudioEmitterEventSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_nEventId; // 0x0
	bool m_bPaused; // 0x4
	uint32 m_nFlags; // 0x8
	uint32 m_rEventSender; // 0xC
	int32 m_nSeekPosition; // 0x10
	uint8 m_nPlayState; // 0x14
};

// Size: 0x38
class alignas(8) SAnimatedActorReactOrderSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SVector3 m_vFaceTarget; // 0x0
	SVector3 m_vLookAtTarget; // 0xC
	uint32 m_rChildNetworkEntity; // 0x18
	EActorEmotionState m_targetEmotionState; // 0x1C
	bool m_bDeadbody; // 0x20
	bool m_bExplosion; // 0x21
	bool m_bTrespassing; // 0x22
	bool m_bDropCarriedItems; // 0x23
	bool m_bFaceTargetSet; // 0x24
	bool m_bLookAtTargetSet; // 0x25
	ZString m_sAct; // 0x28
};

// Size: 0xC0
class alignas(8) SSaveGameHeader
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 nFourCC; // 0x0
	uint32 nVersion; // 0x4
	uint32 nCrc32; // 0x8
	uint32 nSize; // 0xC
	int64 nTimeStamp; // 0x10
	SSaveGameMetaData MetaData; // 0x18
};

// Size: 0x4
enum class EMeBarState
{
	ME_BAR_NONE = 0,
	ME_BAR_TRESPASSING = 1,
	ME_BAR_DEEPTRESPASSING = 2,
	ME_BAR_VISIBLY_ARMED = 3,
	ME_BAR_CHANGING_DISGUISE = 4,
	ME_BAR_DISGUISE_BLOWN = 5,
	ME_BAR_DISGUISE_SUSPICIOUS = 6,
	ME_BAR_NEAR_BODY = 7,
};

// Size: 0x4
enum class ECCNodeSubtype
{
	eCCNodeSubtype_Left = 0,
	eCCNodeSubtype_Right = 1,
	eCCNodeSubtype_Front = 2,
	eCCNodeSubtype_Back = 3,
	eCCNodeSubtype_StairsAbove = 4,
	eCCNodeSubtype_StairsBelow = 5,
	eCCNodeSubtype_StairsAbove_Back = 6,
	eCCNodeSubtype_StairsBelow_Back = 7,
	eCCNodeSubtype_Front_Back = 8,
	eCCNodeSubtype_Count = 9,
};

// Size: 0x4
enum class ZPIPMessageEntity_EIcon
{
	IconStart = 0,
	MagnifyingGlass = 1,
	ArrowRight = 2,
	ExclamationMark = 3,
	Target = 4,
	SurveillanceCamera = 5,
	Concealed = 6,
	QuestionMark = 7,
	IconEnd = 8,
};

// Size: 0x4
enum class EWaypointRotationAlignment
{
	RA_NONE = 0,
	RA_LOOSE = 1,
	RA_EXACT = 2,
};

// Size: 0x1
enum class EAsyncRaycastsGroup
{
	eAsyncRaycasts_Gameplay = 0,
	eAsyncRaycasts_ParticlesSoundCloth = 1,
	eAsyncRaycasts_UNUSED_LAST = 2,
};

// Size: 0x4
enum class EHintMessageSoundType
{
	EHintMessageSound_None = 0,
	EHintMessageSound_GeneralHint = 1,
	EHintMessageSound_UsefulItem = 2,
	EHintMessageSound_NeedsItem = 3,
	EHintMessageSound_ObjectiveExit = 4,
	EHintMessageSound_Target = 5,
	EHintMessageSound_AccidentKill = 6,
	EHintMessageSound_Trespassing = 7,
	EHintMessageSound_CanBeTurnedOn = 8,
	EHintMessageSound_CanBeTurnedOff = 9,
	EHintMessageSound_Agility = 10,
};

// Size: 0x4
enum class EKnownEntityType
{
	KET_UNKNOWN = 0,
	KET_HITMAN = 1,
	KET_ACTOR = 2,
	KET_ITEM = 3,
	KET_LOCATION = 4,
	KET_OBJECT = 5,
	KET_COVER = 6,
	KET_PERCEPTIBLE = 7,
	KET_TEMPCROWDBODY = 8,
};

// Size: 0x4
enum class ZActorAccessoryItemCondition_EConditionTypes
{
	ECT_HasInPool = 0,
	ECT_HasAttached = 1,
};

// Size: 0x4
enum class ZHM5DynamicRayCastEntity_ECollideType
{
	eAll = 0,
	eStaticOnly = 1,
	eDynamicOnly = 2,
	eBaseCharacter = 3,
	eHitman = 4,
	eActor = 5,
};

// Size: 0x4
enum class ZCausalNodeEntity_ECauseEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
};

// Size: 0x4
enum class ESoundGateFlags
{
	SOUNDGATE_FLAGS_AMBIENCE = 1,
	SOUNDGATE_FLAGS_OCCLUSION = 2,
	SOUNDGATE_FLAGS_ALL = 255,
};

// Size: 0x4
enum class EInteractionIndicatorState
{
	EIIS_AVAILABLE = 0,
	EIIS_COLLAPSED = 1,
	EIIS_ACTIVATING = 2,
	EIIS_NOTAVAILABLE = 3,
};

// Size: 0x4
enum class CrowdUtil_EGenderReq
{
	eGender_Any = 0,
	eGender_Male = 1,
	eGender_Female = 2,
};

// Size: 0x4
enum class EActorLookAtPriority
{
	eALAPriority_Ambient = 0,
	eALAPriority_AmbientHigh = 1,
	eALAPriority_Alert = 2,
	eALAPriority_AlertHigh = 3,
	eALAPriority_Hunt = 4,
	eALAPriority_HuntHigh = 5,
	eALAPriority_Combat = 6,
	eALAPriority_CombatHigh = 7,
};

// Size: 0x1
enum class ECharacterAnimEventState
{
	eES_None = 0,
	eES_Pending = 1,
	eES_Completed = 2,
	eES_TimedOut = 3,
};

// Size: 0x4
enum class ZFriskSuspectGroup_EHitmanGreetState
{
	HGS_NotGreeted = 0,
	HGS_Greeted = 1,
	HGS_ShrugOff = 2,
};

// Size: 0x8
class alignas(4) SActorAnimSetVariationIndexSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rAnimationSetDefinition; // 0x0
	int32 m_nIndex; // 0x4
};

// Size: 0x48
class alignas(8) SActorAnimSetSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	EAnimSetType m_eAnimSet; // 0x0
	uint32 m_rCustomAnimationSet; // 0x4
	EGameTension m_eVariationResourceMaxTension; // 0x8
	EActorEmotionState m_eVariationResourceMaxEmotionState; // 0xC
	EAnimSetState m_eAnimSetEmotionState; // 0x10
	EAnimSetType m_ePreCustomAnimSet; // 0x14
	TArray<SActorAnimSetVariationIndexSaveData> m_aLocoVariationIndecies; // 0x18
	TArray<SActorAnimSetVariationIndexSaveData> m_aReactVariationIndecies; // 0x30
};

// Size: 0x4
enum class EAttachLocation
{
	eALRightHand = 0,
	eALLeftHand = 1,
	eALFreeBone = 2,
	eALBack = 3,
	eALRifle = 4,
	eALAttachCount = 5,
	eALUndefined = 6,
};

// Size: 0x10
class alignas(4) SActorInventoryItemSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rItem; // 0x0
	EAttachLocation m_eAttachLocation; // 0x4
	EGameTension m_eMaxTension; // 0x8
	bool m_bLeftHand; // 0xC
	bool m_bWeapon; // 0xD
	bool m_bGrenade; // 0xE
};

// Size: 0x18
class alignas(8) SActorInventorySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SActorInventoryItemSaveData> m_aItems; // 0x0
};

// Size: 0x18
class alignas(8) SLongTermMemorySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZRepositoryID m_sOutfit; // 0x0
	uint8 m_Memory; // 0x10
};

// Size: 0x4
enum class EDeathType
{
	eDT_UNDEFINED = 0,
	eDT_PACIFY = 1,
	eDT_KILL = 2,
	eDT_BLOODY_KILL = 3,
};

// Size: 0x60
class alignas(8) SActorDamageControlSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool bExplosive; // 0x0
	bool bProjectile; // 0x1
	bool bHeadshot; // 0x2
	bool bSniperShot; // 0x3
	bool bThroughWall; // 0x4
	bool bKillByAccident; // 0x5
	bool bWeaponSilenced; // 0x6
	bool bLongRange; // 0x7
	float32 fTotalDamage; // 0x8
	float32 fPacifyDamage; // 0xC
	int32 nImpactBodyPart; // 0x10
	EDeathType maxDeathType; // 0x14
	EDeathContext maxDeathContext; // 0x18
	uint32 rAccidentSetup; // 0x1C
	bool bFirearmPacifiesTarget; // 0x20
	bool bBulletCausesHitReaction; // 0x21
	float32 fHitsNumberTimeout; // 0x24
	float32 fHealthPercentTimeout; // 0x28
	uint32 rCharacter; // 0x2C
	uint32 rSource; // 0x30
	ZRepositoryID m_accuseUnconsciousOutfit; // 0x38
	bool m_bValidAccuseUnconsciousOutfit; // 0x48
	EActorSoundDefs eDeathSpeak; // 0x4C
	bool bDefaultDeathSound; // 0x50
	int32 iEvents; // 0x54
	float32 fAgilityElementUncosciousTime; // 0x58
};

// Size: 0x40
class alignas(8) SActorDynamicTemplateSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString m_sName; // 0x0
	EGameTension m_eTensionLimit; // 0x10
	EActorEmotionState m_eEmotionLimit; // 0x14
	ZGameTime m_nTimeLimit; // 0x18
	EGameTension m_eTensionRemoveLimit; // 0x20
	EActorEmotionState m_eEmotionRemoveLimit; // 0x24
	ZGameTime m_nTimeRemoveLimit; // 0x28
	int64 m_resourceID; // 0x30
	uint32 m_rInstance; // 0x38
};

// Size: 0x18
class alignas(8) SEventHistorySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<ZGameTime> m_aOccurences; // 0x0
};

// Size: 0x20
class alignas(4) SActorBoneSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SVector4 mQuaterion; // 0x0
	SVector4 mTranslation; // 0x10
};

// Size: 0x40
class alignas(8) SActorRagdollPoseSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SVector3 m_vBodyVelocity; // 0x0
	TArray<SActorBoneSaveData> m_aBones; // 0x10
	TArray<uint32> m_aBoneIndices; // 0x28
};

// Size: 0x370
class alignas(16) SActorSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SVector3 m_vPosition; // 0x0
	SVector4 m_vQuaternion; // 0xC
	SActorInventorySaveData m_Inventory; // 0x20
	SActorAnimSetSaveData m_AnimSet; // 0x38
	SActorThrowSaveData m_ThrowHandler; // 0x80
	int32 m_nCurrentBehaviorType; // 0xD0
	ZVariant m_CurrentBehaviorState; // 0xD8
	TArray<uint32> m_aCurrentBehaviorEntities; // 0xE8
	TArray<uint32> m_aBehaviorEntities; // 0x100
	SKnowledgeSaveData m_KnowledgeData; // 0x118
	ZRepositoryID m_OutfitRepositoryId; // 0x1B0
	int32 m_nOutfitCharset; // 0x1C0
	int32 m_nOutfitVariation; // 0x1C4
	ZGameTime m_tSequenceEndTime; // 0x1C8
	EActorState m_nState; // 0x1D0
	uint32 m_rBodyContainerEntity; // 0x1D4
	int32 m_nBodyContainerSlot; // 0x1D8
	EActorEmotionState m_eEmotionState; // 0x1DC
	uint32 m_rCorpseBodybagEntity; // 0x1E0
	uint32 m_rDragBodybagEntity; // 0x1E4
	uint32 m_AccidentContext; // 0x1E8
	SActorDamageControlSaveData m_ActorDamageControlData; // 0x1F0
	ZVariant m_AnimatedActorOrderData; // 0x250
	float32 m_fStepsFraction; // 0x260
	float32 m_fZBeforeEnteringStairs; // 0x264
	float32 m_fZError; // 0x268
	TArray<SActorDynamicTemplateSaveData> m_aDynamicTemplates; // 0x270
	SMatrix m_sEndOrientation; // 0x290
	EActorAIState m_eOverrideSensorState; // 0x2D0
	EDeathBehavior m_eDeathBehavior; // 0x2D4
	SEventHistorySaveData m_bumpsHistory; // 0x2D8
	SActorRagdollPoseSaveData m_RagdollPose; // 0x2F0
	TArray<SLongTermMemorySaveData> m_aLongTermMemorySaveData; // 0x330
	uint32 m_AgentData; // 0x348
	uint32 m_KnockdownsWhileConscious; // 0x34C
	uint32 m_SecondaryAIIconState; // 0x350
	bool m_HadValidAgent; // 0x354
	bool m_bNude; // 0x355
	bool m_bActiveEnforcer; // 0x356
	bool m_bIsPotentialEnforcer; // 0x357
	bool m_bDynamicEnforcer; // 0x358
	bool m_bIsCrowdCharacter; // 0x359
	bool m_bIsWoozy; // 0x35A
	bool m_bBlendingOrientation; // 0x35B
	bool m_bMakeMainWeaponUndroppable; // 0x35C
	bool m_bFinalizePendingSpawnGrenade; // 0x35D
	bool m_bWeaponIsHidden; // 0x35E
	bool m_bRegisteredForLT; // 0x35F
	bool m_bKeepOverrideSensorStateAfterBeingUnconscious; // 0x360
	bool m_bWeaponReady; // 0x361
	bool m_bDynamicWeaponUnholstered; // 0x362
	bool m_bForceInteractionGlow; // 0x363
	bool m_bIsOutfitRuined; // 0x364
};

// Size: 0x20
class alignas(8) SEntityPath
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint64 m_nOwnerID; // 0x0
	TArray<uint64> m_aEntityPath; // 0x8
};

// Size: 0x38
class alignas(8) SSaveGameData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_nVersion; // 0x0
	TArray<SSavableData> m_aSavableObjectsData; // 0x8
	TArray<SEntityPath> m_aEntityPaths; // 0x20
};

// Size: 0x4
enum class SDoorSoundDefs_EDefinition
{
	DoorOpen = 0,
	DoorClose = 1,
	DoorSlam = 2,
	DoorOpenStop = 3,
};

// Size: 0x4
enum class ZActorPickerEffectDrama_EEffectPhaseAction
{
	EPA_START = 0,
	EPA_LEAVE = 1,
};

// Size: 0x48
class alignas(8) AI_Private_Details_SBaseStimulus_Pool_SaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint32> m_SlotDetails; // 0x0
	TArray<int16> m_UsageRepresentation; // 0x18
	TArray<uint16> m_FreeIndices; // 0x30
};

// Size: 0x4
enum class EItemModifierType
{
	MODIFIER_NONE = 0,
	MODIFIER_THROW = 1,
	MODIFIER_CARRY = 2,
	MODIFIER_AMMO = 3,
	MODIFIER_PRECISION = 4,
	MODIFIER_DAMAGE = 5,
	MODIFIER_IMPACT = 6,
	MODIFIER_EXPLOSIVE = 7,
	MODIFIER_RANGE = 8,
	MODIFIER_ZOOM = 9,
	MODIFIER_SUPPRESSOR = 10,
	MODIFIER_RECOIL = 11,
	MODIFIER_RATEOFFIRE = 12,
	MODIFIER_SCOPEBOBBING = 13,
	MODIFIER_MUZZLEVELOCITY = 14,
	MODIFIER_KNOCKDOWN = 15,
	MODIFIER_FULLAUTO = 16,
	MODIFIER_PRECISIONSHOT = 17,
	MODIFIER_SCOPETIMESLOWDOWN = 18,
	MODIFIER_STYLE = 19,
	MODIFIER_RELOAD = 20,
	MODIFIER_THRESHOLD = 21,
	MODIFIER_PERK = 22,
	MODIFIER_MAGAZINE = 23,
	MODIFIER_BURST = 24,
};

// Size: 0x4
enum class ZAudioSequenceTrack_EPlaybackTarget
{
	eNone = 0,
	eTargetEntityAudioPlayer = 1,
	eTargetEntityEmitter = 2,
	ePreviewEmitter = 3,
};

// Size: 0x8
class alignas(4) SMovementDisguiseSafeZoneSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rSafeZone; // 0x0
	uint32 m_nSafeZoneAnimNode; // 0x4
};

// Size: 0x4
enum class EAISituation
{
	AIS_GENERIC = 0,
	AIS_SPECIAL = 1,
	AIS_SENSOR = 2,
	AIS_TRESPASSING = 3,
	AIS_STANDOFF = 4,
	AIS_SMUGGLE = 5,
	AIS_GET_HELP = 6,
	AIS_CONVERSTION_GROUP = 7,
	AIS_PROTO_COMBAT = 8,
	AIS_SENTRY = 9,
	AIS_LEAD_ESCORT = 10,
	AIS_INVESTIGATE_WEAPON = 11,
	AIS_INVESTIGATE_STANDING = 12,
	AIS_INVESTIGATE_CURIOUS = 13,
	AIS_INVESTIGATE_CAUTIOUS = 14,
	AIS_HERO_ESCORT = 15,
	AIS_EVACUATE = 16,
	AIS_ESCORT = 17,
	AIS_ENTOURAGE = 18,
	AIS_DRAMA = 19,
	AIS_DISGUISE = 20,
	AIS_DEAD_BODY = 21,
	AIS_COMBAT = 22,
	AIS_CLOSE_COMBAT = 23,
	AIS_AVOID_EXPLOSION = 24,
	AIS_ACCIDENT = 25,
	AIS_PRIVATE = 26,
	AIS_GUARD_BODY = 27,
	AIS_RECOVER_UNC = 28,
	AIS_SNIPER = 29,
};

// Size: 0x10
class alignas(4) AI_SFirePattern02_SData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 m_FireMinSeconds; // 0x0
	float32 m_FireMaxSeconds; // 0x4
	float32 m_WaitMinSeconds; // 0x8
	float32 m_WaitMaxSeconds; // 0xC
};

// Size: 0x4
enum class EDramaSituationDescriptors
{
	eDSD_NONE = 0,
	eDSD_HERO = 1,
	eDSD_CONVERSATION = 2,
	eDSD_DISTRACTION = 4,
	eDSD_URGENT = 8,
	eDSD_SICK = 16,
	eDSD_DEATH = 32,
	eDSD_ALERT = 64,
	eDSD_PARANOID = 128,
	eDSD_SCARY = 256,
	eDSD_TRIVIAL = 512,
	eDSD_PREOCCUPIED = 1024,
	eDSD_PRIVATE = 2048,
};

// Size: 0x1
enum class EOpportunityState
{
	OS_TRACKED = 1,
	OS_ENABLED = 2,
	OS_UNLOCKED = 4,
	OS_REVEAL_PENDING = 8,
};

// Size: 0x1
enum class ERagdollPart
{
	ERAGDOLLPART_NONE = 0,
	ERAGDOLLPART_BODY = 1,
	ERAGDOLLPART_HEAD = 2,
	ERAGDOLLPART_HAND = 3,
	ERAGDOLLPART_FOOT = 4,
};

// Size: 0x4
enum class ZStateControllerEntity_WrapMode
{
	WM_Loop = 0,
	WM_Clamp = 1,
};

// Size: 0x8
class alignas(0) IPureWaterReflectable
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x3
class alignas(1) SPhysicsSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bIsInPhysicsWorld; // 0x0
	bool m_bIsKinematicBody; // 0x1
	bool m_bIsVisible; // 0x2
};

// Size: 0x1
enum class EOrderCompletionStatus
{
	OCS_Undetermined = 0,
	OCS_Succeeded = 1,
	OCS_Interrupted = 2,
	OCS_Blocked = 3,
	OCS_Failed = 4,
};

// Size: 0x4
class alignas(4) SHeroEscortSituationActors
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
};

// Size: 0x4
enum class ZHM5ContextActionEntity_EInteraction
{
	eIT_RotateLeftStick = 0,
	eIT_AutoComplete = 1,
	eIT_NoInteraction = 2,
};

// Size: 0x4
enum class EOutbreakInfectionStage
{
	eOIS_Stage1 = 0,
	eOIS_Stage2 = 1,
	eOIS_Stage3 = 2,
};

// Size: 0x4
enum class eActionRewardType
{
	AR_None = 0,
	AR_QuestItem = 1,
	AR_Keycard = 2,
	AR_Key = 3,
};

// Size: 0x4
enum class ZAT2Controller_EFootstepsMovementType
{
	MOVEMENT_WALKING = 0,
	MOVEMENT_WALKING_SLIDING = 1,
	MOVEMENT_RUNNING = 2,
	MOVEMENT_STANDING = 3,
};

// Size: 0x4
enum class ZMoveToPositionBehaviorEntity_EMovementType
{
	MT_WALK = 0,
	MT_SNAP = 1,
	MT_IGNORE_POSITION = 2,
};

// Size: 0x1
enum class AudioCurve
{
	AudioCurve_Log3 = 0,
	AudioCurve_Sine = 1,
	AudioCurve_Log1 = 2,
	AudioCurve_InvSCurve = 3,
	AudioCurve_Linear = 4,
	AudioCurve_SCurve = 5,
	AudioCurve_Exp1 = 6,
	AudioCurve_SineRecip = 7,
	AudioCurve_Exp3 = 8,
	AudioCurve_LastFadeCurve = 9,
	AudioCurve_Constant = 10,
};

// Size: 0x4
enum class ZHM5ForceCover_EFaceDirection
{
	eFaceLeft = 0,
	eFaceRight = 1,
};

// Size: 0x4
enum class EActivationPriority
{
	eActivatable_First = 0,
	eActivatable_PlayModeAddedPhysics = 1,
	eActivatable_DestructiblePhysics = 2,
	eActivatable_PhysicsWind = 3,
	eActivatable_Physics = 4,
	eActivatable_PhysicsDone = 5,
	eActivatable_Keywords = 6,
	eActivatable_EventChannel = 7,
	eActivatable_Items = 8,
	eActivatable_Actor = 9,
	eActivatable_Hitman = 10,
	eActivatable_AnimPlayer = 11,
	eActivatable_Sequence = 12,
	eActivatable_SpawnPoint = 13,
	eActivatable_CoverPlane = 14,
	eActivatable_GuardPoint = 15,
	eActivatable_Guide = 16,
	eActivatable_CombatAct = 17,
	eActivatable_CombatAttractor = 18,
	eActivatable_SequenceController = 19,
	eActivatable_KnownEntityAspects = 20,
	eActivatable_AIReasoningGrid = 21,
	eActivatable_HM5Zone = 22,
	eActivatable_Crowds = 23,
	eActivatable_ChildNetworkAct = 24,
	eActivatable_Door = 25,
	eActivatable_UI_Setup = 26,
	eActivatable_NormalGameplay = 27,
	eActivatable_NormalGameplay_Condition = 28,
	eActivatable_NormalGameplay_Values = 29,
	eActivatable_NormalGameplay_State = 30,
	eActivatable_HeroSpawns = 31,
	eActivatable_UI = 32,
	eActivatable_Locomotion = 33,
	eActivatable_Timers = 34,
	eActivatable_AreaTriggers = 35,
	eActivatable_Default = 36,
	eActivatable_GameEventListener = 37,
	eLAST_ACTIVATION_PRIORITY = 38,
};

// Size: 0x4
enum class ZMenuSliderNavigationEntity_ESliderInputMode
{
	E_HORIZONTAL = 0,
	E_VERTICAL = 1,
};

// Size: 0x4
enum class ZActDurationCondition_EState
{
	MOVING = 0,
	ENTERING = 1,
	PLAYING = 2,
	STOPPING = 3,
};

// Size: 0x4
class alignas(2) ZCrowdGridPoint
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int16 m_nHeightOffset; // 0x0
	uint8 m_nOnNavGrid; // 0x2
};

// Size: 0x4
enum class ETextAlignment
{
	TEXT_ALIGN_LEFT = 0,
	TEXT_ALIGN_CENTER = 1,
	TEXT_ALIGN_RIGHT = 2,
};

// Size: 0x4
enum class eItemSize
{
	ITEMSIZE_SMALL = 0,
	ITEMSIZE_MEDIUM = 1,
	ITEMSIZE_LARGE = 2,
};

// Size: 0x4
enum class ZLeadEscortSituationEntity_ETargetState
{
	ETS_Unknown = 0,
	ETS_NoTarget = 1,
	ETS_RunningActBehavior = 2,
	ETS_RunningDummyBehavior = 3,
	ETS_RunningOtherBehavior = 4,
	ETS_Dead = 5,
	ETS_TargetIsHitman = 6,
};

// Size: 0x8
class alignas(0) ISoundMaterialDescriptor
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class ECrowdFlowCandidates
{
	NONE = 0,
	EVERYONE = 1,
	SPAWNED_ON_FLOW = 2,
};

// Size: 0x4
enum class ECharacterSubcontrollerType
{
	eSCT_IDGenerator = 0,
	eSCT_Debugger = 1,
	eSCT_Time = 2,
	eSCT_Tags = 3,
	eSCT_Descriptors = 4,
	eSCT_ActionRequest = 5,
	eSCT_Events = 6,
	eSCT_Animator = 7,
	eSCT_Motor = 8,
	eSCT_Inventory = 9,
	eSCT_FlavorIdle = 10,
	eSCT_Lookat = 11,
	eSCT_AimAssistant = 12,
	eSCT_CharacterCollector = 13,
	eSCT_SwipeMechanic = 14,
	eSCT_OpenDoor = 15,
	eSCT_Fullbody = 16,
	eSCT_Aim = 17,
	eSCT_PrecisionShot = 18,
	eSCT_Marking = 19,
	eSCT_Grip = 20,
	eSCT_Suitcase = 21,
};

// Size: 0x20
class alignas(8) SDisturbanceSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	int32 m_object; // 0x0
	EDisturbanceType m_type; // 0x4
	ECautiousDisturbanceState m_state; // 0x8
	ZGameTime m_started; // 0x10
	int32 m_pInvestigateGroup; // 0x18
	bool m_bLockOnHitmanPosition; // 0x1C
};

// Size: 0x4
enum class EThrownCollisionSoundLoudness
{
	eLoudness_Default = 0,
	eLoudness_Low = 1,
	eLoudness_Normal = 2,
	eLoudness_Loud = 3,
};

// Size: 0x50
class alignas(8) SInvestigateWeaponGroupSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rTarget; // 0x0
	uint32 m_rReporter; // 0x4
	uint32 m_rInvestigator; // 0x8
	uint32 m_rGuard; // 0xC
	bool m_ReporterIsVIPWithAmbientEscort; // 0x10
	SFSMSaveData m_fsmState; // 0x18
	ZGameTime m_tLastGuardSearch; // 0x30
	TArray<uint32> m_aUnconsciousGuards; // 0x38
};

// Size: 0x4
enum class EGuardPointType
{
	GPT_Hold = 0,
	GPT_Combat = 1,
	GPT_CombatAndHold = 2,
	GPT_VIPSafeRoom = 3,
};

// Size: 0x14
class alignas(4) SAttentionHUDUIElement
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 fAngle; // 0x0
	float32 fAttention; // 0x4
	float32 fAlpha; // 0x8
	float32 fRadius; // 0xC
	int32 nColor; // 0x10
};

// Size: 0x10
class alignas(4) SItemLeftHandUIData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZRuntimeResourceID icon; // 0x0
	int32 nItemHUDType; // 0x8
	bool bHasItemToShow; // 0xC
	bool bSuspicious; // 0xD
	bool bIllegal; // 0xE
};

// Size: 0x10
class alignas(4) SItemOnBackUIData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZRuntimeResourceID icon; // 0x0
	int32 nItemHUDType; // 0x8
	bool bHasItemToShow; // 0xC
	bool bSuspicious; // 0xD
	bool bIllegal; // 0xE
};

// Size: 0xC8
class alignas(8) ZHUDUIControllerEntity_SWeaponViewData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SWeaponStatusUIData weaponStatus; // 0x0
	SItemLeftHandUIData itemLeftHandStatus; // 0xA0
	SItemOnBackUIData itemOnBackStatus; // 0xB0
	bool bShowHolstered; // 0xC0
	int32 nDisplayMode; // 0xC4
};

// Size: 0x4
enum class EUIBusyOperationId
{
	eOperationId_GameSave = 0,
	eOperationId_MenuTransition = 1,
	eOperationId_ManuallyTriggered = 2,
	eOperationId_TriggerBootFlow = 3,
	eOperationId_SaveContract = 4,
	eOperationId_StartContract = 5,
	eOperationId_SessionStart = 6,
	eOperationId_ReportContract = 7,
	eOperationId_ConnectionFlow = 8,
	eOperationId_LoadingTransitionDelayed = 9,
	eOperationId_SaveSuccess = 10,
	eOperationId_SaveFailed = 11,
	eOperationId_SessionReconnect = 12,
	eOperationId_NetSynchedMenuPause = 13,
	eOperationId_NetSynchedMenuRestart = 14,
	eOperationId_NetSynchedMenuReplan = 15,
	eOperationId_StartingMultiplayerSession = 16,
	eOperationId_HandlingMultiplayerRequest = 17,
	eOperationId_PoorConnectivity = 18,
	eOperationId_DefaultLoadout = 19,
	eOperationId_Max = 19,
	eOperationId_Custom_01 = 20,
	eOperationId_Custom_Begin = 20,
	eOperationId_Custom_02 = 21,
	eOperationId_Custom_03 = 22,
	eOperationId_Custom_04 = 23,
	eOperationId_Custom_05 = 24,
	eOperationId_Custom_06 = 25,
	eOperationId_Custom_07 = 26,
	eOperationId_Custom_08 = 27,
	eOperationId_Custom_09 = 28,
	eOperationId_Custom_10 = 29,
	eOperationId_Custom_11 = 30,
	eOperationId_Custom_12 = 31,
	eOperationId_Custom_13 = 32,
	eOperationId_Custom_14 = 33,
	eOperationId_Custom_15 = 34,
	eOperationId_Custom_16 = 35,
	eOperationId_Custom_17 = 36,
	eOperationId_Custom_18 = 37,
	eOperationId_Custom_19 = 38,
	eOperationId_Custom_20 = 39,
	eOperationId_Custom_21 = 40,
	eOperationId_Custom_22 = 41,
	eOperationId_Custom_23 = 42,
	eOperationId_Custom_24 = 43,
	eOperationId_Custom_25 = 44,
	eOperationId_Custom_End = 45,
	eOperationId_None = 46,
};

// Size: 0x4
enum class EInformationBarMessage
{
	eIBM_Clear = 0,
	eIBM_LastEnemyKilledCP = 1,
	eIBM_InvestigateStand = 2,
	eIBM_BodyFound = 3,
	eIBM_Suspicious = 4,
	eIBM_DisguiseBlown = 5,
	eIBM_Hunt = 6,
	eIBM_Exposed = 7,
	eIBM_LandMineArmed = 8,
	eIBM_RadioOn = 9,
	eIBM_Trespassing = 10,
	eIBM_NUM = 11,
};

// Size: 0x4
enum class EEngineFrameUpdatePriority
{
	eFUP_AILogger = 0,
	eFUP_GridManager = 1,
	eFrameUpdatePriority_HitmanStart = 2,
	eFUP_ActorManager_Prepare = 3,
	eFrameUpdatePriority_CrowdSyncAI = 4,
	eFrameUpdatePriority_PlayerCommunicationEarly = 5,
	eFrameUpdatePriority_Scatter = 6,
	eFrameUpdatePriority_VolumeTriggerManager = 7,
	eFrameUpdatePriority_DistanceToCamManager = 8,
	eFrameUpdatePriority_Door = 9,
	eFUP_GameEntityManager = 10,
	eFrameUpdatePriority_AreaManager = 11,
	eFrameUpdatePriority_SpeechManager = 12,
	eFUP_SmoothOperator = 13,
	eFUP_LimitedVisionArea = 14,
	eFUP_WindManager = 15,
	eFrameUpdatePriority_KeywordDebug = 16,
	eFUP_DebugUPlot = 17,
	eFUP_IntelManager = 18,
	eFrameUpdatePriority_LocalizationManager = 19,
	eFrameUpdatePriority_SubtitleManager = 20,
	eFrameUpdatePriority_HttpManager = 21,
	eFrameUpdatePriority_WebsocketManager = 22,
	eFrameUpdatePriority_OnlineEventsClient = 23,
	eFrameUpdatePriority_OnlineEventManager = 24,
	eFrameUpdatePriority_OnlineManager = 25,
	eFrameUpdatePriority_EntitlementManager = 26,
	eFrameUpdatePriority_MetricsManager = 27,
	eFUP_SoundGateManager = 28,
	eFUP_SoundAmbienceManager = 29,
	eFrameUpdatePriority_UserProfileManager = 30,
	eFrameUpdatePriority_RenderManager = 31,
	eFrameUpdatePriority_TextInputDialog = 32,
	eFrameUpdatePriority_SystemDialog = 33,
	eFrameUpdatePriority_ContractsManager = 34,
	eFUP_ParticleHeirEmitting = 35,
	eFrameUpdatePriority_EditorServer = 36,
	eFrameUpdatePriority_DebugConsole = 37,
	eFrameUpdatePriority_GraphicsSettingsManager = 38,
	eFrameUpdatePriority_ContractsGameManager = 39,
	eFrameUpdatePriority_Weapon = 40,
	eFrameUpdatePriority_CrowdDensityEntity = 41,
	eFrameUpdatePriority_ActBehaviorStateCondition = 42,
	eFrameUpdatePriority_ActorCanSeeCondition = 43,
	eFrameUpdatePriority_DebugCheckKey = 44,
	eFrameUpdatePriority_KeyControl = 45,
	eFUP_LookAtTrigger = 46,
	eFUP_FootstepEventConsumer = 47,
	eFUP_BloodSplatCreator = 48,
	eFrameUpdatePriority_PersistentEntityManager = 49,
	eFUP_ProjectedCrowdRegion = 50,
	eFrameUpdatePriority_Timers = 51,
	eFrameUpdatePriority_ConditionalTimer = 52,
	eFrameUpdatePriority_ValueEntityManager = 53,
	eFrameUpdatePriority_ActorCounter = 54,
	eFrameUpdatePriority_WaveformGeneratorManager = 55,
	eFUP_ItsATrap = 56,
	eFrameUpdatePriority_SecurityCamera = 57,
	eFrameUpdatePriority_QueryingAIOutput = 58,
	eFrameUpdatePriority_Projectile = 59,
	eFrameUpdatePriority_MassImpulseCharacterExploder = 60,
	eFrameUpdatePriority_Hitman = 61,
	eFrameUpdatePriority_AudioManagerWwise = 62,
	eFUP_GridManagerWaitForJobs = 63,
	eFUP_ActorManager_StateUpdate_Pre = 64,
	eFUP_ActorManager_StateUpdate = 65,
	eFrameUpdatePriority_ActorAnimUpdate = 66,
	eFrameUpdatePriority_CrowdSyncAll = 67,
	eFrameUpdatePriority_CrowdCulling = 68,
	eFrameUpdatePriority_PreCrowd = 69,
	eFrameUpdatePriority_Crowd = 70,
	eFrameUpdatePriority_PhysicsStart = 71,
	eFrameUpdatePriority_ActorManager_AIUpdate = 72,
	eFUP_SmuggleSituationManager = 73,
	eFrameUpdatePriority_ActorManager3 = 74,
	eFrameUpdatePriority_CharacterTemplateAspect = 75,
	eFrameUpdatePriority_Hitman2 = 76,
	eFrameUpdatePriority_PlayerCommunicationLate = 77,
	eFrameUpdatePriority_ParticleDecalSpawn = 78,
	eFrameUpdatePriority_ParticleColliderEmission = 79,
	eFrameUpdatePriority_Physics = 80,
	eFrameUpdatePriority_EntityManager = 81,
	eFrameUpdatePriority_FreeCameraControlEntity = 82,
	eFrameUpdatePriority_RenderVideoPlayer = 83,
	eFrameUpdatePriority_AnimPlayerEntityManager = 84,
	eFrameUpdatePriority_CameraAlignedBoneAnimator = 85,
	eFrameUpdatePriority_ClothCharacterEntity = 86,
	eFrameUpdatePriority_TextureStreamingCameraControlEntity = 87,
	eFrameUpdatePriority_PostFilter = 88,
	eFrameUpdatePriority_VideoPlayerControl = 89,
	eFrameUpdatePriority_TrackDollyController = 90,
	eFrameUpdatePriority_TestGroup = 91,
	eFrameUpdatePriority_LookAtEntity = 92,
	eFUP_InfoDisplay = 93,
	eFUP_CrowdPossedAct = 94,
	eFUP_SoundCollisionManager = 95,
	eFUP_AudioLevelMeter = 96,
	eFUP_ActorInstanceEntityManager = 97,
	eFUP_WorldInventory = 98,
	eFUP_DestructionSystem = 99,
	eFUP_DestructionSystemPostTick = 100,
	eFUP_DecalSpawnManager = 101,
	eFrameUpdatePriority_DebugHandlers = 102,
	eFrameUpdatePriority_OSD = 103,
	eFrameUpdatePriority_Default = 104,
	eFrameUpdatePriority_SecuritySystemCameraUI = 105,
	eFrameUpdatePriority_ThrownItemUI = 106,
	eFrameUpdatePriority_SequenceManager = 107,
	eFrameUpdatePriority_VisibilitySensorWait = 108,
	eFrameUpdatePriority_ActionManagerStart = 109,
	eFrameUpdatePriority_PathFinderJobManager = 110,
	eFrameUpdateLinkedEntity = 200,
	eFrameUpdatePriority_RayProbeEntity = 201,
	eFrameUpdatePriority_GhostEntity = 202,
	eFrameUpdateLinkedEntityManagerMainThread = 203,
	eFUP_syncDestructionEffects = 204,
	eFrameUpdatePriority_RaycastsStart = 205,
	eFrameUpdatePriority_ActorStartNetworkUpdate = 206,
	eFrameUpdatePriority_TextureManager = 500,
	eFrameUpdatePriority_NotificationsController = 501,
	eFUP_Pathfinder = 502,
	eFrameUpdatePriority_LevelManager = 1000,
	eFrameUpdatePriority_OutfitStreamingManager = 1001,
};

// Size: 0x8
class alignas(4) SGameCamProfileEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bIsEnabled; // 0x0
	uint32 m_rHero; // 0x4
};

// Size: 0x20
class alignas(8) SEntityTemplateReference
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint64 entityID; // 0x0
	int32 externalSceneIndex; // 0x8
	int32 entityIndex; // 0xC
	ZString exposedEntity; // 0x10
};

// Size: 0x30
class alignas(8) SEntityTemplateExposedEntity
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString sName; // 0x0
	bool bIsArray; // 0x10
	TArray<SEntityTemplateReference> aTargets; // 0x18
};

// Size: 0x4
enum class ESniperScoreMessageType
{
	ESSMT_STYLE_DEFAULT = 0,
	ESSMT_STYLE_SCORE = 1,
	ESSMT_STYLE_PENALTY = 2,
	ESSMT_STYLE_STREAK = 3,
	ESSMT_STYLE_CIVKILL = 4,
};

// Size: 0x4
enum class ZHttpUrl_EVerb
{
	eNONE = 0,
	eGET = 1,
	ePOST = 2,
	ePUT = 3,
	eHEAD = 4,
};

// Size: 0x4
enum class ESmoothingMode
{
	ESM_LINEAR = 0,
	ESM_EXPONENTIAL = 1,
};

// Size: 0x2
class alignas(1) SLightFlickerEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bLightOn; // 0x0
	bool m_bFlickerOn; // 0x1
};

// Size: 0x4
enum class ZActorPickerEffectTemplate_EEffectPhaseAction
{
	EPA_NONE = 0,
	EPA_START_TEMPLATE = 1,
	EPA_STOP_TEMPLATE = 2,
};

// Size: 0x4
enum class EActorAIDot
{
	eAAID_None = 0,
	eAAID_Distracted = 1,
	eAAID_PotentialThreat = 2,
	eAAID_PotentialThreatDistracted = 3,
	eAAID_Aggressive = 4,
	eAAID_EscortingOut = 5,
	eAAID_Fleeing = 6,
	eAAID_Unconscious = 7,
	eAAID_Stunned = 8,
	eAAID_Grenade = 9,
	eAAID_PotentialThreatDisabled = 100,
};

// Size: 0x10
class alignas(4) SColorRGBA
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 r; // 0x0
	float32 g; // 0x4
	float32 b; // 0x8
	float32 a; // 0xC
};

// Size: 0x24
class alignas(4) SMathLerpSaveData_SColorRGBA
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SColorRGBA m_A; // 0x0
	SColorRGBA m_B; // 0x10
	float32 m_fT; // 0x20
};

// Size: 0x30
class alignas(8) SMathLerpsSaveData_SColorRGBA
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<uint32> m_aEntities; // 0x0
	TArray<SMathLerpSaveData_SColorRGBA> m_aData; // 0x18
};

// Size: 0x4
enum class ZDecalControllerEntity_EScaleType
{
	eScaleDisable = 0,
	eScaleUniform = 1,
	eScaleY = 2,
};

// Size: 0x20
class alignas(8) STestStruct
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString stringField; // 0x0
	uint32 intField; // 0x10
	float32 floatField; // 0x14
	STestStruct_ETestEnum enumField; // 0x18
};

// Size: 0x28
class alignas(8) STestStruct2
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<STestStruct> arrayField; // 0x0
	ZVariant variantField; // 0x18
};

// Size: 0x4
enum class ZSequenceEntity_ECommand
{
	COMMAND_START = 0,
	COMMAND_ENABLE_PREVIEW = 1,
	COMMAND_STOP = 2,
	COMMAND_DISABLE_PREVIEW = 3,
	COMMAND_ABORT = 4,
	COMMAND_PAUSE = 5,
	COMMAND_UNPAUSE = 6,
	COMMAND_SETTIME = 7,
	COMMAND_SKIPTOEND = 8,
	COMMAND_GAME_PAUSE = 9,
	COMMAND_GAME_UNPAUSE = 10,
	COMMAND_PREVIEW_PAUSE = 11,
	COMMAND_PREVIEW_STOP = 12,
	COMMAND_PREVIEW_PLAY = 13,
	COMMAND_PREVIEW_LOOPED = 14,
	COMMAND_CLEAR = 15,
};

// Size: 0x4
enum class ZUIControlEntity_EAlignmentType
{
	E_ALIGNMENT_TYPE_Center = 0,
	E_ALIGNMENT_TYPE_TopCenter = 1,
	E_ALIGNMENT_TYPE_BottomCenter = 2,
	E_ALIGNMENT_TYPE_CenterLeft = 3,
	E_ALIGNMENT_TYPE_CenterRight = 4,
	E_ALIGNMENT_TYPE_TopLeft = 5,
	E_ALIGNMENT_TYPE_TopRight = 6,
	E_ALIGNMENT_TYPE_BottomLeft = 7,
	E_ALIGNMENT_TYPE_BottomRight = 8,
};

// Size: 0x4
enum class ZEscortSituationEntity_EEscortState
{
	EES_Idle = 0,
	EES_Evaluate = 1,
	EES_Escorting = 2,
	EES_Searching = 3,
	EES_Intermediate = 4,
};

// Size: 0x58
class alignas(8) SFriskSuspectGroupSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SFSMSaveData m_fsmState; // 0x0
	bool m_bHitmanIsGuard; // 0x18
	int32 m_target; // 0x1C
	uint32 m_pLeader; // 0x20
	uint32 m_pAssistant; // 0x24
	ZFriskSuspectGroup_EAssistantState m_eAssistantState; // 0x28
	EDisturbanceType m_eDisturbanceType; // 0x2C
	ZFriskSuspectGroup_EHitmanGreetState m_eHitmanGreetState; // 0x30
	ZGameTime m_tHitmanGreet; // 0x38
	float32 m_fMovingTime; // 0x40
	float32 m_fRunningTime; // 0x44
	ZGameTime m_tWaitToComplyTime; // 0x48
	bool m_bWarnOnWeaponFound; // 0x50
	bool m_bWeaponFound; // 0x51
	bool m_bMoveWarning; // 0x52
	bool m_bFirskRequestRepeated; // 0x53
};

// Size: 0x4
enum class SniperControllerConditionType
{
	SCCT_Enabled = 0,
	SCCT_PrecisionAim = 1,
};

// Size: 0x20
class alignas(8) STypeReference
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString sEntityID; // 0x0
	ZString sTypeArgName; // 0x10
};

// Size: 0x50
class alignas(8) SExposedTypeInfo
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString sName; // 0x0
	ZString sDisplayName; // 0x10
	ZString sHelpText; // 0x20
	STypeReference target; // 0x30
};

// Size: 0x4
enum class ZActorInstanceEntity_EFFXMode
{
	eFFX_MODE_DISABLE = 0,
	eFFX_MODE_OVERWRITE = 1,
};

// Size: 0x4
enum class EMapType
{
	E_MAPTYPE_Minimap = 0,
	E_MAPTYPE_MainMap = 1,
	E_MAPTYPE_MenuMap = 2,
};

// Size: 0x4
enum class CrowdUtil_ECrowdFacing
{
	FRONT = 0,
	BACK = 1,
};

// Size: 0x30
class alignas(16) SDynamicEnforcerCandidateSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
	float4 m_vPosition; // 0x10
	EAISharedEventType m_eType; // 0x20
	float32 m_fRadius; // 0x24
};

// Size: 0x18
class alignas(8) SDynamicEnforcerServiceSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SDynamicEnforcerCandidateSaveData> m_aCandidates; // 0x0
};

// Size: 0x4
enum class EKeywordSetBehavior
{
	EKWSB_All = 0,
	EKWSB_None = 1,
	EKWSB_Any = 2,
	EKWSB_No = 3,
};

// Size: 0x4
class alignas(4) SActorStandInSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
};

// Size: 0x4
enum class eItemRarity
{
	ITEMRARITY_COMMON = 0,
	ITEMRARITY_UNCOMMON = 1,
	ITEMRARITY_RARE = 2,
};

// Size: 0x3
class alignas(1) SDynamicRayCastEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bEnabled; // 0x0
	bool m_bIsRayIntersecting; // 0x1
	bool m_bIsCurrentlyEnabled; // 0x2
};

// Size: 0x4
enum class eHolsterAbility
{
	eUndecided = 0,
	eHolsteringAllowed = 1,
	eHolsterTemporarilyOnly = 2,
	eHolsterSecondaryOnly = 3,
	eHolsterQuestStorage = 4,
	eCanNotBeHolstered = 5,
};

// Size: 0x4
enum class EPlaceableType
{
	PLACEABLE_NOT = 0,
	PLACEABLE_FULL_PHYSICS = 1,
	PLACEABLE_SLEEP_PHYSICS = 2,
	PLACEABLE_NO_PHYSICS = 3,
	PLACEABLE_ATTACH = 4,
};

// Size: 0x18
class alignas(8) ZRuntimePinConDesc
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint64 m_nFromEntityID; // 0x0
	uint64 m_nToEntityID; // 0x8
	uint32 m_nFromPinID; // 0x10
	uint32 m_nToPinID; // 0x14
};

// Size: 0x4
enum class EMoveEndState
{
	MES_Moving = 0,
	MES_Stopping = 1,
	MES_Standing = 2,
};

// Size: 0x4
enum class ELastSoundTension
{
	EST_Unknown = 0,
	EST_Ambient = 1,
	EST_Yellow = 2,
	EST_Orange = 3,
	EST_Red = 4,
};

// Size: 0xC
class alignas(4) SColorRGB
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	float32 r; // 0x0
	float32 g; // 0x4
	float32 b; // 0x8
};

// Size: 0x88
class alignas(4) SPostfilterParametersSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rEntity; // 0x0
	bool m_bDepthOfFieldEnabled; // 0x4
	float32 m_fDepthOfFieldBlurriness; // 0x8
	bool m_bRadialBlurEnabled; // 0xC
	float32 m_fRadialBlurriness; // 0x10
	SVector2 m_vRadialBlurCenter; // 0x14
	float32 m_fRadialBlurStart; // 0x1C
	bool m_bSpatialBlurEnabled; // 0x20
	float32 m_fSpatialBlurriness; // 0x24
	SVector3 m_vSpatialBlurCenter; // 0x28
	float32 m_fSpatialBlurStart; // 0x34
	float32 m_fSpatialBlurFade; // 0x38
	bool m_bDistortionWobbleEnabled; // 0x3C
	float32 m_fDistortionWobbleScale; // 0x40
	SVector2 m_vDistortionWobbleWaveLength; // 0x44
	SVector2 m_vDistortionWobbleSpeed; // 0x4C
	bool m_bDistortionWobbleUseRealTime; // 0x54
	bool m_bHDRActive; // 0x55
	bool m_bHDREnabled; // 0x56
	SVector2 m_vHDRAdaptationSpeed; // 0x58
	SVector2 m_vHDRAdaptationLuminanceMinMax; // 0x60
	SVector2 m_vHDRAdaptationMiddleGrayMinMax; // 0x68
	float32 m_fHDRWhitePoint; // 0x70
	float32 m_fHDRBrightPassThreshold; // 0x74
	float32 m_fHDRBrightPassMaxPercentage; // 0x78
	SColorRGB m_HDRColorTint; // 0x7C
};

// Size: 0x4
enum class ZSequenceEntity_ELetterBoxAspect
{
	LETTERBOXASPECT_WIDESCREEN = 0,
	LETTERBOXASPECT_CINEMASCOPE = 1,
};

// Size: 0x4
enum class ELedgeDismountDirection
{
	eLDD_DontCare = 0,
	eLDD_FaceLedge = 1,
	eLDD_FaceLeft = 2,
	eLDD_FaceRight = 3,
	eLDD_Turn180 = 4,
};

// Size: 0x4
enum class ZHM5BodyContainer_EBCAnimSet
{
	BC_CONTAINER_STANDARD = 0,
	BC_CONTAINER_WOODCHIPPER = 1,
	BC_CAR_STANDARD_TRUNK = 2,
	BC_CONTAINER_CLOSET = 3,
	BC_CONTAINER_LAUNDRYCHUTE = 4,
};

// Size: 0x8
class alignas(4) SValueBoolDelayedEntitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bValue; // 0x0
	bool m_bWaitingValue; // 0x1
	float32 m_fTimeToNextEvent; // 0x4
};

// Size: 0x18
class alignas(8) AI_Private_SStimulusSnapshot
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 SlotIndex; // 0x0
	ZString StimulusData; // 0x8
};

// Size: 0x4
enum class ZWaypointEntity_EMovementType
{
	MT_WALK = 0,
	MT_WALK_IF_NOT_IN_SEQUENCE = 1,
	MT_SNAP = 2,
	MT_IGNORE_POSITION = 3,
};

// Size: 0x4
enum class EInventoryStorageType
{
	EIST_None = 0,
	EIST_Bag = 1,
	EIST_RightHand = 2,
	EIST_LeftHand = 3,
	EIST_Back = 4,
	EIST_Support = 5,
	EIST_Quest = 6,
	EIST_Temporary = 7,
	EIST_Debug = 8,
};

// Size: 0x4
enum class EDialogEventEndReason
{
	EDialogEvent_Completed = 0,
	EDialogEvent_Stopped = 1,
};

// Size: 0x4
enum class ECameraOffset_old
{
	eCameraOffset_Center = 0,
	eCameraOffset_Left = 1,
	eCameraOffset_Right = 2,
};

// Size: 0x18
class alignas(4) SMovementAgilitySaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rLedgeGuide; // 0x0
	float32 m_fFaceLeftRightTarget; // 0x4
	EAgilityState m_ePrevAgilityState; // 0x8
	EAgilityState m_eAgilityState; // 0xC
	uint32 m_nActiveAnimNode; // 0x10
	ECameraOffset_old m_eCameraOffset; // 0x14
};

// Size: 0x1
enum class EDefaultCollidableLayer
{
	DCL_STATIC = 0,
	DCL_KINEMATIC = 1,
	DCL_KINEMATIC_TRANSPARENT = 2,
	DCL_DYNAMIC = 3,
	DCL_DYNAMIC_TRANSPARENT = 4,
	DCL_COLLIDE_ALL = 5,
	DCL_STATIC_TRANSPARENT = 6,
	DCL_COLLIDE_STATIC_ONLY = 7,
	DCL_DYNAMIC_NO_CHARACTER = 8,
	DCL_UNUSED_LAST = 9,
};

// Size: 0x4
enum class eItemHands
{
	IH_NONE = 0,
	IH_ONEHANDED = 1,
	IH_TWOHANDED = 2,
};

// Size: 0x4
enum class ZActorProviderFilterKeyword_EEvaluationType
{
	ALL = 0,
	NONE = 1,
	ANY = 2,
};

// Size: 0x4
enum class ZHUDUIRoot_EHUDVisibility
{
	eHV_INSTANT_OFF = 0,
	eHV_FADE_OUT = 1,
	eHV_FADE_IN = 2,
	eHV_INSTANT_ON = 3,
};

// Size: 0x18
class alignas(8) SActorManagerReferencableData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<ESituationType> m_aSituationTypes; // 0x0
};

// Size: 0x4
class alignas(2) SClothVertex
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint16 m_nColumn; // 0x0
	uint16 m_nRow; // 0x2
};

// Size: 0x4
enum class EKillType
{
	EKillType_Undefined = 0,
	EKillType_Throw = 1,
	EKillType_Fiberwire = 2,
	EKillType_PistolExecute = 3,
	EKillType_ItemTakeOutFront = 4,
	EKillType_ItemTakeOutBack = 5,
	EKillType_ChokeOut = 6,
	EKillType_SnapNeck = 7,
	EKillType_KnockOut = 8,
	EKillType_Push = 9,
	EKillType_Pull = 10,
};

// Size: 0x4
enum class EHUDIconType
{
	HUD_ICON_NONE = 0,
	HUD_ICON_ALARM_TIMER = 1,
	HUD_ICON_CLOSECOMBAT = 2,
	HUD_ICON_BREADCRUMB = 3,
	HUD_ICON_EXIT = 4,
	HUD_ICON_OBJECTIVE = 5,
	HUD_ICON_TARGET = 6,
	HUD_ICON_TUTORIAL_ARROW = 7,
};

// Size: 0x4
enum class ECharacterActionSyncRequests
{
	eSM_ASR_Reload = 1,
	eSM_ASR_SwapItemHandL = 2,
	eSM_ASR_SwapItemHandR = 4,
};

// Size: 0x4
enum class EActBodyType
{
	ABT_UpperBodyOnly = 0,
	ABT_FullBodyWithLeadIn = 1,
	ABT_FullBodyOnly = 2,
};

// Size: 0x4
enum class ZInvestigateCautiousSituation_ESituationState
{
	SS_Main = 0,
	SS_StandDownPending = 1,
	SS_StandDown = 2,
};

// Size: 0x40
class alignas(16) SSituationOrderSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZString m_sClassTypeName; // 0x0
	EAISharedEventType m_eType; // 0x10
	int32 m_nTarget; // 0x14
	bool m_bHasPosition; // 0x18
	float4 m_vPosition; // 0x20
	ZVariant m_CustomData; // 0x30
};

// Size: 0x4
class alignas(4) SEscortSituation2Actors
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
};

// Size: 0x98
class alignas(8) SEscortSituation2SaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	bool m_bActivated; // 0x0
	bool m_bMayEscort; // 0x1
	bool m_bTargetDead; // 0x2
	bool m_bTargetInRange; // 0x3
	bool m_bAllEscortsAreDead; // 0x4
	bool m_bForceSearch; // 0x5
	SVector3 m_vLastPosition; // 0x8
	bool m_bFoundDeadTarget; // 0x14
	int64 m_nTargetDeadTime; // 0x18
	bool m_bTargetIsMoving; // 0x20
	ZEscortSituation2Entity_ETargetState m_eTargetState; // 0x24
	EActorEmotionState m_eTargetEmotionState; // 0x28
	ZActBehaviorEntity_EState m_eTargetActState; // 0x2C
	float32 m_fTargetNotMovingTime; // 0x30
	float32 m_fTargetAgitationCooldownTimer; // 0x34
	TArray<SEscortSituation2Actors> m_aAddedActors; // 0x38
	TArray<SEscortSituation2ActorStateSaveData> m_aStates; // 0x50
	TArray<uint32> m_aEscortActs; // 0x68
	TArray<uint32> m_aSearchActs; // 0x80
};

// Size: 0x4
enum class EOpportunityRevealState
{
	ORS_REVEALING = 1,
	ORS_HINT = 2,
	ORS_DISTANCE = 4,
	ORS_RANGE_FLAGS = 6,
	ORS_REVEALED = 8,
	ORS_REVEAL_FLAGS = 9,
	ORS_BYPASS_MENU = 16,
};

// Size: 0x38
class alignas(8) SDeadBodyInfoSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rActor; // 0x0
	uint32 m_rGuard; // 0x4
	TArray<uint32> m_knownByActors; // 0x8
	ZGameTime m_tKnownSince; // 0x20
	ZGameTime m_tInvestigatedSince; // 0x28
	bool m_bGuarded; // 0x30
	bool m_bBodyInvestigated; // 0x31
	bool m_bHidden; // 0x32
	bool m_bDeadByAccident; // 0x33
	bool m_bDeadByUnnoticed; // 0x34
	bool m_bHitmanSuspectedInCurrentOutfit; // 0x35
	bool m_bDeadByExplosion; // 0x36
	bool m_IsFoundOutsideNavmeshAndIgnored; // 0x37
};

// Size: 0x20
class alignas(8) SDeadBodySensorSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SDeadBodyInfoSaveData> m_aBodies; // 0x0
	int32 m_nBodyIndex; // 0x18
};

// Size: 0x4
enum class EGSBodyPart
{
	GSBODYPART_UNKNOWN = 0,
	GSBODYPART_HEAD = 1,
	GSBODYPART_TORSO = 2,
	GSBODYPART_ARM = 3,
	GSBODYPART_LEG = 4,
};

// Size: 0x4
enum class EActorSecondaryIconState
{
	eSIS_Clear = 0,
	eSIS_Infected = 1,
	eSIS_Infected_Stage1 = 2,
	eSIS_Infected_Stage2 = 3,
	eSIS_Infected_Stage3 = 4,
};

// Size: 0x10
class alignas(4) SCheckLastPositionGroupSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_pLeader; // 0x0
	uint32 m_pAssistant; // 0x4
	uint16 m_nLeaderTargetNodeIndex; // 0x8
	bool m_bLeaderOrderAssigned; // 0xA
	bool m_bAssistantOrderAssigned; // 0xB
	bool m_bSearchCompleted; // 0xC
};

// Size: 0x4
enum class ZInputListenerAxisEntity_eInputListenerAxes
{
	EILA_HORIZONTAL = 0,
	EILA_VERTICAL = 1,
	EILA_TRIGGER_1 = 2,
	EILA_TRIGGER_2 = 3,
};

// Size: 0x40
class alignas(8) SItemInstanceSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	ZRepositoryID m_repositoryId; // 0x0
	uint64 m_nEntityID; // 0x10
	ZString m_sOnlineInstanceId; // 0x18
	TArray<ZRepositoryID> m_aItemModifierIds; // 0x28
};

// Size: 0x18
class alignas(8) SWorldInventoryInstanceSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	TArray<SItemInstanceSaveData> m_aItemInstanceSaveData; // 0x0
};

// Size: 0x4
enum class EActorEventTypes
{
	eAET_OnAlive = 0,
	eAET_OnPacified = 1,
	eAET_OnMurdered = 2,
	eAET_OnAccidentDeath = 3,
	eAET_OnUnnoticableKill = 4,
	eAET_OnBodyNoticed = 5,
	eAET_OnBodyBagged = 6,
	eAET_OnDying = 7,
	eAET_OnDead = 8,
	eAET_OnBodyHidden = 9,
	eAET_OnBodyFlushed = 10,
	eAET_OnBodyDumped = 11,
	eAET_OnDelete = 12,
};

// Size: 0x4
enum class EMultiplayerNetworkState
{
	Base = 0,
	Idle = 1,
	Searching = 2,
	Connecting = 3,
	Joining = 4,
	Creating = 5,
	Connected = 6,
	Disconnecting = 7,
	Count = 8,
};

// Size: 0x4
enum class EBoolCheckType
{
	eBCT_IGNORE = 0,
	eBCT_TRUE = 1,
	eBCT_FALSE = 2,
};

// Size: 0x4
enum class EActorFaction
{
	eActorFaction_Default = 0,
	eActorFaction_VIP_1 = 1,
	eActorFaction_VIP_2 = 2,
	eActorFaction_VIP_3 = 3,
	eActorFaction_VIP_4 = 4,
	eActorFaction_VIP_5 = 5,
	eActorFaction_VIP_6 = 6,
	eActorFaction_VIP_7 = 7,
};

// Size: 0x1
enum class SoundPlayState
{
	ePlaying = 0,
	eLoopBreaking = 1,
	eStopping = 2,
};

// Size: 0x4
enum class EPushNotificationType
{
	PUSH_NOTIFICATION_OBJECTIVE = 0,
	PUSH_NOTIFICATION_DISGUISE = 1,
	PUSH_NOTIFICATION_CONTRACT = 2,
	PUSH_NOTIFICATION_CHALLENGE = 3,
	PUSH_NOTIFICATION_RATING = 4,
	PUSH_NOTIFICATION_SPECIAL_RATING_UNLOCKED = 5,
	PUSH_NOTIFICATION_CONTRACT_PICKED_UP = 6,
	PUSH_NOTIFICATION_TECHNIQUE_UNLOCKED = 7,
	PUSH_NOTIFICATION_SCORE_COMPARISON = 8,
};

// Size: 0x4
enum class ECausalGraphTraversal
{
	eCGT_NONE = 0,
	eCGT_INPUT = 1,
	eCGT_OUTPUT = 2,
	eCGT_BOTH = 3,
};

// Size: 0x4
enum class ZCharacterSpeakCondition_EState
{
	Started = 0,
	Playing = 1,
	PlayingAndAudible = 2,
	Completed = 3,
	SubsSeenAndCompleted = 4,
	Failed = 5,
	Stopped = 6,
};

// Size: 0x30
class alignas(8) SEvacuateTrespassGroupSaveData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	SFSMSaveData m_fsmState; // 0x0
	int32 m_target; // 0x18
	uint32 m_safeRoomNode; // 0x1C
	uint32 m_leader; // 0x20
	uint32 m_assistant; // 0x24
	bool m_escalate; // 0x28
	bool m_completed; // 0x29
	bool m_standDown; // 0x2A
	int32 m_warningCount; // 0x2C
};

// Size: 0x4
enum class EInventoryConfigFormerEquippedItems
{
	EICFEI_Equip = 0,
	EICFEI_EquipOrPickup = 1,
	EICFEI_Forget = 2,
};

// Size: 0x4
enum class EDamageResponse
{
	eDR_Fractured = 0,
	eDR_Detached = 1,
	eDR_Destroyed = 2,
	eDR_Collided = 3,
	eDR_Count = 4,
};

// Size: 0x4
enum class IHM5Door_EOpenDir
{
	OD_AWAY = 0,
	OD_TOWARS = 1,
	OD_IN = 2,
	OD_OUT = 3,
};

// Size: 0x4
enum class ESituationJoinReason
{
	AISJR_Default = 0,
	AISJR_HeardSound = 1,
	AISJR_Alarm = 2,
	AISJR_HitmanStrange = 3,
	AISJR_HitmanIllegal = 4,
	AISJR_Assist = 5,
	AISJR_AssistingGuard = 6,
	AISJR_Propagate = 7,
	AISJR_ResumeSituation = 8,
	AISJR_Spawned = 9,
	AISJR_HelpCivilian = 10,
	AISJR_Escalating = 11,
	AISJR_DeadBody = 12,
	AISJR_Accident = 13,
	AISJR_StandDown = 14,
	AISJR_Report = 15,
	AISJR_ForcedToHold = 16,
	AISJR_Wounded = 17,
	AISJR_SC_HeardBulletImpact = 18,
	AISJR_SC_HeardSetPiece = 19,
};

// Size: 0x4
enum class UIMapLayer_EUIMapLayerID
{
	eUIMLI_UNSPECIFIED = 0,
	eUIMLI_STAIRCASE = 1,
	eUIMLI_AREA_UNDISCOVERED = 2,
	eUIMLI_TEXT = 3,
	eUIMLI_DROPPED_ITEMS_AND_DISGUISES = 4,
	eUIMLI_NPC = 5,
	eUIMLI_NORTH_INDICATOR = 6,
	eUIMLI_SECURITY_CAMERA = 7,
	eUIMLI_AGENCY_PICKUP = 8,
	eUIMLI_OPPORTUNITY = 9,
	eUIMLI_EXIT = 10,
	eUIMLI_OBJECTIVE = 11,
	eUIMLI_TARGET = 12,
	eUIMLI_OPPONENT = 13,
	eUIMLI_HERO = 14,
};

// Size: 0x8
class alignas(0) IHumanBody
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

};

// Size: 0x4
enum class EScreenplayStateFlag
{
	eSSF_DEFAULT = 0,
	eSSF_ENABLED = 1,
	eSSF_CAST = 2,
	eSSF_RESUMING = 4,
	eSSF_RUNNING = 8,
	eSSF_DONE = 16,
	eSSF_TERMINATED = 32,
};

// Size: 0x4
enum class ENetPlayerEvent
{
	Login = 0,
	Logout = 1,
	NewHost = 2,
};

// Size: 0x8
class alignas(4) SHeroCameraStandInSaveState
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteJson(void* p_Object, std::ostream& p_Stream);
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, uintptr_t p_OwnOffset);

	uint32 m_rHero; // 0x0
	bool m_bPaused; // 0x4
};

// Size: 0x4
enum class ZCoverPlane_ECoverType
{
	eCoverOnly = 0,
	eCoverAndRail = 1,
	eRailOnly = 2,
};

// Size: 0x4
enum class EInteractionIndicatorType
{
	EIITYPE_STANDARD = 0,
	EIITYPE_INTERRUPTABLE = 1,
};

// Size: 0x2
class alignas(1) SVolumeTriggerListenerSaveData
{
