/*
 * WARNING: This file is automatically generated. DO NOT MODIFY unless you know what you're doing.
 *
 * If you wish to regenerate this file because of a game update use the ZHMTools CodeGen tool:
 * https://github.com/OrfeasZ/ZHMTools/releases
 */

#pragma once

#include <ZHM/ZHMPrimitives.h>
#include <ZHM/ZHMTypeInfo.h>

class ZHMTypeInfo;

#pragma pack(push, 1)

namespace AnimationEventDataTypes {
	// Size: 0x4
	class /*alignas(4)*/ SBlend	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SBlend& p_Other) const;
		bool operator!=(const SBlend& p_Other) const { return !(*this == p_Other); }

		float32 m_fBlendTime; // 0x0
	};

	// Size: 0x4
	class /*alignas(4)*/ SLegacy	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SLegacy& p_Other) const;
		bool operator!=(const SLegacy& p_Other) const { return !(*this == p_Other); }

		int32 m_nEventID; // 0x0
	};

}

// Size: 0x8
class /*alignas(4)*/ ZRuntimeResourceID{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZRuntimeResourceID& p_Other) const;
	bool operator!=(const ZRuntimeResourceID& p_Other) const { return !(*this == p_Other); }

	uint32 m_IDHigh; // 0x0
	uint32 m_IDLow; // 0x4
};

namespace AnimationTakeDataTypes {
	// Size: 0xC
	class /*alignas(4)*/ SGeneric	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SGeneric& p_Other) const;
		bool operator!=(const SGeneric& p_Other) const { return !(*this == p_Other); }

		float32 m_fTest; // 0x0
		ZRuntimeResourceID m_fResourceTest; // 0x4
	};

}

// Size: 0x1
enum class AudioBusFlags : int8_t
{
	AudioBus_Master = 1,
	AudioBus_Primary = 2,
};

// Size: 0x1
enum class AudioCurve : int8_t
{
	AudioCurve_Log3 = 0,
	AudioCurve_Sine = 1,
	AudioCurve_Log1 = 2,
	AudioCurve_InvSCurve = 3,
	AudioCurve_Linear = 4,
	AudioCurve_SCurve = 5,
	AudioCurve_Exp1 = 6,
	AudioCurve_SineRecip = 7,
	AudioCurve_Exp3 = 8,
	AudioCurve_LastFadeCurve = 9,
	AudioCurve_Constant = 10,
};

// Size: 0x1
class /*alignas(1)*/ BoneId{
public:
	// Size: 0x4
	enum class Enum : int32_t
	{
		GROUND = 0,
		PELVIS = 1,
		SPINE = 2,
		SPINE_1 = 3,
		SPINE_2 = 4,
		NECK = 5,
		NECK1 = 6,
		HEAD = 7,
		LEFT_THIGH = 8,
		LEFT_THIGH_TWIST = 9,
		LEFT_THIGH_TWIST1 = 10,
		LEFT_THIGH_TWIST2 = 11,
		LEFT_CALF = 12,
		LEFT_FOOT = 13,
		LEFT_TOE = 14,
		LEFT_TOENUB = 15,
		RIGHT_THIGH = 16,
		RIGHT_THIGH_TWIST = 17,
		RIGHT_THIGH_TWIST1 = 18,
		RIGHT_THIGH_TWIST2 = 19,
		RIGHT_CALF = 20,
		RIGHT_FOOT = 21,
		RIGHT_TOE = 22,
		RIGHT_TOENUB = 23,
		LEFT_CLAVICLE = 24,
		LEFT_UPPER_ARM = 25,
		LEFT_UPPER_ARM_TWIST = 26,
		LEFT_UPPER_ARM_TWIST1 = 27,
		LEFT_UPPER_ARM_TWIST2 = 28,
		LEFT_FOREARM = 29,
		LEFT_FORETWIST = 30,
		LEFT_FORETWIST1 = 31,
		LEFT_FORETWIST2 = 32,
		LEFT_HAND = 33,
		LEFT_FINGER_0 = 34,
		LEFT_FINGER_01 = 35,
		LEFT_FINGER_02 = 36,
		LEFT_FINGER_1 = 37,
		LEFT_FINGER_11 = 38,
		LEFT_FINGER_12 = 39,
		LEFT_FINGER_2 = 40,
		LEFT_FINGER_21 = 41,
		LEFT_FINGER_22 = 42,
		LEFT_FINGER_3 = 43,
		LEFT_FINGER_31 = 44,
		LEFT_FINGER_32 = 45,
		LEFT_FINGER_4 = 46,
		LEFT_FINGER_41 = 47,
		LEFT_FINGER_42 = 48,
		RIGHT_CLAVICLE = 49,
		RIGHT_UPPER_ARM = 50,
		RIGHT_UPPER_ARM_TWIST = 51,
		RIGHT_UPPER_ARM_TWIST1 = 52,
		RIGHT_UPPER_ARM_TWIST2 = 53,
		RIGHT_FOREARM = 54,
		RIGHT_FORETWIST = 55,
		RIGHT_FORETWIST1 = 56,
		RIGHT_FORETWIST2 = 57,
		RIGHT_HAND = 58,
		RIGHT_FINGER_0 = 59,
		RIGHT_FINGER_01 = 60,
		RIGHT_FINGER_02 = 61,
		RIGHT_FINGER_1 = 62,
		RIGHT_FINGER_11 = 63,
		RIGHT_FINGER_12 = 64,
		RIGHT_FINGER_2 = 65,
		RIGHT_FINGER_21 = 66,
		RIGHT_FINGER_22 = 67,
		RIGHT_FINGER_3 = 68,
		RIGHT_FINGER_31 = 69,
		RIGHT_FINGER_32 = 70,
		RIGHT_FINGER_4 = 71,
		RIGHT_FINGER_41 = 72,
		RIGHT_FINGER_42 = 73,
		XTRA_MUS_R_HIP = 74,
		XTRA_MUS_L_HIP = 75,
		RIGHT_HAND_ATTACHER = 76,
		LEFT_HAND_ATTACHER = 77,
		HIP_ATTACHER = 78,
		BACK_ATTACHER = 79,
		FREE_ATTACHER = 80,
		CAMERA_ATTACHER_01 = 81,
		CAMERA_ATTACHER_02 = 82,
		FREE_ATTACHER_PROP_01 = 83,
		FREE_ATTACHER_PROP_02 = 84,
		LEFT_EYE = 85,
		LEFT_EYE_LID = 86,
		RIGHT_EYE = 87,
		RIGHT_EYE_LID = 88,
		LOWER_LIP = 89,
		JAW = 90,
		HOLSTER_ATTACHER = 91,
		LEFT_WRIST_EFFECTOR = 92,
		LEFT_FINGER_0_EFFECTOR = 93,
		LEFT_FINGER_1_EFFECTOR = 94,
		LEFT_FINGER_2_EFFECTOR = 95,
		LEFT_FINGER_3_EFFECTOR = 96,
		LEFT_FINGER_4_EFFECTOR = 97,
		RIGHT_WRIST_EFFECTOR = 98,
		RIGHT_FINGER_0_EFFECTOR = 99,
		RIGHT_FINGER_1_EFFECTOR = 100,
		RIGHT_FINGER_2_EFFECTOR = 101,
		RIGHT_FINGER_3_EFFECTOR = 102,
		RIGHT_FINGER_4_EFFECTOR = 103,
		BONEID_LAST = 104,
	};


public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const BoneId& p_Other) const;
	bool operator!=(const BoneId& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[1] {};
};

namespace CrowdMapImpl {
	// Size: 0x4
	enum class CellFlags : int32_t
	{
		CELLFLAG_RESTRICTED_A = 1,
		CELLFLAG_RESTRICTED_B = 2,
		CELLFLAG_RESTRICTED_C = 4,
		CELLFLAG_WALKABLE = 8,
		CELLFLAG_TELEPORT_IN = 16,
		CELLFLAG_TELEPORT_OUT = 32,
		CELLFLAG_UNUSED = 64,
		CELLFLAG_PANIC_ONLY = 128,
	};

}

// Size: 0x4
enum class CrowdReactionAIEventType : int32_t
{
	CROWDAIEVENT_NONE = 0,
	CROWDAIEVENT_CURIOUS = 1,
	CROWDAIEVENT_ALERTED = 2,
	CROWDAIEVENT_BLAME_FOR_WEAPON = 3,
	CROWDAIEVENT_BLAME_FOR_KILL = 4,
};

// Size: 0x4
enum class CrowdRegionType : int32_t
{
	CROWDSPHERE_NONE = 0,
	CROWDSPHERE_SAFE = 1,
	CROWDSPHERE_POI = 2,
	CROWDSPHERE_AVOID = 3,
	CROWDSPHERE_RELOCATE = 4,
	CROWDSPHERE_STOP = 5,
	CROWDSPHERE_ALERT = 6,
	CROWDSPHERE_SCARE = 7,
	CROWDSPHERE_GETDOWN = 8,
	CROWDSPHERE_DIE = 9,
};

namespace CrowdUtil {
	// Size: 0x4
	enum class ECrowdActorMood : int32_t
	{
		CM_AMBIENT = 0,
		CM_ALERTED = 1,
		CM_SCARED = 2,
		CM_PANICED = 3,
		CM_DEAD = 4,
		CM_DISABLED = 5,
		NUM_ACTOR_MOOD_TYPES = 6,
	};

	// Size: 0x4
	enum class ECrowdDirection : int32_t
	{
		NORTH = 0,
		EAST = 1,
		SOUTH = 2,
		WEST = 3,
	};

	// Size: 0x4
	enum class ECrowdFacing : int32_t
	{
		FRONT = 0,
		BACK = 1,
	};

	// Size: 0x4
	enum class ECrowdSide : int32_t
	{
		LEFT = 0,
		RIGHT = 1,
	};

	// Size: 0x4
	enum class ECrowdStandingPush : int32_t
	{
		PUSH_FRONT = 0,
		PUSH_FRONT_LEFT = 1,
		PUSH_LEFT = 2,
		PUSH_BACK_LEFT = 3,
		PUSH_BACK = 4,
		PUSH_BACK_RIGHT = 5,
		PUSH_RIGHT = 6,
		PUSH_FRONT_RIGHT = 7,
	};

	// Size: 0x4
	enum class EDefaultStateTypes : int32_t
	{
		STATE_IDLE = 0,
		STATE_WALK = 1,
		STATE_PENDINGWALK = 2,
		STATE_DEAD = 3,
		STATE_SCARED = 4,
		STATE_PENDINGSCARED = 5,
		STATE_POSSESSED = 6,
		STATE_ALERT = 7,
		STATE_PRONE = 8,
		STATE_RELOCATE = 9,
		STATE_PENDINGRELOCATE = 10,
		NUM_DEFAULT_STATES = 11,
	};

	// Size: 0x4
	enum class EGenderReq : int32_t
	{
		eGender_Any = 0,
		eGender_Male = 1,
		eGender_Female = 2,
	};

}

// Size: 0x4
enum class EAIEventType : int32_t
{
	AIET_None = 0,
	AIET_Ignore = 1,
	AIET_PreventAutoPurge = 2,
	AIET_ShootTarget = 3,
	AIET_Hunting = 4,
	AIET_FuseboxSabotaged = 5,
	AIET_Order_Target = 6,
	AIET_END_BOOLEAN_EVENTS = 7,
	AIET_LookedAt = 8,
	AIET_Killer = 9,
	AIET_Strangler = 10,
	AIET_Suspicious = 11,
	AIET_KnownBody = 12,
	AIET_Dead = 13,
	AIET_DisguiseSuspicious = 14,
	AIET_DamagingMe = 15,
	AIET_KnownInCloset = 16,
	AIET_KnownInNpcUnreachableArea = 17,
	AIET_NearSabotagedFusebox = 18,
	AIET_FuseboxAck = 19,
	AIET_DisablingFusebox = 20,
	AIET_Sense = 21,
	AIET_HasBeenInCombat = 22,
	AIET_ReportedByCamera = 23,
	AIET_SOUNDEVENTS_LOW_LOUDNESS_BEGIN = 24,
	AIET_SoundFootsteps = 25,
	AIET_SoundThrownItemCollision = 26,
	AIET_SoundGunSilenced = 27,
	AIET_SoundHitmanGunSilenced = 28,
	AIET_SoundLegalGunSilenced = 29,
	AIET_SoundLegalHitmanGunSilenced = 30,
	AIET_SoundEmptyGun = 31,
	AIET_SoundCCBreakNeck = 32,
	AIET_SoundCCChoke = 33,
	AIET_SoundCCFiberwire = 34,
	AIET_SoundBulletImpact = 35,
	AIET_SoundLegalBulletImpact = 36,
	AIET_SoundSpeakWarning = 37,
	AIET_SoundSpeakAngry = 38,
	AIET_SOUNDEVENTS_NORMAL_LOUDNESS_BEGIN = 39,
	AIET_SoundRadio = 40,
	AIET_SoundAlarm = 41,
	AIET_SoundSpeakPainBehind = 42,
	AIET_SoundCloseCombat = 43,
	AIET_SoundSpeakPain = 44,
	AIET_SOUNDEVENTS_LOUD_LOUDNESS_BEGIN = 45,
	AIET_SoundSpeakHelp = 46,
	AIET_SoundSpeakHelpLoud = 47,
	AIET_SoundGunShot = 48,
	AIET_SoundHitmanGunShot = 49,
	AIET_SoundLegalGunShot = 50,
	AIET_SoundLegalHitmanGunShot = 51,
	AIET_SoundExplosion = 52,
	AIET_SoundCustomAccident = 53,
	AIET_SoundAccident = 54,
	AIET_SoundCurious = 55,
	AIET_SoundCuriousItem = 56,
	AIET_SoundInteresting = 57,
	AIET_SoundCrowdCurious = 58,
	AIET_SoundCrowdAlerted = 59,
	AIET_SoundCrowdWantsArrest = 60,
	AIET_SOUNDEVENTS_END = 61,
	AIET_SightReaction = 62,
	AIET_SightInvestigation = 63,
	AIET_PerceptibleAware = 64,
	AIET_ItemAware = 65,
	AIET_TossSourceKnown = 66,
	AIET_InSight = 67,
	AIET_Sick = 68,
	AIET_Attention_Stage_1 = 69,
	AIET_Attention_Stage_2 = 70,
	AIET_AttentionFading = 71,
	AIET_FullAttention = 72,
	AIET_FullDisguiseAttention = 73,
	AIET_ReactedTo = 74,
	AIET_ReactTarget = 75,
	AIET_ReactSuppressed = 76,
	AIET_StanddownHolster = 77,
	AIET_ForcedIllegal = 78,
	AIET_HitByItem = 79,
	AIET_HitByCoin = 80,
	AIET_LTHitByItemOrCoin = 81,
	AIET_HitByItemOrCoinTwice = 82,
	AIET_HitByThis = 83,
	AIET_ReactedToSound = 84,
	AIET_SeenInAccident = 85,
	AIET_Trespassing_Strike_1 = 86,
	AIET_Trespassing_Strike_2 = 87,
	AIET_Trespassing_Strike_3 = 88,
	AIET_Investigate_Strike_1 = 89,
	AIET_Investigate_Strike_2 = 90,
	AIET_Weird_Strike_1 = 91,
	AIET_Weird_Strike_2 = 92,
	AIET_StandingTooClose = 93,
	AIET_PrivacyInvaded = 94,
	AIET_IgnoreDeadBodies = 95,
	AIET_DisguiseEnforcer = 96,
	AIET_Suspect = 97,
	AIET_Frisk_Strike_1 = 98,
	AIET_Frisk_Strike_2 = 99,
	AIET_Frisked = 100,
	AIET_InSentryZone = 101,
	AIET_TriggerAlarm = 102,
	AIET_LockdownIntruder = 103,
	AIET_AccuseUnconscious = 104,
	AIET_HasKnockMeDown = 105,
	AIET_HasKnockSomeoneDown = 106,
	AIET_InMyPrivateArea = 107,
	AIET_SeenInCrimeScene = 108,
	AIET_KnownNaked = 109,
	AIET_KnownDraggingBodybag = 110,
	AIET_InvestigateOrder = 111,
	AIET_ReactedSurprised = 112,
	AIET_ReportGotShot = 113,
	AIET_ReactedToSituation = 114,
	AIET_SeeAttached = 115,
	AIET_WasInvisible = 116,
	AIET_BlameHitman = 117,
	AIET_BlamedByUnconscious = 118,
	AIET_DontCareAboutBlaming = 119,
	AIET_ReactedToSniperKnowledge = 120,
	AIET_SniperCombatTarget = 121,
	AIET_SniperCombatAimTarget = 122,
	AIET_CantReachTarget = 123,
	AIET_HuntingSniper = 124,
	AIET_NeedCover = 125,
	AIET_WaitingForSniper = 126,
	AIET_HeardSniperShooting = 127,
	AIET_AgilityInCombat = 128,
	AIET_Landing = 129,
	AIET_DontReactWhileInvestigating = 130,
	AIET_ReactedWhileInvestigating = 131,
	AIET_ReactedToHitmanThrowing = 132,
	AIET_TossRealTarget = 133,
	AIET_CompleteOrderAfterReaction = 134,
	AIET_KnownHidden = 135,
	AIET_SituationTarget = 136,
	AIET_TalkingToHitman = 137,
	AIET_CuriousInvestigateTarget = 138,
	AIET_SuspiciousAction = 139,
	AIET_RadioCallHelpingActor = 140,
	AIET_WeaponContextKnown = 141,
	AIET_IdleStandDown = 142,
	AIET_IgnoreInvestigation = 143,
	AIET_NewDisguiseTarget = 144,
	AIET_SocialTarget = 145,
	AIET_SecurityCamBroken = 146,
	AIET_HeWoundedMeLongDistance = 147,
	AIET_HeWoundedMeShortDistance = 148,
	AIET_HeWoundedMeCC = 149,
	AIET_END_NORMAL_EVENTS = 150,
};

// Size: 0x4
enum class EAIGoal : int32_t
{
	AIG_Kill = 0,
	AIG_Arrest = 1,
	AIG_FightSniper = 2,
	AIG_HelpCivilian = 3,
	AIG_HelpCivilianWeapon = 4,
	AIG_Investigate = 5,
	AIG_InvestigateDisguise = 6,
	AIG_StandOffInvestigateDisguise = 7,
	AIG_InvestigateDeadBody = 8,
	AIG_HandleTrespasser = 9,
	AIG_InvestigateCautious = 10,
	AIG_InvestigateCurious = 11,
	AIG_InvestigateStanding = 12,
	AIG_InvestigateWeapon = 13,
	AIG_DetectedInPrivate = 14,
	AIG_RecoverUnconscious = 15,
	AIG_RecoverUnconsciousAlerted = 16,
	AIG_DeliverWeapon = 17,
	AIG_HandleFusebox = 18,
	AIG_AvoidExplosion = 19,
	AIG_Hunt = 20,
	AIG_Frisk = 21,
	AIG_GuardBody = 22,
	AIG_DragBody = 23,
	AIG_Accident = 24,
	AIG_Sentry = 25,
	AIG_HelpGeneric = 26,
	AIG_Evacuate = 27,
	AIG_Entourage = 28,
	AIG_AvoidDangerousArea = 29,
	AIG_Spectator = 30,
	AIG_None = 31,
};

// Size: 0x4
enum class EAILegalType : int32_t
{
	AILT_Weapon = 0,
	AILT_Shooting = 1,
	AILT_Aiming = 2,
	AILT_CloseCombat = 3,
	AILT_ChangeOutfit = 4,
	AILT_Count = 5,
};

// Size: 0x4
enum class EAIModifierScope : int32_t
{
	AIMS_Volume = 0,
	AIMS_Behavior = 1,
	AIMS_Role = 2,
	AIMS_Item = 3,
	AIMS_Situation = 4,
	AIMS_Outfit = 5,
	AIMS_Override = 6,
	AIMS_Status = 7,
};

// Size: 0x4
enum class EAIModifiers : int32_t
{
	AIM_Invalid = 0,
	AIM_IgnoreLowNoise = 1,
	AIM_IgnoreHitmanPropToss = 2,
	AIM_IgnoreAnnoyingHitman = 4,
	AIM_IgnoreSneakyHitman = 8,
	AIM_IgnoreAgileHitman = 16,
	AIM_IgnoreSillyHitman = 30,
	AIM_NeverInvestigateCurious = 32,
	AIM_PreferredInvestigator = 64,
	AIM_AccidentShy = 128,
	AIM_PreferredAccidentInvestigator = 256,
	AIM_BlockFiberWireInteraction = 512,
	AIM_BlockCloseCombatInteraction = 1024,
	AIM_BlockDragBodyInteraction = 2048,
	AIM_BlockAllInteractions = 3584,
	AIM_IgnoreTrespassing = 4096,
	AIM_IgnoreWeapons = 8192,
	AIM_IgnoreLockdown = 16384,
	AIM_DisableHelpCivilian = 32768,
	AIM_NeverInvestigateStanding = 65536,
	AIM_NeverInvestigateDistractions = 65568,
	AIM_WantsPrivacy = 131072,
	AIM_ConversationHelper = 262144,
	AIM_ConversationHelperFast = 524288,
	AIM_OneHitpoint = 1048576,
	AIM_BlockDeadlyThrow = 2097152,
	AIM_SuppressSocialGreeting = 4194304,
	AIM_NeverInvestigateAccidents = 8388608,
	AIM_BlockDeath = 16777216,
	AIM_IgnoreDeadBody = 33554432,
	AIM_NeverSpectate = 67108864,
};

// Size: 0x4
enum class EAISharedEventType : int32_t
{
	AISET_None = 0,
	AISET_StandOffCrowdReactionDone = 1,
	AISET_Shoot = 2,
	AISET_ShootBlind = 3,
	AISET_Scared = 4,
	AISET_CloseCombatRunIn = 5,
	AISET_CloseCombatArrest = 6,
	AISET_ReadyForCloseCombatArrest = 7,
	AISET_DeadByAccident = 8,
	AISET_BloodPool = 9,
	AISET_SituationConversation = 10,
	AISET_LAST_BOOLEAN_EVENT = 11,
	AISET_IllegalBehavior = 12,
	AISET_BeingWatched = 13,
	AISET_Sneaking = 14,
	AISET_Agility = 15,
	AISET_IllegalAgility = 16,
	AISET_ChangingOutfit = 17,
	AISET_CoverToCover = 18,
	AISET_Trespassing = 19,
	AISET_InTrespassZone = 20,
	AISET_DraggingBody = 21,
	AISET_KillingWithFiberwire = 22,
	AISET_KillingWithPull = 23,
	AISET_KillingWithPush = 24,
	AISET_KillingWithKick = 25,
	AISET_KillingWithKnife = 26,
	AISET_KillingWithDeadlyThrow = 27,
	AISET_PullingFromLedge = 28,
	AISET_PacifyingWithPull = 29,
	AISET_PacifyingWithPush = 30,
	AISET_PacifyingWithKick = 31,
	AISET_PacifyingWithKnockDownThrow = 32,
	AISET_PacifyingWithStrangle = 33,
	AISET_PacifyingWithKnife = 34,
	AISET_ThrowingSomething = 35,
	AISET_ThrowingExplosives = 36,
	AISET_KnockingDown = 37,
	AISET_InCloset = 38,
	AISET_InNpcUnreachableArea = 39,
	AISET_Peeking = 40,
	AISET_EnteringCloset = 41,
	AISET_ExitingCloset = 42,
	AISET_InCover = 43,
	AISET_HasWeapon = 44,
	AISET_WeaponEquipped = 45,
	AISET_WeaponFired = 46,
	AISET_WeaponReloading = 47,
	AISET_Aiming = 48,
	AISET_GuardDisguise = 49,
	AISET_PulledByHitmanOnLedge = 50,
	AISET_CombatNoHold = 51,
	AISET_CombatFireAtWill = 52,
	AISET_InOrderedPosition = 53,
	AISET_ORDERS_BEGIN = 54,
	AISET_Order_Act = 55,
	AISET_Order_Investigate = 56,
	AISET_Order_SearchPosition = 57,
	AISET_Order_Approach = 58,
	AISET_Order_GetHelp = 59,
	AISET_Order_StandDown = 60,
	AISET_Order_Escalate = 61,
	AISET_Order_Arrest = 62,
	AISET_Order_Avoid = 63,
	AISET_Order_Flee = 64,
	AISET_Order_Patrol = 65,
	AISET_Order_Reposition = 66,
	AISET_Order_Chase = 67,
	AISET_Order_AimFromPosition = 68,
	AISET_Order_HoldPosition = 69,
	AISET_Order_HoldCoverPosition = 70,
	AISET_Order_FightFromCover = 71,
	AISET_Order_FightFromPosition = 72,
	AISET_Order_ShootFromPosition = 73,
	AISET_Order_GuardPosition = 74,
	AISET_Order_GuardBody = 75,
	AISET_Order_WakeUpUnconscious = 76,
	AISET_Order_DragBody = 77,
	AISET_Order_HumanShieldLeader = 78,
	AISET_Order_HumanShieldSupport = 79,
	AISET_Order_TriggerAlarm = 80,
	AISET_Order_DispatchSuspectInfo = 81,
	AISET_Order_RecieveSuspectInfo = 82,
	AISET_Order_RequestBackup = 83,
	AISET_Order_CheckLastPosition = 84,
	AISET_Order_StandoffLastWarning = 85,
	AISET_Order_Evacuate = 86,
	AISET_Order_AgitatedBystander = 87,
	AISET_Order_CuriousBystander = 88,
	AISET_Order_Face = 89,
	AISET_Order_Holster = 90,
	AISET_Order_Unholster = 91,
	AISET_Order_MoveTo = 92,
	AISET_Order_JumpTo = 93,
	AISET_Order_FormationMove = 94,
	AISET_Order_SentryFrisk = 95,
	AISET_Order_SentryWarning = 96,
	AISET_Order_SentryGreeting = 97,
	AISET_Order_SentryCheckItem = 98,
	AISET_Order_DeliverWeapon = 99,
	AISET_Order_RecoverUnconscious = 100,
	AISET_Order_GetOutfit = 101,
	AISET_Order_LockdownWarning = 102,
	AISET_Order_VIPEvacuateIdle = 103,
	AISET_Order_VIPSafeRoom = 104,
	AISET_Order_VIPSafeRoomTrespasser = 105,
	AISET_Order_VIPScared = 106,
	AISET_Order_DefendVIP = 107,
	AISET_Order_CautiousVIP = 108,
	AISET_Order_CautiousGuardVIP = 109,
	AISET_Order_EscortOut = 110,
	AISET_Order_MoveInCover = 111,
	AISET_Order_MoveToCover = 112,
	AISET_Order_Conversation = 113,
	AISET_Order_AttentionToPerson = 114,
	AISET_Order_WaitForItemHandled = 115,
	AISET_ORDERS_END = 116,
	AISET_IMPULSES_BEGIN = 117,
	AISET_Impulse_ReceiveHuntTarget = 118,
	AISET_Impulse_AckHuntTarget = 119,
	AISET_Impulse_TransmitHuntTarget = 120,
	AISET_Impulse_ActiveRadioCall = 121,
	AISET_IMPULSES_END = 122,
	AISET_ForceFullAttention = 123,
	AISET_InCameraView2D = 124,
	AISET_BeingLookedAt = 125,
	AISET_BeingAimedAt = 126,
	AISET_BeingShotAt = 127,
	AISET_BeingFlanked = 128,
	AISET_BeingBumped = 129,
	AISET_BeingEscortedOut = 130,
	AISET_EscortingOut = 131,
	AISET_EscortOutFarewell = 132,
	AISET_HMTrespassing = 133,
	AISET_HMInEntryArea = 134,
	AISET_HMTakingDamage = 135,
	AISET_OpeningCPDoor = 136,
	AISET_HumanShield = 137,
	AISET_DisablingFusebox = 138,
	AISET_IllegalAction = 139,
	AISET_IllegalActionSevere = 140,
	AISET_TakingKeyCard = 141,
	AISET_TakingSecurityTape = 142,
	AISET_DumpingBody = 143,
	AISET_Shooting = 144,
	AISET_BlindFire = 145,
	AISET_ShootingBallet = 146,
	AISET_Running = 147,
	AISET_Walking = 148,
	AISET_UsingKeyCard = 149,
	AISET_WeaponDropped = 150,
	AISET_WeaponPickedUp = 151,
	AISET_ItemPickedUp = 152,
	AISET_ItemDropped = 153,
	AISET_Surrendering = 154,
	AISET_RequestSurrender = 155,
	AISET_StandOffEscalated = 156,
	AISET_Standing = 157,
	AISET_Enforcer = 158,
	AISET_DisguiseEnforcer = 159,
	AISET_Dead = 160,
	AISET_DeadByUnnoticed = 161,
	AISET_DeadBySniper = 162,
	AISET_InMorgue = 163,
	AISET_InAccident = 164,
	AISET_Accident = 165,
	AISET_Dying = 166,
	AISET_InInvestigateDisguise = 167,
	AISET_InArrest = 168,
	AISET_Arrestor = 169,
	AISET_InCombat = 170,
	AISET_InCombatWithGuards = 171,
	AISET_Hunted = 172,
	AISET_ForceHunted = 173,
	AISET_CloseCombat = 174,
	AISET_TakingProjectileDamage = 175,
	AISET_TakingHeadshotDamage = 176,
	AISET_TakingExplosionDamage = 177,
	AISET_TakingThrowDamage = 178,
	AISET_ForceKillHM = 179,
	AISET_Armed = 180,
	AISET_BeingHumanShield = 181,
	AISET_BeingPulledOutOfWindow = 182,
	AISET_BeingPushedOverRail = 183,
	AISET_BeingFiberwired = 184,
	AISET_BeingPulledFromLedge = 185,
	AISET_BeingDragged = 186,
	AISET_OnScreen = 187,
	AISET_ExplosionImminent = 188,
	AISET_DisguiseSafeZone = 189,
	AISET_DisguiseCanBlendIn = 190,
	AISET_DisguiseBlendIn = 191,
	AISET_DisguiseBroken = 192,
	AISET_InWarZone = 193,
	AISET_HearLockdownAlarm = 194,
	AISET_InCrowd = 195,
	AISET_InCrowdHighDensity = 196,
	AISET_InCrowdAlert = 197,
	AISET_InCrowdPanic = 198,
	AISET_HiddenByCrowd = 199,
	AISET_CrowdDisguise = 200,
	AISET_BeingStrangled = 201,
	AISET_BeingSnapNecked = 202,
	AISET_BeingKnockedDown = 203,
	AISET_BeingContextKilled = 204,
	AISET_CloseCombatTakedown = 205,
	AISET_ContextKill = 206,
	AISET_ExecutePistol = 207,
	AISET_SedativePoison = 208,
	AISET_SpawnedActor = 209,
	AISET_SoundRadio = 210,
	AISET_Pickup = 211,
	AISET_PickupByHM = 212,
	AISET_Weapon = 213,
	AISET_Item = 214,
	AISET_ItemThrown = 215,
	AISET_OwnedByHM = 216,
	AISET_Coin = 217,
	AISET_Perceptible = 218,
	AISET_InLimitVisionAreaZone = 219,
	AISET_InsideLimitVisionArea = 220,
	AISET_BlockedByLimitVisionArea = 221,
	AISET_AmbientOnly = 222,
	AISET_HasBeenInCombat = 223,
	AISET_HitByItem = 224,
	AISET_CloseCombatAllowed = 225,
	AISET_CollateralTarget = 226,
	AISET_CheckedLastPosition = 227,
	AISET_HuntAct = 228,
	AISET_Sick = 229,
	AISET_Naked = 230,
	AISET_Investigated = 231,
	AISET_ShouldHaveGuard = 232,
	AISET_FreshBody = 233,
	AISET_InDeadBodyArea = 234,
	AISET_InCrimeScene = 235,
	AISET_SeenThrowing = 236,
	AISET_SeenThrowingCoin = 237,
	AISET_SeenDeadlyThrowVictim = 238,
	AISET_IWillBeDeadlyThrowVictim = 239,
	AISET_Suspect = 240,
	AISET_BeingFrisked = 241,
	AISET_RequestFrisk = 242,
	AISET_FriskComplying = 243,
	AISET_FriskApproachReady = 244,
	AISET_FriskReady = 245,
	AISET_Frisked = 246,
	AISET_FriskFailed = 247,
	AISET_FriskFoundWeapon = 248,
	AISET_AntiSocial = 249,
	AISET_Introvert = 250,
	AISET_InLockdownZone = 251,
	AISET_EnteringLockdownZone = 252,
	AISET_InSentryZone = 253,
	AISET_InSentryWarningZone = 254,
	AISET_InSentryFriskWarningZone = 255,
	AISET_SuppressTrespassing = 256,
	AISET_ReportedDisturbance = 257,
	AISET_InLockdown = 258,
	AISET_ToldToEvacuate = 259,
	AISET_CurrentTarget = 260,
	AISET_RequestShowItem = 261,
	AISET_RequestComplying = 262,
	AISET_WokenByNPC = 263,
	AISET_Silly = 264,
	AISET_TriggerLockDownAlarm = 265,
	AISET_CombatFromEvacuate = 266,
	AISET_DontMakeFunPlease = 267,
	AISET_TempCrowdKnowledge = 268,
	AISET_Attached = 269,
	AISET_DontReact = 270,
	AISET_Sentry = 271,
	AISET_HardSentry = 272,
	AISET_FriskingSentry = 273,
	AISET_CrowdActorCrimeScene = 274,
	AISET_Guarded = 275,
	AISET_CloseCombatFinisher = 276,
	AISET_Pacified = 277,
	AISET_SomeoneIsSniping = 278,
	AISET_FlashpointSeen = 279,
	AISET_SniperLocation = 280,
	AISET_WeaponContextKnown = 281,
	AISET_Distracted = 282,
	AISET_LockedInAgility = 283,
	AISET_ActorAlreadyAlive = 284,
	AISET_DraggingBodyBag = 285,
	AISET_UncosciousBlamingFailed = 286,
	AISET_PropagateFromAgility = 287,
	AISET_VaultingOverObstacle = 288,
	AISET_ClimbingWindow = 289,
	AISET_Combat_Brave = 290,
	AISET_Combat_OneTimeBrave = 291,
	AISET_Combat_PrimaryRange = 292,
	AISET_Combat_CloseToGuards = 293,
	AISET_Combat_RecentlySeen = 294,
	AISET_InTheAirDeadly = 295,
	AISET_InTheAir = 296,
	AISET_Landing = 297,
	AISET_ReactingToToss = 298,
	AISET_InvestigatingToss = 299,
	AISET_InSentrySituation = 300,
	AISET_Wounded = 301,
	AISET_RecoveredFromWounded = 302,
	AISET_ReactedToTossAlerted = 303,
	AISET_ReactedToHitAlerted = 304,
	AISET_GettingHelp = 305,
	AISET_HelpingCivilian = 306,
	AISET_InvestigatingMurder = 307,
	AISET_InvestigatingMurderOrGunshot = 308,
	AISET_InvestigateDisguiseGroupLeader = 309,
	AISET_InvestigateDisguiseMovingBack = 310,
	AISET_BodyguardVIPDead = 311,
	AISET_SilentlyKilled = 312,
	AISET_SilentlyKilling = 313,
	AISET_SoundGunShot = 314,
	AISET_SoundHitmanGunShot = 315,
	AISET_AlertedReactionPlayed = 316,
	AISET_ChangingOutfitFromBody = 317,
	AISET_SpeedBoost = 318,
	AISET_ManhuntMember = 319,
	AISET_InvestigateDisguiseMember = 320,
	AISET_EvacuateAfterRecover = 321,
	AISET_Woozy = 322,
	AISET_HasAmbientEscort = 323,
	AISET_IsEscortingVIP = 324,
	AISET_StrangleVictim = 325,
	AISET_DontStandDownIfIdling = 326,
	AISET_Jumping = 327,
	AISET_GetHelpDone = 328,
	AISET_VIPHandleOwnCuriousInvestigation = 329,
	AISET_InDangerousArea = 330,
	AISET_RadioCallHelpComming = 331,
	AISET_RadioCallHelpFailed = 332,
	AISET_RadioCallHelpArrived = 333,
	AISET_SocialCooldown = 334,
	AISET_VIPEscaping = 335,
	AISET_VisionCone_AlignToActorOrientation = 336,
	AISET_InterestingLocation = 337,
	AISET_SeeDeathExplained = 338,
	AISET_HMHasVictim = 339,
	AISET_PrivateSituationLeader = 340,
	AISET_LongTermMemorySetGoal = 341,
	AISET_InEvacuateTrespassGroup = 342,
	AISET_ENFORCER_DISABLE_FLAG_BEGIN = 343,
	AISET_Enforcer_Disable_HideInPlainSight = 344,
	AISET_ENFORCER_DISABLE_FLAG_END = 345,
	AISET_DYNAMIC_ENFORCER_FLAG_BEGIN = 346,
	AISET_DynamicEnforcer_SharedHitmanSensor = 347,
	AISET_DynamicEnforcer_NakedActor = 348,
	AISET_DynamicEnforcer_SeenItemThrown = 349,
	AISET_DynamicEnforcer_HitByItemOrCoin = 350,
	AISET_DynamicEnforcer_Setpiece = 351,
	AISET_DynamicEnforcer_SillyHitman = 352,
	AISET_DynamicEnforcer_PrivateArea = 353,
	AISET_DynamicEnforcer_SuspiciousMovement = 354,
	AISET_DYNAMIC_ENFORCER_FLAG_INCA_BEGIN = 355,
	AISET_DynamicEnforcer_Explosion = 356,
	AISET_DynamicEnforcer_GunshotSound = 357,
	AISET_DynamicEnforcer_BulletImpactSound = 358,
	AISET_DynamicEnforcer_CloseCombatSound = 359,
	AISET_DynamicEnforcer_DeadlyThrowVictim = 360,
	AISET_DynamicEnforcer_PacifyingThrowVictim = 361,
	AISET_DynamicEnforcer_SeenMurderVictimNotHeardGunshot = 362,
	AISET_DynamicEnforcer_SeenMurderVictimHeardGunshot = 363,
	AISET_DynamicEnforcer_MurderAttempt = 364,
	AISET_DynamicEnforcer_DeadBody = 365,
	AISET_DynamicEnforcer_PacifiedBody = 366,
	AISET_DynamicEnforcer_Hunt = 367,
	AISET_DYNAMIC_ENFORCER_FLAG_INCA_END = 368,
	AISET_DYNAMIC_ENFORCER_FLAG_END = 369,
	AISET_DYNAMIC_ENFORCER_DISABLE_FLAG_BEGIN = 370,
	AISET_DynamicEnforcer_Disable_CivilianInInvestigateCautious = 371,
	AISET_DYNAMIC_ENFORCER_DISABLE_FLAG_END = 372,
	AISET_DYNAMIC_ENFORCER_CIVILIAN_DISGUISE_ONLY_FLAG_BEGIN = 373,
	AISET_DynamicEnforcer_InvestigateWeapon = 374,
	AISET_DYNAMIC_ENFORCER_CIVILIAN_DISGUISE_ONLY_FLAG_END = 375,
	AISET_DYNAMIC_ENFORCER_ARREST_REASON_BEGIN = 376,
	AISET_DynamicEnforcer_ArrestReason_Murder = 377,
	AISET_DynamicEnforcer_ArrestReason_MurderAttempt = 378,
	AISET_DynamicEnforcer_ArrestReason_HitByItemOrCoin = 379,
	AISET_DynamicEnforcer_ArrestReason_NearDeadBody = 380,
	AISET_DynamicEnforcer_ArrestReason_NearPacifiedBody = 381,
	AISET_DynamicEnforcer_ArrestReason_GunshotSound = 382,
	AISET_DynamicEnforcer_ArrestReason_CloseCombatSound = 383,
	AISET_DynamicEnforcer_ArrestReason_BulletImpactSound = 384,
	AISET_DynamicEnforcer_ArrestReason_Hunt = 385,
	AISET_DynamicEnforcer_ArrestReason_Explosion = 386,
	AISET_DynamicEnforcer_ArrestReason_PrivateArea = 387,
	AISET_DynamicEnforcer_ArrestReason_Weapon = 388,
	AISET_DynamicEnforcer_ArrestReason_Setpiece = 389,
	AISET_DynamicEnforcer_ArrestReason_KnockdownThrow = 390,
	AISET_DynamicEnforcer_ArrestReason_SillyHitman = 391,
	AISET_DYNAMIC_ENFORCER_ARREST_REASON_END = 392,
};

// Size: 0x4
enum class EAISituation : int32_t
{
	AIS_GENERIC = 0,
	AIS_SPECIAL = 1,
	AIS_SENSOR = 2,
	AIS_TRESPASSING = 3,
	AIS_STANDOFF = 4,
	AIS_SMUGGLE = 5,
	AIS_GET_HELP = 6,
	AIS_CONVERSTION_GROUP = 7,
	AIS_PROTO_COMBAT = 8,
	AIS_SENTRY = 9,
	AIS_LEAD_ESCORT = 10,
	AIS_INVESTIGATE_WEAPON = 11,
	AIS_INVESTIGATE_STANDING = 12,
	AIS_INVESTIGATE_CURIOUS = 13,
	AIS_INVESTIGATE_CAUTIOUS = 14,
	AIS_HERO_ESCORT = 15,
	AIS_EVACUATE = 16,
	AIS_ESCORT = 17,
	AIS_ENTOURAGE = 18,
	AIS_DRAMA = 19,
	AIS_DISGUISE = 20,
	AIS_DEAD_BODY = 21,
	AIS_COMBAT = 22,
	AIS_CLOSE_COMBAT = 23,
	AIS_AVOID_EXPLOSION = 24,
	AIS_ACCIDENT = 25,
	AIS_PRIVATE = 26,
	AIS_GUARD_BODY = 27,
	AIS_RECOVER_UNC = 28,
	AIS_SNIPER = 29,
};

// Size: 0x4
enum class EAISituationEvent : int32_t
{
	AISE_Any = 0,
	AISE_ActorJoined = 1,
	AISE_ActorLeft = 2,
	AISE_Data = 3,
};

// Size: 0x4
enum class EAISoundEventLoudness : int32_t
{
	EAISEL_Default = 0,
	EAISEL_VeryLow = 1,
	EAISEL_Low = 2,
	EAISEL_Normal = 3,
	EAISEL_Loud = 4,
	EAISEL_VeryLoud = 5,
};

// Size: 0x4
enum class EActBodyType : int32_t
{
	ABT_UpperBodyOnly = 0,
	ABT_FullBodyWithLeadIn = 1,
	ABT_FullBodyOnly = 2,
};

// Size: 0x4
enum class EActionPromptState : int32_t
{
	eActionPromptState_Disabled = 0,
	eActionPromptState_Enabled = 1,
	eActionPromptState_Activated = 2,
	eActionPromptState_Held = 3,
};

// Size: 0x4
enum class EActionRadialArcIconType : int32_t
{
	EARAIT_NoIcon = 0,
	EARAIT_Locked = 1,
	EARAIT_NeedTool = 2,
	EARAIT_IsRunning = 3,
	EARAIT_Crowbar = 4,
	EARAIT_Wrench = 5,
	EARAIT_Card = 6,
	EARAIT_Lockpick = 7,
	EARAIT_Screwdriver = 8,
	EARAIT_AmmoBullet = 9,
	EARAIT_Flower = 10,
	EARAIT_ChemicalTube = 11,
	EARAIT_Golfball = 12,
	EARAIT_Keypad = 13,
	EARAIT_Key = 14,
	EARAIT_Coin = 15,
	EARAIT_Poison = 16,
	EARAIT_Exsplosive = 17,
};

// Size: 0x4
enum class EActionType : int32_t
{
	AT_INVALID = 0,
	AT_OPENDOOR = 1,
	AT_CLOSEDOOR = 2,
	AT_PICKUP = 4,
	AT_GENERIC = 8,
	AT_REMOTE = 16,
	AT_OUTFIT = 32,
	AT_CLOTHBUNDLE = 64,
	AT_DRAGBODY = 128,
	AT_RETRIEVE_ITEM_FROM_CONTAINER = 256,
	AT_RELEASEHUMANSHIELD = 512,
	AT_HERO_MOVEMENT = 1024,
	AT_SWAPITEM = 2048,
	AT_DUMPBODY = 4096,
	AT_COUP_DE_GRACE = 8192,
	AT_INTERACTION_GROUP = 16384,
	AT_USE_NORMAL = 32768,
	AT_STASHPOINT_PICKUP = 65536,
	AT_ENTERCLOSET = 131072,
	AT_EXITCLOSET = 262144,
	AT_ENTERSAFEZONE = 524288,
	AT_EXITSAFEZONE = 1048576,
	AT_CANCEL = 2097152,
	AT_CONTAINERFLUSHBODY = 4194304,
	AT_VENTILATORSHAFT = 8388608,
	AT_PLACE_ITEM_IN_CONTAINER = 16777216,
	AT_USE_DOWN = 33554432,
	AT_USE_HOLD = 67108864,
	AT_CONTEXTACTION = 134217728,
	AT_KILLHUMANSHIELD = 268435456,
	AT_ITEMCONTAINER = 536870912,
	AT_USE_QUICK = 1073741824,
	AT_ITEM_INTERACTION = -2147483648,
};

// Size: 0x4
enum class EActorAIState : int32_t
{
	eAAIS_None = 0,
	eAAIS_Distracted = 1,
	eAAIS_PotentialThreat = 2,
	eAAIS_PotentialThreatDistracted = 3,
	eAAIS_PotentialThreatDisabled = 4,
	eAAIS_Aggressive = 5,
	eAAIS_EscortingOut = 6,
	eAAIS_Fleeing = 7,
	eAAIS_Unconscious = 8,
	eAAIS_DisabledInCombat = 9,
	eAAIS_Disabled = 10,
	eAAIS_Max = 11,
};

// Size: 0x4
enum class EActorAnimationOrder : int32_t
{
	AAO_None = 0,
	AAO_Stand = 1,
	AAO_Move = 2,
	AAO_React = 3,
	AAO_Act = 4,
	AAO_MoveToAct = 5,
	AAO_MoveToCover = 6,
	AAO_ShootFromCover = 7,
	AAO_PeekFromCover = 8,
	AAO_Death = 9,
	AAO_Impact = 10,
	AAO_Controlled = 11,
};

// Size: 0x4
enum class EActorCCPreset : int32_t
{
	ACCP_CivilianFemale = 0,
	ACCP_CivilianeMale = 1,
	ACCP_GuardMale = 2,
	ACCP_GuardMaleElite = 3,
	ACCP_GuardMaleSuperElite = 4,
	ACCP_Ignore = 5,
	ACCP_None = 6,
};

// Size: 0x4
enum class EActorEmotionState : int32_t
{
	AES_Ambient = 0,
	AES_Alerted = 1,
	AES_Scared = 2,
	AES_Hunt = 3,
	AES_Combat = 4,
	AES_None = 268435455,
};

// Size: 0x4
enum class EActorEventTypes : int32_t
{
	eAET_OnAlive = 0,
	eAET_OnPacified = 1,
	eAET_OnMurdered = 2,
	eAET_OnAccidentDeath = 3,
	eAET_OnUnnoticableKill = 4,
	eAET_OnBodyNoticed = 5,
	eAET_OnBodyBagged = 6,
	eAET_OnDying = 7,
	eAET_OnDead = 8,
	eAET_OnBodyHidden = 9,
	eAET_OnBodyFlushed = 10,
	eAET_OnBodyDumped = 11,
	eAET_OnDelete = 12,
};

// Size: 0x4
enum class EActorFaction : int32_t
{
	eActorFaction_Default = 0,
	eActorFaction_VIP_1 = 1,
	eActorFaction_VIP_2 = 2,
	eActorFaction_VIP_3 = 3,
	eActorFaction_VIP_4 = 4,
	eActorFaction_VIP_5 = 5,
	eActorFaction_VIP_6 = 6,
	eActorFaction_VIP_7 = 7,
};

// Size: 0x4
enum class EActorGroup : int32_t
{
	eAG_Group_A = 0,
	eAG_Group_B = 1,
	eAG_Group_C = 2,
	eAG_Group_D = 3,
	eAG_Count = 4,
};

// Size: 0x4
enum class EActorLookAtPriority : int32_t
{
	eALAPriority_Ambient = 0,
	eALAPriority_AmbientHigh = 1,
	eALAPriority_Alert = 2,
	eALAPriority_AlertHigh = 3,
	eALAPriority_Hunt = 4,
	eALAPriority_HuntHigh = 5,
	eALAPriority_Combat = 6,
	eALAPriority_CombatHigh = 7,
};

// Size: 0x4
enum class EActorLookAtStopReason : int32_t
{
	eSR_Unknown = 0,
	eSR_Disabled = 1,
	eSR_DurationExpired = 2,
	eSR_OutOfRange = 3,
	eSR_OutOfSight = 4,
	eSR_OutOfRemainingPathDistance = 5,
	eSR_Interrupted = 6,
	eSR_TargetRemoved = 7,
	eSR_HigherPriorityProfile = 8,
	eSR_HideInPlainSight = 9,
};

// Size: 0x4
enum class EActorLookAtTargetType : int32_t
{
	eALAT_Invalid = 0,
	eALAT_PositionTarget = 1,
	eALAT_KnownEntityType = 2,
	eALAT_PointOfInterest = 3,
	eALAT_Hero = 4,
	eALAT_Screenplay = 5,
	eALAPT_Max = 6,
};

// Size: 0x4
enum class EActorPerceptionSensitivity : int32_t
{
	APS_AMBIENT_DEAFBLIND = 0,
	APS_AMBIENT_SLEEPING = 1,
	APS_AMBIENT_PREOCCUPIED = 2,
	APS_AMBIENT = 3,
	APS_ALERT_LOW = 4,
	APS_ALERT = 5,
	APS_COMBAT = 6,
	APS_SPIDER_SENSE = 7,
};

// Size: 0x4
enum class EActorRank : int32_t
{
	AR_Default = 0,
	AR_Elite = 1,
	AR_Cop = 2,
	AR_Goon = 3,
};

// Size: 0x4
enum class EActorRole : int32_t
{
	eActorRole_Default = 0,
	eActorRole_Bodyguard = 1,
	eActorRole_VIP = 2,
};

// Size: 0x4
enum class EActorSecondaryIconState : int32_t
{
	eSIS_Clear = 0,
	eSIS_Infected = 1,
};

// Size: 0x4
enum class EActorState : int32_t
{
	AS_DEACTIVATED = 0,
	AS_ALIVE = 1,
	AS_DYING = 2,
	AS_DEAD = 3,
	AS_DISABLED = 4,
};

// Size: 0x4
enum class EActorType : int32_t
{
	eAT_Civilian = 0,
	eAT_Guard = 1,
	eAT_Hitman = 2,
	eAT_Last = 3,
};

// Size: 0x4
enum class EActorVoiceVariation : int32_t
{
	eAVV_Undefined = 0,
	eAVV_ABIATTI = 1,
	eAVV_BERG = 2,
	eAVV_BDYGRD04 = 3,
	eAVV_BDYGRD01 = 4,
	eAVV_BDYGRD02 = 5,
	eAVV_BDYGRD03 = 6,
	eAVV_BUSEY = 7,
	eAVV_CARUSO = 8,
	eAVV_CHEF01 = 9,
	eAVV_CHEF02 = 10,
	eAVV_CHEF03 = 11,
	eAVV_CHEF04 = 12,
	eAVV_CHURCHSTAFF01 = 13,
	eAVV_CHURCHSTAFF02 = 14,
	eAVV_CHURCHSTAFF03 = 15,
	eAVV_CIVFEM01 = 16,
	eAVV_CIVFEM02 = 17,
	eAVV_CIVFEM03 = 18,
	eAVV_CIVFEM04 = 19,
	eAVV_CIVFEM05 = 20,
	eAVV_CIVMALE01 = 21,
	eAVV_CIVMALE02 = 22,
	eAVV_CIVMALE03 = 23,
	eAVV_CIVMALE04 = 24,
	eAVV_CIVMALE05 = 25,
	eAVV_CIVMALE06 = 26,
	eAVV_CLEANER01 = 27,
	eAVV_CLEANER02 = 28,
	eAVV_CLEANER03 = 29,
	eAVV_CLEANERFEM01 = 30,
	eAVV_CLEANERFEM02 = 31,
	eAVV_CLEANERFEM03 = 32,
	eAVV_CREW01 = 33,
	eAVV_CREW02 = 34,
	eAVV_CREW04 = 35,
	eAVV_CROSS = 36,
	eAVV_DALIA = 37,
	eAVV_DESANTIS = 38,
	eAVV_DINO_BOSCO = 39,
	eAVV_DOCTOR01 = 40,
	eAVV_DOCTOR06 = 41,
	eAVV_DOCTORFEM03 = 42,
	eAVV_DOCTORFEM04 = 43,
	eAVV_ET_ARGUS = 44,
	eAVV_ET_CARDINAL = 45,
	eAVV_ET_CONNER = 46,
	eAVV_ET_DYLAN = 47,
	eAVV_ET_GARY_LUNN = 48,
	eAVV_ET_HARVERFOEK = 49,
	eAVV_ET_LARIN = 50,
	eAVV_ET_MOXON = 51,
	eAVV_ET_MR_GIGGLES = 52,
	eAVV_ET_PHILLIPOS = 53,
	eAVV_ET_SCOTT_SARNO = 54,
	eAVV_ET_TORVIK = 55,
	eAVV_ET_TROUTT = 56,
	eAVV_ET_VITO_DURIC = 57,
	eAVV_FILMCREW01 = 58,
	eAVV_FILMCREW02 = 59,
	eAVV_FILMCREW03 = 60,
	eAVV_FILMCREW04 = 61,
	eAVV_FILMCREWFEM01 = 62,
	eAVV_FILMCREWFEM02 = 63,
	eAVV_FILMCREWFEM03 = 64,
	eAVV_FILMCREWFEM04 = 65,
	eAVV_FILMCREWFEM05 = 66,
	eAVV_FOD_FEM = 67,
	eAVV_FOD_MALE = 68,
	eAVV_GARDENER01 = 69,
	eAVV_GARDENER02 = 70,
	eAVV_GARDENER03 = 71,
	eAVV_GARDENERFEM01 = 72,
	eAVV_GARDENERFEM02 = 73,
	eAVV_GARDENERFEM03 = 74,
	eAVV_GRAVES = 75,
	eAVV_GUARDIA02 = 76,
	eAVV_GUARDIA03 = 77,
	eAVV_HOUSSTFF01 = 78,
	eAVV_HOUSSTFF02 = 79,
	eAVV_HOUSSTFF03 = 80,
	eAVV_HOUSSTFF06 = 81,
	eAVV_HOUSSTFFEM01 = 82,
	eAVV_HOUSSTFFEM02 = 83,
	eAVV_HOUSSTFFEM03 = 84,
	eAVV_INTERN = 85,
	eAVV_KONG = 86,
	eAVV_MAMBACREW01 = 87,
	eAVV_MAMBACREW02 = 88,
	eAVV_MAMBACREW03 = 89,
	eAVV_MAMBACREW04 = 90,
	eAVV_MECH01 = 91,
	eAVV_MECH02 = 92,
	eAVV_MECH03 = 93,
	eAVV_MENDOLA = 94,
	eAVV_MODEL01 = 95,
	eAVV_MODEL02 = 96,
	eAVV_MODEL03 = 97,
	eAVV_MODELFEM01 = 98,
	eAVV_MODELFEM02 = 99,
	eAVV_MODELFEM03 = 100,
	eAVV_MORGAN = 101,
	eAVV_NOVIKOV = 102,
	eAVV_NORFOLK = 103,
	eAAV_PRIEST01 = 104,
	eAVV_RITTER = 105,
	eAVV_ROSE = 106,
	eAVV_SANTA = 107,
	eAVV_SCIENTIST01 = 108,
	eAVV_SCIENTIST02 = 109,
	eAVV_SCIENTIST03 = 110,
	eAVV_SCIENTIST04 = 111,
	eAVV_SCIENTISTFEM01 = 112,
	eAVV_SCIENTISTFEM02 = 113,
	eAVV_SCIENTISTFEM03 = 114,
	eAVV_SCIENTISTFEM04 = 115,
	eAVV_SOFTGRD01 = 116,
	eAVV_SOFTGRD02 = 117,
	eAVV_SOFTGRD03 = 118,
	eAVV_SOLDIER01 = 119,
	eAVV_SOLDIER02 = 120,
	eAVV_SOLDIER03 = 121,
	eAVV_SOLDIERBOSS01 = 122,
	eAVV_SOLDIERBOSS02 = 123,
	eAVV_SOLDIERBOSS03 = 124,
	eAVV_SPECOPS01 = 125,
	eAVV_SPECOPS02 = 126,
	eAVV_SPECOPS03 = 127,
	eAVV_STAFFMALE01 = 128,
	eAVV_STAFFMALE02 = 129,
	eAVV_STAFFMALE03 = 130,
	eAVV_STAFFMALE04 = 131,
	eAVV_STAFFMALE05 = 132,
	eAVV_STAFFMALE06 = 133,
	eAVV_STAFFEM03 = 134,
	eAVV_STAFFEM04 = 135,
	eAVV_STAFFEM05 = 136,
	eAVV_STRANDBERG = 137,
	eAVV_STYLIST01 = 138,
	eAVV_STYLIST02 = 139,
	eAVV_STYLIST03 = 140,
	eAVV_STYLIST04 = 141,
	eAVV_STYLISTFEM01 = 142,
	eAVV_STYLISTFEM02 = 143,
	eAVV_STYLISTFEM03 = 144,
	eAVV_STYLISTFEM04 = 145,
	eAVV_PARVATI = 146,
	eAVV_WAITER01 = 147,
	eAVV_WAITER02 = 148,
	eAVV_WAITER03 = 149,
	eAVV_WAITER04 = 150,
	eAVV_WAITERFEM01 = 151,
	eAVV_WAITERFEM02 = 152,
	eAVV_WAITERFEM03 = 153,
	eAVV_WAITERFEM04 = 154,
	eAVV_YACHTCREW01 = 155,
	eAVV_YACHTCREW02 = 156,
	eAVV_YACHTCREW03 = 157,
	eAVV_YACHTCREW04 = 158,
	eAVV_YAMASAKI = 159,
	eAVV_ZAYDAN = 160,
	eAVV_WS_BOULTON = 161,
	eAVV_WS_NEWMAN = 162,
	eAVV_WS_WATSON = 163,
};

// Size: 0x4
enum class EAgilityState : int32_t
{
	eAgState_JumpToHangFromLocomotion = 0,
	eAgState_ClimbOnToLedgeFromLocomotion = 1,
	eAgState_ClimbToHangFromLocomotion = 2,
	eAgState_WalkOnFromLocomotion = 3,
	eAgState_WalkOffToLocomoton = 4,
	eAgState_PullUpToLedgeWalk = 5,
	eAgState_PullUpToLocomotion = 6,
	eAgState_LedgeJumpOffToLocomotion = 7,
	eAgState_VaultOverLedgeFromCover = 8,
	eAgState_ClimbOnToLedgeFromCover = 9,
	eAgState_LedgeHangDefault = 10,
	eAgState_LedgeWalkDefault = 11,
	eAgState_TransLedgeHangDownToWalk = 12,
	eAgState_TransLedgeHangUpToWalk = 13,
	eAgState_TransLedgeWalkDownToHang = 14,
	eAgState_TransLedgeWalkUpToHang = 15,
	eAgState_TransLedgeHangUpToRail = 16,
	eAgState_TransLedgeHangToLocomotion = 17,
	eAgState_TransLedgeWalkToLocomotion = 18,
	eAgState_LedgeHangJumpLeft = 19,
	eAgState_LedgeHangJumpRight = 20,
	eAgState_LedgeWalkJumpLeft = 21,
	eAgState_LedgeWalkJumpRight = 22,
	eAgState_SneakPastWindowLeftToRight = 23,
	eAgState_SneakPastWindowRightToLeft = 24,
	eAgState_ClimbWindowFromLedgeToLocomotion = 25,
	eAgState_ClimbWindowFromLocomotionToLedge = 26,
	eAgState_ClimbWindowFromLocomotionToLocomotion = 27,
	eAgState_ClimbWindowFromCoverToLocomotion = 28,
	eAgState_ClimbWindowFromCoverToLedge = 29,
	eAgState_ClimbOnToLedgeFromDrainPipe = 30,
	eAgState_ClimbToHangFromDrainPipe = 31,
	eAgState_ClimbToWalkFromDrainPipeLeft = 32,
	eAgState_ClimbToWalkFromDrainPipeRight = 33,
	eAgState_Deactivate = 34,
	eAgState_Unknown = 35,
};

// Size: 0x4
enum class EAimAssistGameModeFilter : int32_t
{
	AATF_ANY = 0,
	AATF_POINTSHOOTING = 1,
};

// Size: 0x4
enum class EAlertedDebugMode : int32_t
{
	ADM_RandomMovement = 0,
	ADM_Patrol = 1,
};

// Size: 0x4
enum class EAnimBlendMode : int32_t
{
	EAnimBlendMode_InterpAttInterpPos = 0,
	EAnimBlendMode_InterpAttAddPos = 1,
	EAnimBlendMode_AddAttLeavePos = 2,
	EAnimBlendMode_AddAttAddPos = 3,
};

// Size: 0x4
enum class EAnimSetState : int32_t
{
	EASES_DEFAULT = 0,
	EASES_AMBIENT_ARMED = 1,
	EASES_AMBIENT_VIP_ESCORT = 2,
	EASES_COMBAT_EVACUATE = 3,
	EASES_COMBAT_EVACUATE_VIP_SOLO = 4,
	EASES_SICK = 5,
};

// Size: 0x4
enum class EAnimSetType : int32_t
{
	EAST_UNDEFINED = 0,
	EAST_DEFAULT = 1,
	EAST_PISTOL = 2,
	EAST_REVOLVER = 3,
	EAST_SMG = 4,
	EAST_SNIPER = 5,
	EAST_ASSULT = 6,
	EAST_SHOTGUN = 7,
	EAST_BODYBAG = 8,
	EAST_GLASS = 9,
	EAST_BOX = 10,
	EAST_PLATE = 11,
	EAST_SMALLOBJ = 12,
	EAST_SUITCASE = 13,
	EAST_TRAY = 14,
	EAST_TROLLY = 15,
	EAST_FLASHLIGHT = 16,
	EAST_CARRY_1HANDEDWEAPON = 17,
	EAST_CARRY_2HANDEDWEAPON = 18,
	EAST_CARRY_RAKE = 19,
	EAST_CARRY_WEAPON_ITEM = 20,
	EAST_CARRY_BRICK_MINE = 21,
	EAST_CARRY_PROXY_MINE = 22,
	EAST_CARRY_LEAD_PIPES = 23,
	EAST_CARRY_TUBE = 24,
};

// Size: 0x4
enum class EAnimationPose : int32_t
{
	AP_Undefined = 0,
	AP_Standing = 1,
	AP_SittingChair = 2,
	AP_SittingGround = 3,
	AP_LyingGround = 4,
	AP_Crouching = 5,
	AP_SittingBench = 6,
	AP_SittingChairTable = 7,
};

// Size: 0x4
enum class EAttachLocation : int32_t
{
	eALRightHand = 0,
	eALLeftHand = 1,
	eALFreeBone = 2,
	eALAttachCount = 3,
	eALUndefined = 4,
};

// Size: 0x4
enum class EAutoScanMode : int32_t
{
	ASM_GEOMETRY = 0,
	ASM_VOLUMEBOX = 1,
};

// Size: 0x4
enum class EBaseMovementType : int32_t
{
	eMovementNone = -1,
	eMovementDead = 0,
	eMovementAgility = 1,
	eMovementShootingBallet = 2,
	eMovementAlign = 3,
	eMovementCover = 4,
	eMovementDrainPipe = 5,
	eMovementLadder = 6,
	eMovementPullVictimFromWindow = 7,
	eMovementFiberWireKill = 8,
	eMovementDumpBody = 9,
	eMovementThrowBodyOverRail = 10,
	eMovementDumpBodyOverLedge = 11,
	eMovementOperateCPDoor = 12,
	eMovementDisguiseSafeZone = 13,
	eMovementHideInCloset = 14,
	eMovementHumanShield = 15,
	eMovementTakeDown = 16,
	eMovementCloseCombat = 17,
	eMovementRecoveryFinisher = 18,
	eMovementContextAction = 19,
	eMovementSubaction = 20,
	eMovementVentilatorShaft = 21,
	eMovementGrabVictim = 22,
	eMovementPushVictimThroughWindowAndRail = 23,
	eMovementContextKill = 24,
	eMovementKickVictimOverLedge = 25,
	eMovementDragBody = 26,
	eMovementTakeClothes = 27,
	eMovementCoupDeGrace = 28,
	eMovementThrow = 29,
	eMovementPlace = 30,
	eMovementSurrender = 31,
	eMovementFrisk = 32,
	eMovementShowItem = 33,
	eMovementPickupItem = 34,
	eMovementPeek = 35,
	eMovementFocusedInteraction = 36,
	eMovementLocomotion = 37,
	eMovementLast = 38,
};

// Size: 0x4
enum class EBehaviorTreeVariableType : int32_t
{
	BTVT_Invalid = -1,
	BTVT_SceneReference = 0,
	BTVT_Contextual = 1,
	BTVT_Dynamic = 2,
	BTVT_NumTypes = 3,
};

// Size: 0x4
enum class EBoolCheckType : int32_t
{
	eBCT_IGNORE = 0,
	eBCT_TRUE = 1,
	eBCT_FALSE = 2,
};

// Size: 0x4
enum class EBooleanOption : int32_t
{
	BO_Off = 0,
	BO_On = 1,
	BO_Default = 2,
};

// Size: 0x4
enum class EBulletType : int32_t
{
	BULLET_TYPE_NONE = 0,
	BULLET_TYPE_GUN = 1,
	BULLET_TYPE_REVOLVER = 2,
	BULLET_TYPE_SMG = 3,
	BULLET_TYPE_MG = 4,
	BULLET_TYPE_RIFLE = 5,
	BULLET_TYPE_SHOTGUN = 6,
	BULLET_TYPE_SNIPER = 7,
	BULLET_TYPE_RPG = 8,
};

// Size: 0x4
enum class EButtonDisplay : int32_t
{
	BUTTON_DISPLAY_AT_OPENDOOR = 0,
	BUTTON_DISPLAY_AT_PICKUP = 1,
	BUTTON_DISPLAY_AT_STARTDIALOG = 2,
	BUTTON_DISPLAY_AT_RESET = 3,
	BUTTON_DISPLAY_AT_OUTFIT = 4,
	BUTTON_DISPLAY_AT_CLOTHBUNDLE = 5,
	BUTTON_DISPLAY_AT_DRAGBODY = 6,
	BUTTON_DISPLAY_AT_HUMANSHIELD = 7,
	BUTTON_DISPLAY_AT_RELEASEHUMANSHIELD = 8,
	BUTTON_DISPLAY_AT_KILLHUMANSHIELD = 9,
	BUTTON_DISPLAY_AT_SWITCHBOX = 10,
	BUTTON_DISPLAY_AT_SWAPITEM = 11,
	BUTTON_DISPLAY_AT_DUMPBODY = 12,
	BUTTON_DISPLAY_AT_OPENLID = 13,
	BUTTON_DISPLAY_AT_CHECKPOINTDOOR = 14,
	BUTTON_DISPLAY_AT_SIMPLE = 15,
	BUTTON_DISPLAY_AT_ENTERCLOSET = 16,
	BUTTON_DISPLAY_AT_EXITCLOSET = 17,
	BUTTON_DISPLAY_AT_ENTERSAFEZONE = 18,
	BUTTON_DISPLAY_AT_EXITSAFEZONE = 19,
	BUTTON_DISPLAY_AT_DISABLEFUSEBOX = 20,
	BUTTON_DISPLAY_AT_CONTAINERFLUSHBODY = 21,
	BUTTON_DISPLAY_AT_CONTEXTACTION = 22,
	BUTTON_DISPLAY_AT_VENTILATORSHAFT = 23,
	BUTTON_DISPLAY_AT_HEALTHSTATION = 24,
	BUTTON_DISPLAY_AT_KEYCARDREADER = 25,
	BUTTON_DISPLAY_AT_ITEMCONTAINER = 26,
	BUTTON_DISPLAY_AT_USE_QUICK = 27,
	BUTTON_DISPLAY_AT_USE = 28,
	BUTTON_DISPLAY_SHOOTING_BALLET = 29,
	BUTTON_DISPLAY_SHOOTING_BALLET_START = 30,
	BUTTON_DISPLAY_SHOOTING_BALLET_ZOOM = 31,
	BUTTON_DISPLAY_SHOOTING_BALLET_TAG = 32,
	BUTTON_DISPLAY_SHOOTING_BALLET_CANCEL = 33,
	BUTTON_DISPLAY_SHOOTING_BALLET_SLOWDOWN = 34,
	BUTTON_DISPLAY_SHOOTING_BALLET_CINEMATIC = 35,
	BUTTON_DISPLAY_SHOOTING_BALLET_HOLD_CAMERA = 36,
	BUTTON_DISPLAY_SHOOTING_BALLET_NEXT_CAMERA = 37,
	BUTTON_DISPLAY_RELOAD = 38,
	BUTTON_DISPLAY_HOLSTER = 39,
	BUTTON_DISPLAY_CHANGE_WEAPON_MODE = 40,
	BUTTON_DISPLAY_REMOTE_DETONATE = 41,
	BUTTON_DISPLAY_INVENTORY_ACCEPT = 42,
	BUTTON_DISPLAY_INVENTORY_CANCEL = 43,
	BUTTON_DISPLAY_HINTMESSAGE_CONTINUE = 44,
	BUTTON_DISPLAY_CLOSECOMBAT_TAKEDOWN = 45,
	BUTTON_DISPLAY_CLOSECOMBAT_COUNTERATTACK = 46,
	BUTTON_DISPLAY_CLOSECOMBAT_SILENT = 47,
	BUTTON_DISPLAY_CLOSECOMBAT_SNAPNECK = 48,
	BUTTON_DISPLAY_CLOSECOMBAT_CHOKE = 49,
	BUTTON_DISPLAY_CLOSECOMBAT_CHOKE_TARGET = 50,
	BUTTON_DISPLAY_CLOSECOMBAT_CHAIN_HIT = 51,
	BUTTON_DISPLAY_PISTOL_FINISHER = 52,
	BUTTON_DISPLAY_PEEK_VENT = 53,
	BUTTON_DISPLAY_PEEK_CLOSET = 54,
	BUTTON_DISPLAY_CLIMB_LADDER = 55,
	BUTTON_DISPLAY_SLIDE_LADDER = 56,
	BUTTON_DISPLAY_LEDGE = 57,
	BUTTON_DISPLAY_LEDGE_STEPON = 58,
	BUTTON_DISPLAY_LEDGEJUMP = 59,
	BUTTON_DISPLAY_LEDGE_PULL_UP = 60,
	BUTTON_DISPLAY_LEDGE_CLIMB_DOWN = 61,
	BUTTON_DISPLAY_LEDGE_DROP_DOWN = 62,
	BUTTON_DISPLAY_WINDOW = 63,
	BUTTON_DISPLAY_WINDOWSNEAK = 64,
	BUTTON_DISPLAY_PULLVICTIM = 65,
	BUTTON_DISPLAY_PUSHVICTIM = 66,
	BUTTON_DISPLAY_SURRENDER = 67,
	BUTTON_DISPLAY_COVERTOCOVER = 68,
	BUTTON_DISPLAY_COVERCORNER = 69,
	BUTTON_DISPLAY_COVEREXITFORWARD = 70,
	BUTTON_DISPLAY_COVERSCALEEXIT = 71,
	BUTTON_DISPLAY_TAKEDISGUISE = 72,
	BUTTON_DISPLAY_VENTILATOR_EXIT = 73,
	BUTTON_DISPLAY_DROPBODY = 74,
	BUTTON_DISPLAY_ABORT_CHECKPOINTDOOR = 75,
	BUTTON_DISPLAY_QUICKSWAP = 76,
	BUTTON_DISPLAY_OPERATE_LEVER = 77,
	BUTTON_DISPLAY_CLOSECOMBAT_CHAIN_HIGH = 78,
	BUTTON_DISPLAY_CLOSECOMBAT_CHAIN_LOW = 79,
	BUTTON_DISPLAY_CLOSECOMBAT_CHAIN_COUNTER = 80,
	BUTTON_DISPLAY_FIBERWIRE_KILL = 81,
	BUTTON_DISPLAY_DROP_ITEM = 82,
	BUTTON_DISPLAY_ABORT_MINIGAME = 83,
	BUTTON_DISPLAY_CONTRACT_MARK = 84,
	BUTTON_DISPLAY_CONTRACT_UNMARK = 85,
	BUTTON_DISPLAY_COMPLY = 86,
	BUTTON_DISPLAY_MAX = 87,
};

// Size: 0x4
enum class EButtonPressType : int32_t
{
	BUTTON_PRESS = 0,
	BUTTON_HOLD = 1,
	BUTTON_REPEAT = 2,
	BUTTON_TAP = 3,
	BUTTON_ROTATE_CCW = 4,
	BUTTON_PRESS_TYPE_MAX = 5,
};

// Size: 0x4
enum class EButtonState : int32_t
{
	BUTTON_STATE_DISABLED = -1,
	BUTTON_STATE_NONE = 0,
	BUTTON_STATE_ENABLED = 1,
	BUTTON_STATE_PRESSED = 2,
	BUTTON_STATE_BLINKING = 3,
};

// Size: 0x4
enum class EBystanderPointType : int32_t
{
	BPT_Scared = 0,
	BPT_Alerted = 1,
};

// Size: 0x4
enum class ECCDUsage : int32_t
{
	ECCDUSAGE_DISABLED = 0,
	ECCDUSAGE_AGAINST_STATIC = 1,
	ECCDUSAGE_AGAINST_STATIC_DYNAMIC = 2,
};

// Size: 0x4
enum class ECCDecalEffect : int32_t
{
	eCCDecalEffect_None = 0,
	eCCDecalEffect_Stab = 1,
	eCCDecalEffect_Blunt1H = 2,
	eCCDecalEffect_Blunt2H = 3,
	eCCDecalEffect_Slash1H = 4,
	eCCDecalEffect_Shatter = 5,
	eCCDecalEffect_AxeCleave = 6,
	eCCDecalEffect_AxePull = 7,
	eCCDecalEffect_AxeSlitThroat = 8,
	eCCDecalEffect_SlitThroat = 9,
	eCCDecalEffect_FacePunch = 10,
	eCCDecalEffect_Bruise = 11,
};

// Size: 0x4
enum class ECCEmitterEffect : int32_t
{
	eCCEmitterEffect_None = 0,
	eCCEmitterEffect_Stab = 1,
	eCCEmitterEffect_Blunt1H = 2,
	eCCEmitterEffect_Blunt2H = 3,
	eCCEmitterEffect_Slash1H = 4,
	eCCEmitterEffect_Shatter = 5,
	eCCEmitterEffect_AxeCleave = 6,
	eCCEmitterEffect_AxePull = 7,
	eCCEmitterEffect_AxeSlitThroat = 8,
	eCCEmitterEffect_SlitThroat = 9,
	eCCEmitterEffect_FacePunch = 10,
	eCCEmitterEffect_Blood = 11,
};

// Size: 0x4
enum class ECCNodeSubtype : int32_t
{
	eCCNodeSubtype_Left = 0,
	eCCNodeSubtype_Right = 1,
	eCCNodeSubtype_Front = 2,
	eCCNodeSubtype_Back = 3,
	eCCNodeSubtype_StairsAbove = 4,
	eCCNodeSubtype_StairsBelow = 5,
	eCCNodeSubtype_StairsAbove_Back = 6,
	eCCNodeSubtype_StairsBelow_Back = 7,
	eCCNodeSubtype_Front_Back = 8,
	eCCNodeSubtype_Count = 9,
};

// Size: 0x4
enum class ECCNodeType : int32_t
{
	eCCNodeType_Counter = 0,
	eCCNodeType_ExecutePistol = 1,
	eCCNodeType_React = 2,
	eCCNodeType_SilentTakeDownEnd = 3,
	eCCNodeType_SilentKill = 4,
	eCCNodeType_SlitThroat1H = 5,
	eCCNodeType_Swing1H = 6,
	eCCNodeType_Bash1H = 7,
	eCCNodeType_Stab1H = 8,
	eCCNodeType_Syringe1H = 9,
	eCCNodeType_Strangle1H = 10,
	eCCNodeType_Smash1H = 11,
	eCCNodeType_Swing2H = 12,
	eCCNodeType_Stab2H = 13,
	eCCNodeType_Bash2H = 14,
	eCCNodeType_Strangle2H = 15,
	eCCNodeType_Axe = 16,
	eCCNodeType_Sword1H = 17,
	eCCNodeType_AttackChain = 18,
	eCCNodeType_AttackChainCivilian = 19,
	eCCNodeType_AttackChainHeavy = 20,
	eCCNodeType_FailChain = 21,
	eCCNodeType_FinishChainHigh = 22,
	eCCNodeType_FinishChainLow = 23,
	eCCNodeType_FinishChainKill = 24,
	eCCNodeType_StairsChain = 25,
	eCCNodeType_CounterChain = 26,
	eCCNodeType_AttackIdle = 27,
	eCCNodeType_AttackPassify = 28,
	eCCNodeType_FailChainPush = 29,
	eCCNodeType_Count = 30,
};

// Size: 0x4
enum class ECCWeaponAnimSet : int32_t
{
	AS_SLIT_THROAT_1H = 0,
	AS_SWING_1H = 1,
	AS_BASH_1H = 2,
	AS_STAB_1H = 3,
	AS_SYRINGE_1H = 4,
	AS_SMASH_1H = 5,
	AS_STRANGLE = 6,
	AS_SWING_2H = 7,
	AS_BASH_2H = 8,
	AS_STAB_2H = 9,
	AS_STRANGLE_2H = 10,
	AS_SWORD_1H = 11,
	AS_AXE = 12,
};

// Size: 0x4
enum class ECOMUsage : int32_t
{
	ECOMUSAGE_AUTOCOMPUTE = 0,
	ECOMUSAGE_PIVOT = 1,
};

// Size: 0x4
enum class ECameraControls : int32_t
{
	eCameraControlsNormal = 0,
	eCameraControlsOTS = 1,
};

// Size: 0x4
enum class ECameraOffset_old : int32_t
{
	eCameraOffset_Center = 0,
	eCameraOffset_Left = 1,
	eCameraOffset_Right = 2,
};

// Size: 0x4
enum class ECameraShakerChannel : int32_t
{
	eCameraShakerChannel_Default = 0,
	eCameraShakerChannle_Locomotion = 1,
	eCameraShakerChannel_Ambient = 2,
	eCameraShakerChannel_Weapon = 3,
	eCameraShakerChannel_CloseCombat = 4,
	eCameraShakerChannel_Num = 5,
};

// Size: 0x4
enum class ECameraState : int32_t
{
	eCamSneakStand = 0,
	eCamSneakWalk = 1,
	eCamSneakRoadyRun = 2,
	eCamNormalStand = 3,
	eCamNormalWalk = 4,
	eCamNormalRun = 5,
	eCamLocomotion = 6,
	eCamCrowdStand = 7,
	eCamCrowdWalk = 8,
	eCamCrowdRun = 9,
	eCamCrowdSneakStand = 10,
	eCamCrowdSneakWalk = 11,
	eCamCrowdSneakRoadyRun = 12,
	eCamCrowdLocomotion = 13,
	eCamDead = 14,
	eCamLadder = 15,
	eCamDrainPipe = 16,
	eCamDrag = 17,
	eCamHumanShield = 18,
	eCamSBTag = 19,
	eCamSBTagOTS = 20,
	eCamCloseCombat = 21,
	eCamFiberWire = 22,
	eCamWindowPull = 23,
	eCamRailPush = 24,
	eCamLedgeKick = 25,
	eCamLedgePull = 26,
	eCamLedgeHang = 27,
	eCamLedgeWalk = 28,
	eCamLedgeWalkOTS = 29,
	eCamCoverLow = 30,
	eCamCoverMedium = 31,
	eCamCoverHigh = 32,
	eCamCoverLowOTS = 33,
	eCamCoverHighOTS = 34,
	eCamCoverLowScope = 35,
	eCamCoverHighScope = 36,
	eCamCoverLowTakedownOver = 37,
	eCamCoverLowTakedownCorner = 38,
	eCamCoverHighTakedownCorner = 39,
	eCamTakeDisguise = 40,
	eCamOTS = 41,
	eCamOTSHigh = 42,
	eCamOTSLow = 43,
	eCamUnAimedShooting = 44,
	eCamUnAimedShootingHigh = 45,
	eCamUnAimedShootingLow = 46,
	eCamScope = 47,
	eCamScopeHigh = 48,
	eCamScopeLow = 49,
	eCamVaultLow = 50,
	eCamVaultHigh = 51,
	eCamTakedown = 52,
	eCamTakedownChair = 53,
	eCamNumProfiles = 54,
	eCamAll = 55,
};

// Size: 0x4
enum class ECautiousDisturbanceState : int32_t
{
	eCDS_Pending = 0,
	eCDS_Expired = 1,
	eCDS_Handled = 2,
	eCDS_GetHelpGroup = 3,
	eCDS_InvestigationGroup = 4,
	eCDS_InvestigateAfterExplosion = 5,
	eCDS_Ignored = 6,
	eCDS_NoInvestigator = 7,
	eCDS_Similar = 8,
	eCDS_ManHunt = 9,
	eCDS_CombatSuppressGunshots = 10,
};

// Size: 0x4
enum class ECharSetCharacterType : int32_t
{
	ECSCT_Actor = 0,
	ECSCT_Nude = 1,
	ECSCT_HeroA = 2,
	ECSCT_HeroB = 3,
	ECSCT_HeroC = 4,
};

// Size: 0x4
enum class ECheatGroup : int32_t
{
	eCGNone = 0,
	eCGPistols = 1,
	eCGSMGs = 2,
	eCGAssaultRifles = 3,
	eCGShotguns = 4,
	eCGSniper = 5,
	eCGExotics = 6,
	eCGDevices = 7,
};

// Size: 0x4
enum class EClipSpawnAxis : int32_t
{
	eCSA_XPos = 0,
	eCSA_XNeg = 1,
	eCSA_YPos = 2,
	eCSA_YNeg = 3,
	eCSA_ZPos = 4,
	eCSA_ZNeg = 5,
};

// Size: 0x4
enum class EClothBendConstrainType : int32_t
{
	eClothBendConstrainType_Stick = 0,
	eClothBendConstrainType_Triangle = 1,
};

// Size: 0x4
enum class EClothColliderFilter : int32_t
{
	EClothColliderFilter_Environment = 0,
	EClothColliderFilter_Character = 1,
	EClothColliderFilter_Character_Environment = 2,
};

// Size: 0x4
enum class EClothStretchConstrainType : int32_t
{
	eClothBendConstrainType_Anchor = 0,
	eClothBendConstrainType_LRA = 1,
	eClothBendConstrainType_None = 2,
};

// Size: 0x4
enum class ECollidableLayer : int32_t
{
	eCollLayer_COLLIDE_WITH_ALL = 0,
	eCollLayer_STATIC_COLLIDABLES_ONLY = 1,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY = 2,
	eCollLayer_STAIRS = 3,
	eCollLayer_SHOT_ONLY_COLLISION = 4,
	eCollLayer_DYNAMIC_CLOTH_ONLY = 5,
	eCollLayer_DYNAMIC_TRASH_COLLIDABLES = 6,
	eCollLayer_KINEMATIC_COLLIDABLES_ONLY = 7,
	eCollLayer_CHARACTER_CLOTHING_ONLY = 8,
	eCollLayer_STATIC_COLLIDABLES_ONLY_TRANSPARENT = 9,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY_TRANSPARENT = 10,
	eCollLayer_KINEMATIC_COLLIDABLES_ONLY_TRANSPARENT = 11,
	eCollLayer_STAIRS_STEPS = 12,
	eCollLayer_STAIRS_SLOPE = 13,
	eCollLayer_AUXILIARY = 14,
	eCollLayer_HERO_PROXY = 15,
	eCollLayer_ACTOR_PROXY = 16,
	eCollLayer_CLIP = 17,
	eCollLayer_ACTOR_RAGDOLL = 18,
	eCollLayer_CROWD_RAGDOLL = 19,
	eCollLayer_LEDGE_ANCHOR = 20,
	eCollLayer_ACTOR_DYN_BODY = 21,
	eCollLayer_HERO_DYN_BODY = 22,
	eCollLayer_ITEMS = 23,
	eCollLayer_WEAPONS = 24,
	eCollLayer_COLLISION_VOLUME_HITMAN_ON = 25,
	eCollLayer_COLLISION_VOLUME_HITMAN_OFF = 26,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY_NO_CHARACTER = 27,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY_NO_CHARACTER_TRANSPARENT = 28,
	eCollLayer_COLLIDE_WITH_STATIC_ONLY = 29,
	eCollLayer_AI_VISION_BLOCKER = 30,
	eCollLayer_AI_VISION_BLOCKER_AMBIENT_ONLY = 31,
	eCollayer_UNUSED_LAST = 32,
};

// Size: 0x4
enum class ECollidableShape : int32_t
{
	ECOLLIDABLESHAPE_SPHERE = 0,
	ECOLLIDABLESHAPE_CAPSULE = 1,
	ECOLLIDABLESHAPE_BOX = 2,
};

// Size: 0x4
enum class ECollidablesType : int32_t
{
	ECST_STATIC_AND_DYNAMIC = 0,
	ECST_STATIC_ONLY = 1,
	ECST_DYNAMIC_ONLY = 2,
};

// Size: 0x4
enum class ECollisionPriority : int32_t
{
	ECOLLISIONPRIORITY_LOW = 0,
	ECOLLISIONPRIORITY_NORMAL = 1,
	ECOLLISIONPRIORITY_HIGH = 2,
	ECOLLISIONPRIORITY_CRITICAL = 3,
};

// Size: 0x1
enum class ECollisionResponse : int8_t
{
	REFLECT_VELOCITY = 0,
	SLIDE_ON = 1,
	STAY_AT_COLLISION_POINT = 2,
	CUSTOM = 3,
};

// Size: 0x4
enum class ECombatZoneState : int32_t
{
	CZS_Inactive = 0,
	CZS_Triggered = 1,
	CZS_Engaged = 2,
};

// Size: 0x4
enum class ECommunicationBarMessage : int32_t
{
	ECBM_Unknown = 0,
	ECBM_Spotted = 1,
	ECBM_Frisking = 2,
	ECBM_HostileArea = 3,
	ECBM_InvestigatingArea = 4,
	ECBM_Clear = 5,
	ECBM_Suspicious = 6,
	ECBM_Alerted = 7,
	ECBM_Hunting = 8,
	ECBM_Arresting = 9,
	ECBM_Hostile = 10,
	ECBM_IdentityKnown = 11,
	ECBM_Agitated = 12,
	ECBM_VipRunsToSafeArea = 13,
	ECBM_VipEscaping = 14,
	ECBM_BodyFound = 15,
	ECBM_GunshotHeard = 16,
	ECBM_CloseCombatHeard = 17,
	ECBM_CrimeNoticed = 18,
	ECBM_BulletImpactNoticed = 19,
	ECBM_SpottedByCamera = 20,
	ECBM_UnconsciousWitness = 21,
};

// Size: 0x4
enum class ECommunicationBarState : int32_t
{
	COMMUNICATION_BAR_NONE = 0,
	COMMUNICATION_BAR_CLEAR = 1,
	COMMUNICATION_BAR_SEARCHING = 2,
	COMMUNICATION_BAR_SUSPICIOUS = 3,
	COMMUNICATION_BAR_HUNTING = 4,
	COMMUNICATION_BAR_HOSTILE = 5,
	COMMUNICATION_BAR_BLOOD_FOUND = 6,
	COMMUNICATION_BAR_BODY_FOUND = 7,
	COMMUNICATION_BAR_GUARDS_ALERTED = 8,
	COMMUNICATION_BAR_BACKUP_ARRIVED = 9,
};

// Size: 0x4
enum class ECompiledBehaviorType : int32_t
{
	BT_ConditionScope = 0,
	BT_Random = 1,
	BT_Match = 2,
	BT_Sequence = 3,
	BT_BEHAVIORS_BEGIN = 4,
	BT_Dummy = 4,
	BT_Dummy2 = 5,
	BT_Error = 6,
	BT_Wait = 7,
	BT_WaitBasedOnDistanceToTarget = 8,
	BT_WaitForItemHandled = 9,
	BT_AbandonOrder = 10,
	BT_CompleteOrder = 11,
	BT_PlayAct = 12,
	BT_PlayReaction = 13,
	BT_SimpleReaction = 14,
	BT_SituationAct = 15,
	BT_SituationApproach = 16,
	BT_SituationGetHelp = 17,
	BT_SituationFace = 18,
	BT_SituationConversation = 19,
	BT_Holster = 20,
	BT_SpeakWait = 21,
	BT_Pickup = 22,
	BT_Drop = 23,
	BT_MoveTo = 24,
	BT_Reposition = 25,
	BT_SituationMoveTo = 26,
	BT_FormationMove = 27,
	BT_SituationJumpTo = 28,
	BT_AmbientWalk = 29,
	BT_AmbientStand = 30,
	BT_CrowdAmbientStand = 31,
	BT_AmbientItemUse = 32,
	BT_AmbientLook = 33,
	BT_Act = 34,
	BT_Patrol = 35,
	BT_MoveToPosition = 36,
	BT_AlertedStand = 37,
	BT_AlertedDebug = 38,
	BT_AttentionToPerson = 39,
	BT_CuriousInvestigate = 40,
	BT_CuriousIdle = 41,
	BT_InvestigateWeapon = 42,
	BT_DeliverWeapon = 43,
	BT_RecoverUnconscious = 44,
	BT_GetOutfit = 45,
	BT_RadioCall = 46,
	BT_EscortOut = 47,
	BT_CautiousSearchPosition = 48,
	BT_LockdownWarning = 49,
	BT_WakeUpUnconscious = 50,
	BT_DeadBodyInvestigate = 51,
	BT_GuardDeadBody = 52,
	BT_DragDeadBody = 53,
	BT_CuriousBystander = 54,
	BT_StandOffArrest = 55,
	BT_StandOffReposition = 56,
	BT_StandAndAim = 57,
	BT_CloseCombat = 58,
	BT_MoveToCloseCombat = 59,
	BT_MoveAwayFromCloseCombat = 60,
	BT_Fight = 61,
	BT_CoverFight = 62,
	BT_ShootFromPosition = 63,
	BT_StandAndShoot = 64,
	BT_HoldCoverPosition = 65,
	BT_CheckLastPosition = 66,
	BT_ProtoCombatHandleHumanShield = 67,
	BT_ProtoSearchIdle = 68,
	BT_ProtoApproachSearchArea = 69,
	BT_ProtoSearchPosition = 70,
	BT_ShootTarget = 71,
	BT_TriggerAlarm = 72,
	BT_MoveInCover = 73,
	BT_MoveToCover = 74,
	BT_AgitatedPatrol = 75,
	BT_AgitatedGuard = 76,
	BT_HeroEscort = 77,
	BT_Escort = 78,
	BT_EscortFormation = 79,
	BT_EscortSearch = 80,
	BT_LeadEscort = 81,
	BT_LeadEscort2 = 82,
	BT_AimReaction = 83,
	BT_FollowHitman = 84,
	BT_RideTheLightning = 85,
	BT_Scared = 86,
	BT_Flee = 87,
	BT_AgitatedBystander = 88,
	BT_SentryFrisk = 89,
	BT_SentryIdle = 90,
	BT_SentryWarning = 91,
	BT_SentryCheckItem = 92,
	BT_VIPScared = 93,
	BT_VIPSafeRoomTrespasser = 94,
	BT_DefendVIP = 95,
	BT_CautiousVIP = 96,
	BT_CautiousGuardVIP = 97,
	BT_Smart = 98,
	BT_SpeakTest = 99,
	BT_Conversation = 100,
	BT_RunToHelp = 101,
	BT_BEHAVIORS_END = 102,
	BT_COMMANDS_BEGIN = 103,
	BT_RenewEvent = 103,
	BT_ExpireEvent = 104,
	BT_SetEventHandled = 105,
	BT_RenewSharedEvent = 106,
	BT_ExpireSharedEvent = 107,
	BT_ExpireAllEvents = 108,
	BT_CreateOrJoinSituation = 109,
	BT_JoinSituation = 110,
	BT_JoinSituationWithActor = 111,
	BT_LeaveSituation = 112,
	BT_GotoPhase = 113,
	BT_RenewGoal = 114,
	BT_ExpireGoal = 115,
	BT_RenewGoalOf = 116,
	BT_SetTension = 117,
	BT_TriggerSpotted = 118,
	BT_CopyKnownLocation = 119,
	BT_UpdateKnownLocation = 120,
	BT_Speak = 121,
	BT_Log = 122,
	BT_COMMANDS_END = 123,
	BT_Invalid = 124,
};

// Size: 0x4
enum class ECompiledConditionType : int32_t
{
	CT_IsCurrent = 0,
	CT_Current = 1,
	CT_IsExpired = 2,
	CT_HasGoal = 3,
	CT_HasUnhandledGoal = 4,
	CT_MaxActorsWithGoal = 5,
	CT_MinExpired = 6,
	CT_MaxExpired = 7,
	CT_MinAge = 8,
	CT_MaxAge = 9,
	CT_IsSharedOlder = 10,
	CT_IsSharedEventCurrent = 11,
	CT_SharedEventCurrent = 12,
	CT_IsSharedEventExpired = 13,
	CT_MinSharedEventExpired = 14,
	CT_MaxSharedEventExpired = 15,
	CT_MinSharedEventAge = 16,
	CT_MaxSharedEventAge = 17,
	CT_IsNull = 18,
	CT_IsEqual = 19,
	CT_IsOfType = 20,
	CT_IsOfActorType = 21,
	CT_IsOfActorRank = 22,
	CT_IsOfActorRole = 23,
	CT_IsActorRoleBodyguard = 24,
	CT_IsActorRoleVIP = 25,
	CT_HasTension = 26,
	CT_HasTensionOrHigher = 27,
	CT_IsAIModified = 28,
	CT_HasSameOutfit = 29,
	CT_IsLegal = 30,
	CT_IsItemLegalOnHitman = 31,
	CT_IsItemIllegalOnHitman = 32,
	CT_IsItemSuspiciousOnHitman = 33,
	CT_AreVisibleItemsLegal = 34,
	CT_AreVisibleItemsIllegal = 35,
	CT_AreVisibleItemsSuspicious = 36,
	CT_AreVisibleWeaponsLegal = 37,
	CT_AreVisibleWeaponsIllegal = 38,
	CT_AreVisibleWeaponsSuspicious = 39,
	CT_OnlyLegalWeaponsDropped = 40,
	CT_IllegalWeaponDropped = 41,
	CT_SuspiciousWeaponDropped = 42,
	CT_OnlyLegalItemsDropped = 43,
	CT_IllegalItemDropped = 44,
	CT_SuspiciousItemDropped = 45,
	CT_OnlyLegalWeaponsPickedUp = 46,
	CT_IllegalWeaponPickedUp = 47,
	CT_SuspiciousWeaponPickedUp = 48,
	CT_OnlyLegalItemsPickedUp = 49,
	CT_IllegalItemPickedUp = 50,
	CT_SuspiciousItemPickedUp = 51,
	CT_MinDistance = 52,
	CT_MaxDistance = 53,
	CT_MinActualDistance = 54,
	CT_MaxActualDistance = 55,
	CT_ActualInsideSlice = 56,
	CT_MaxDistanceToKnownPosition = 57,
	CT_InSituation = 58,
	CT_SituationTarget = 59,
	CT_SituationHuntTarget = 60,
	CT_IsSituationTarget = 61,
	CT_SituationFromActors = 62,
	CT_SituationFromTarget = 63,
	CT_MaxSituationAge = 64,
	CT_MinSituationAge = 65,
	CT_InPhase = 66,
	CT_MinPhaseAge = 67,
	CT_MaxPhaseAge = 68,
	CT_IsOrderInvalid = 69,
	CT_IsSituationOlderThanSharedEvent = 70,
	CT_HasOrder = 71,
	CT_HasPendingOrder = 72,
	CT_Breakpoint = 73,
	CT_Cooldown = 74,
	CT_Trigger = 75,
	CT_IsInSniperIsland = 76,
	CT_SituationIsType = 77,
	CT_IntRuntimeParamEqualsTo = 78,
	CT_IsCombatDisabled = 79,
	CT_CanJoinSituation = 80,
};

// Size: 0x4
enum class EControlButtonName : int32_t
{
	eCN_ABORT = 0,
	eCN_ACTION = 1,
	eCN_ACTIVATE_PROP = 2,
	eCN_AGILITY_DOWN = 3,
	eCN_AGILITY_ENTERWINDOW = 4,
	eCN_AGILITY_SNEAKPASTWINDOW = 5,
	eCN_AGILITY_THROWOVERRAIL = 6,
	eCN_AGILITY_UP = 7,
	eCN_AIM = 8,
	eCN_COVER_ENTER = 9,
	eCN_COVER_TAKEDOWN = 10,
	eCN_COVER_TO_COVER = 11,
	eCN_CROUCH = 12,
	eCN_DRAGBODY = 13,
	eCN_DUMPBODY = 14,
	eCN_FIBERWIRE = 15,
	eCN_HUMANSHIELD = 16,
	eCN_INSTINCT = 17,
	eCN_INVENTORY_HOLSTER = 18,
	eCN_INVENTORY_LONGRANGE = 19,
	eCN_INVENTORY_PROP = 20,
	eCN_INVENTORY_SHORTRANGE = 21,
	eCN_ITEM_DROP = 22,
	eCN_ITEM_THROW = 23,
	eCN_MELEE_HIT = 24,
	eCN_MELEE_TAKEDOWN = 25,
	eCN_PICKUP = 26,
	eCN_RUN = 27,
	eCN_SB_ACTIVATE = 28,
	eCN_SB_CANCEL = 29,
	eCN_SB_EXECUTE = 30,
	eCN_SB_REMOVETAG = 31,
	eCN_SHOOT = 32,
	eCN_NOTEBOOK = 33,
	eCN_PAUSE = 34,
	eCN_NO_ICON = 35,
};

// Size: 0x4
enum class EControlledStates : int32_t
{
	CS_HumanShield = 0,
	CS_CloseCombat = 1,
	CS_PuppetAct = 2,
};

// Size: 0x4
enum class EControllerButton : int32_t
{
	BUTTON_NONE = 0,
	BUTTON_CROSS = 1,
	BUTTON_TRIANGLE = 2,
	BUTTON_SQUARE = 3,
	BUTTON_CIRCLE = 4,
	BUTTON_UP = 5,
	BUTTON_RIGHT = 6,
	BUTTON_DOWN = 7,
	BUTTON_LEFT = 8,
	BUTTON_R1 = 9,
	BUTTON_R2 = 10,
	BUTTON_R3 = 11,
	BUTTON_R_STICK = 12,
	BUTTON_L1 = 13,
	BUTTON_L2 = 14,
	BUTTON_L3 = 15,
	BUTTON_L_STICK = 16,
	BUTTON_START = 17,
	BUTTON_SELECT = 18,
	BUTTON_UP_DOWN = 19,
	BUTTON_LEFT_RIGHT = 20,
	BUTTON_LEFT_RIGHT_UP_DOWN = 21,
	BUTTON_L1_R1 = 22,
	BUTTON_L2_R2 = 23,
	BUTTON_KEYBOARD = 24,
	BUTTON_ESCAPE = 25,
};

// Size: 0x4
enum class ECoordinateSpace : int32_t
{
	CSPACE_INVALID = 0,
	CSPACE_OBJECT_TO_WORLD = 1,
	CSPACE_OBJECT_TO_PARENT = 2,
	CSPACE_SEQUENCE_ORIGIN = 3,
	CSPACE_CHARACTER_RELATIVE = 4,
};

// Size: 0x4
enum class ECoverPosition : int32_t
{
	COVER_POSITION_NONE = 0,
	COVER_POSITION_LEFT = 1,
	COVER_POSITION_RIGHT = 2,
	COVER_POSITION_MIDDLE = 3,
};

// Size: 0x4
enum class ECrossHairType : int32_t
{
	CROSSHAIR_NONE = 0,
	CROSSHAIR_PISTOL = 1,
	CROSSHAIR_REVOLVER = 2,
	CROSSHAIR_SMG = 3,
	CROSSHAIR_RIFLE = 4,
	CROSSHAIR_SHOTGUN = 5,
	CROSSHAIR_SNIPER = 6,
	CROSSHAIR_HARDBALLER = 7,
	CROSSHAIR_UNAIMED = 8,
	CROSSHAIR_POINTER = 9,
	CROSSHAIR_WORLDCENTERMARKER = 10,
	CROSSHAIR_BLINDFIRE = 11,
};

// Size: 0x4
enum class ECrowdFlowCandidates : int32_t
{
	NONE = 0,
	EVERYONE = 1,
	SPAWNED_ON_FLOW = 2,
};

// Size: 0x4
enum class EDamageEvent : int32_t
{
	eDE_UNDEFINED = 0,
	eDE_InCloset = 1,
	eDE_Subdue = 2,
	eDE_CloseCombat = 4,
	eDE_HumanShield = 8,
	eDE_PushOver = 16,
	eDE_KickDownStairs = 32,
	eDE_DeadlyThrow = 64,
	eDE_Shoot = 128,
	eDE_Sedated = 256,
	eDE_InstantTakeDown = 512,
	eDE_CoupDeGrace = 1024,
	eDE_ContextKill = 2048,
	eDE_Garotte = 4096,
	eDE_Poison = 8192,
	eDE_Electric = 16384,
	eDE_SuspendedObject = 32768,
	eDE_Burn = 65536,
	eDE_Drop = 131072,
	eDE_Drown = 262144,
};

// Size: 0x4
enum class EDeathAnimationType : int32_t
{
	DAT_None = 0,
	DAT_SingleShot = 1,
	DAT_BurstShot = 2,
	DAT_HeavyShot = 3,
	DAT_Unknown = 4,
};

// Size: 0x4
enum class EDeathBehavior : int32_t
{
	eDB_IMPACT_ANIM = 0,
	eDB_NO_IMPACT_ANIM = 1,
	eDB_NO_VELOCITY = 2,
	eDB_NO_RAGDOLL = 3,
};

// Size: 0x4
enum class EDeathContext : int32_t
{
	eDC_UNDEFINED = 0,
	eDC_NOT_HERO = 1,
	eDC_HIDDEN = 2,
	eDC_ACCIDENT = 3,
	eDC_MURDER = 4,
};

// Size: 0x4
enum class EDeathType : int32_t
{
	eDT_UNDEFINED = 0,
	eDT_PACIFY = 1,
	eDT_KILL = 2,
	eDT_BLOODY_KILL = 3,
};

// Size: 0x4
enum class EDefaultCollidableLayer : int32_t
{
	DCL_STATIC = 0,
	DCL_KINEMATIC = 1,
	DCL_KINEMATIC_TRANSPARENT = 2,
	DCL_DYNAMIC = 3,
	DCL_DYNAMIC_TRANSPARENT = 4,
	DCL_AUXILIARY = 5,
	DCL_COLLIDE_ALL = 6,
	DCL_STATIC_TRANSPARENT = 7,
	DCL_COLLIDE_STATIC_ONLY = 8,
	DCL_UNUSED_LAST = 9,
};

// Size: 0x4
enum class EDetachUsage : int32_t
{
	EDU_NEVER = 0,
	EDU_ALWAYS = 1,
	EDU_RAGDOLL_ONLY = 2,
};

// Size: 0x4
enum class EDialogEventEndReason : int32_t
{
	EDialogEvent_Completed = 0,
	EDialogEvent_Stopped = 1,
};

// Size: 0x4
enum class EDifficultyParameter : int32_t
{
	EDP_Invalid = 0,
	EDP_AIAttentionGainMultiplier = 1,
	EDP_AIAudioPerceptionAlwaysEmitFootstepSoundEvents = 2,
	EDP_AIIllegalActionAttentionModifier = 3,
	EDP_AIInvestigateCautiousAttentionToPersonEnabled = 4,
	EDP_AIInvestigateDisguiseMembersFollowDistance = 5,
	EDP_AIRunningAttentionModifier = 6,
	EDP_AISuspiciousMovementDisguiseAttentionModifier = 7,
	EDP_AISuspiciousMovementSensorEnabled = 8,
	EDP_AllowInstinctGlow = 9,
	EDP_ArrestEscalateIllegalWeapon = 10,
	EDP_ArrestEscalateMaximum = 11,
	EDP_ArrestEscalateMoving = 12,
	EDP_ArrestEscalateRunning = 13,
	EDP_ArrestTargetLostTime = 14,
	EDP_CloseCombatChainFailDamage = 15,
	EDP_CloseCombatChoiceWindowLength = 16,
	EDP_CloseCombatChokePressCount_Civilian = 17,
	EDP_CloseCombatChokePressCount_Elite = 18,
	EDP_CloseCombatChokePressCount_Guard = 19,
	EDP_CloseCombatCounterEndLength = 20,
	EDP_CloseCombatCounterFailDamage = 21,
	EDP_CloseCombatShowSnapNeckPressCount_Civilian = 22,
	EDP_CloseCombatShowSnapNeckPressCount_Elite = 23,
	EDP_CloseCombatShowSnapNeckPressCount_Guard = 24,
	EDP_DisguiseRuiningEnabled = 25,
	EDP_GameMissionSaveLimit = 26,
	EDP_GameOpportunitiesEnabled = 27,
	EDP_HearRangeBulletImpact = 28,
	EDP_HearRangeBulletImpactOnBody = 29,
	EDP_HearRangeCloseCombatBreakNeck = 30,
	EDP_HearRangeCloseCombatChoke = 31,
	EDP_HearRangeCloseCombatFiberWire = 32,
	EDP_HearRangeCloseCombatHitFromBehind = 33,
	EDP_HearRangeCloseCombatL1 = 34,
	EDP_HearRangeCloseCombatL2 = 35,
	EDP_HearRangeCloseCombatL3 = 36,
	EDP_HearRangeEventAccident = 37,
	EDP_HearRangeEventAlarm = 38,
	EDP_HearRangeEventExplosion = 39,
	EDP_HearRangeEventRadio = 40,
	EDP_HearRangeEventStrange = 41,
	EDP_HearRangeEventThrownItem = 42,
	EDP_HearRangeFootstepHardCrouchRun = 43,
	EDP_HearRangeFootstepHardCrouchWalk = 44,
	EDP_HearRangeFootstepHardStandRun = 45,
	EDP_HearRangeFootstepHardStandWalk = 46,
	EDP_HearRangeFootstepNormalCrouchRun = 47,
	EDP_HearRangeFootstepNormalCrouchWalk = 48,
	EDP_HearRangeFootstepNormalStandRun = 49,
	EDP_HearRangeFootstepNormalStandWalk = 50,
	EDP_HearRangeFootstepSoftCrouchRun = 51,
	EDP_HearRangeFootstepSoftCrouchWalk = 52,
	EDP_HearRangeFootstepSoftStandRun = 53,
	EDP_HearRangeFootstepSoftStandWalk = 54,
	EDP_HearRangeFootstepVisionAreaLimitCrouchRun = 55,
	EDP_HearRangeFootstepVisionAreaLimitCrouchWalk = 56,
	EDP_HearRangeFootstepVisionAreaLimitStandRun = 57,
	EDP_HearRangeFootstepVisionAreaLimitStandWalk = 58,
	EDP_HearRangeGunEmpty = 59,
	EDP_HearRangeGunShot = 60,
	EDP_HearRangeGunSilenced = 61,
	EDP_HearRangeGunSuperSilenced = 62,
	EDP_HearRangeSpeakAngry = 63,
	EDP_HearRangeSpeakHelp = 64,
	EDP_HearRangeSpeakHelpLoud = 65,
	EDP_HearRangeSpeakPain = 66,
	EDP_HearRangeSpeakPainLow = 67,
	EDP_HearRangeSpeakWarning = 68,
	EDP_HitmanDamageReceivedMultiplier = 69,
	EDP_InstinctModeBurnRate = 70,
	EDP_InstinctRegenCap = 71,
	EDP_InstinctRegenRate = 72,
	EDP_ManhuntGroupMaxSearchTime = 73,
	EDP_ManhuntGroupSearchAreaHackMaxDistance = 74,
	EDP_ManhuntGroupSearchAreaRadius = 75,
	EDP_MaxCoverShootActorCountMultiplier = 76,
	EDP_MinAttentionToForceLookAt = 77,
	EDP_MinAttentionToForceLookAtIfIncreasing = 78,
	EDP_NPCDamageReceivedMultiplier = 79,
	EDP_PlayerDamagePerSecondDistance = 80,
	EDP_PlayerDamagePerSecondLimitFar = 81,
	EDP_PlayerDamagePerSecondLimitNear = 82,
	EDP_PlayerDamagePerSecondThreshold = 83,
	EDP_PlayerHitPointsMax = 84,
	EDP_PlayerHitPointsRegenerationDelay = 85,
	EDP_PlayerHitPointsRegenerationPerSecond = 86,
	EDP_SecurityCameras = 87,
	EDP_SightReactionMinAttention = 88,
	EDP_SightInvestigationMinAttention = 89,
	EDP_ShootingBalletBurnRateA = 90,
	EDP_ShootingBalletBurnRateB = 91,
	EDP_ShootingBalletPostFee = 92,
	EDP_ShootingBalletTimeAB = 93,
	EDP_ShootSpreadMax = 94,
	EDP_ShootSpreadMin = 95,
	EDP_ShootSpreadRange = 96,
	EDP_SocialGreetingAngle = 97,
	EDP_SocialGreetingCooldown = 98,
	EDP_SocialGreetingCooldownAlertLevel = 99,
	EDP_SocialGreetingCooldownLastSpeak = 100,
	EDP_SocialGreetingCooldownPlayer = 101,
	EDP_SocialGreetingCooldownSequence = 102,
	EDP_SocialGreetingDistance = 103,
	EDP_SocialLookAtTimeMax = 104,
	EDP_SocialLookAtTimeMin = 105,
	EDP_SocialSillyCooldown = 106,
	EDP_SocialSillyDistance = 107,
	EDP_SocialSillyTriggerTime = 108,
	EDP_SocialStandingCooldown = 109,
	EDP_SocialStandingDistance = 110,
	EDP_SocialStandingDistanceImmediate = 111,
	EDP_SocialStandingTriggerTime = 112,
	EDP_SpotHitmanShootingDistance = 113,
	EDP_StrictItemRules = 114,
	EDP_COUNT = 115,
};

// Size: 0x4
enum class EDisposalType : int32_t
{
	DISPOSAL_UNDEFINED = 0,
	DISPOSAL_NOTHING = 1,
	DISPOSAL_HOLSTER = 2,
	DISPOSAL_HIDE = 3,
	DISPOSAL_PLACE = 4,
	DISPOSAL_DROP = 5,
	DISPOSAL_DROP_HIDE = 6,
	DISPOSAL_DESTROY = 7,
	DISPOSAL_COUNT = 8,
};

// Size: 0x4
enum class EDisturbanceType : int32_t
{
	DT_Generic = 0,
	DT_SeeWeapon = 1,
	DT_BodyNeedsBagging = 2,
	DT_SoundCloseCombat = 3,
	DT_SoundGunSilenced = 4,
	DT_SoundBulletImpact = 5,
	DT_SoundNeckBreak = 6,
	DT_SoundSpeakPain = 7,
	DT_SoundGunshot = 8,
	DT_SoundExplosion = 9,
	DT_SeeExplosion = 10,
	DT_DeadBody = 11,
	DT_HitmanNearDeadBody = 12,
	DT_HitmanNearPacifiedBody = 13,
	DT_BloodPool = 14,
	DT_SeeOpenCPDoor = 15,
	DT_SeeTakeKeyCard = 16,
	DT_SeeTakeSecurityTape = 17,
	DT_SeeDisableFusebox = 18,
	DT_SeeChangeOutfit = 19,
	DT_SeeTrespasser = 20,
	DT_SeeBrokenDisguise = 21,
	DT_SeeIllegalWeapon = 22,
	DT_SeeDraggingBody = 23,
	DT_SeeDeath = 24,
	DT_SeeKilling = 25,
	DT_UnconsciousVictim = 26,
	DT_HuntTarget = 27,
	DT_CrowdAlerted = 28,
	DT_SeeGunshotVictim = 29,
	DT_SoundThrownItem = 30,
	DT_SoundThrownItemSeenThrowing = 31,
	DT_HitByItemOrCoin = 32,
	DT_PrivateAreaViolated = 33,
	DT_SetpieceInteraction = 34,
	DT_IllegalAction = 35,
	DT_KnockdownMelee = 36,
	DT_KnockdownThrow = 37,
	DT_BumpedTooMuch = 38,
	DT_Murder = 39,
	DT_Strangle = 40,
	DT_GotShot = 41,
	DT_MurderAttempt = 42,
	DT_LongTermMemory = 43,
	DT_MAX = 44,
};

// Size: 0x4
enum class EDynamicVariableType : int32_t
{
	DV_Invalid = -1,
	DV_Me = 0,
	DV_Hitman = 1,
	DV_InSight = 2,
	DV_RecentlyInSight = 3,
	DV_Sounds = 4,
	DV_NumVariables = 5,
};

// Size: 0x4
enum class EEntityOrdering : int32_t
{
	EO_LOW = 0,
	EO_NORMAL = 1,
	EO_HIGH = 2,
};

// Size: 0x4
enum class EEquipAbility : int32_t
{
	EA_EQUIP_IN_HANDS = 0,
	EA_CANNOT_BE_EQUIPPED = 1,
};

// Size: 0x4
enum class EFSMInternalEvent : int32_t
{
	eFSMEvent_Completed = 0,
	eFSMEvent_Failed = 1,
	eFSMEvent_Choice = 2,
	eFSMEvent_Max = 3,
};

// Size: 0x4
enum class EFSMStateStatus : int32_t
{
	eInactive = 0,
	eActive = 1,
	eCompleted = 2,
	eFailed = 3,
	eInterrupted = 4,
};

// Size: 0x4
enum class EFocusBarState : int32_t
{
	FOCUS_BAR_NORMAL = 0,
	FOCUS_BAR_INSTINCT = 1,
	FOCUS_BAR_BURNING = 2,
};

// Size: 0x4
enum class EFontFlags : int32_t
{
	FV_Original = 16,
	FV_NoAutoFit = 32,
	FV_Normal = 0,
	FV_Italic = 1,
	FV_Bold = 2,
	FV_BoldItalic = 3,
	FV_FauxItalic = 4,
	FV_FauxBold = 8,
	FV_FauxBoldItalic = 12,
};

// Size: 0x4
enum class EGSBodyPart : int32_t
{
	GSBODYPART_UNKNOWN = 0,
	GSBODYPART_HEAD = 1,
	GSBODYPART_TORSO = 2,
	GSBODYPART_ARM = 3,
	GSBODYPART_LEG = 4,
};

// Size: 0x4
enum class EGSEvent : int32_t
{
	GSEvent_StrayBullet = 0,
	GSEvent_TookDamage = 1,
	GSEvent_UsedCover = 2,
	GSEvent_UsedRun = 3,
	GSEvent_UsedEliminate = 4,
	GSEvent_UsedChokeOut = 5,
	GSEvent_UsedKnockOutByHand = 6,
	GSEvent_Pacified = 7,
	GSEvent_TargetPacified = 8,
	GSEvent_Recover = 9,
	GSEvent_CaughtArmed = 10,
	GSEvent_BodyFound = 11,
	GSEvent_BloodPoolFound = 12,
	GSEvent_InvestigateCurious = 13,
	GSEvent_NPCKilled = 14,
	GSEvent_KilledNPCHidden = 15,
	GSEvent_InvestigateCautious = 16,
	GSEvent_PrecisionAimedKill = 17,
	GSEvent_BlendInActivated = 18,
	GSEvent_PropKill = 19,
	GSEvent_SpottedThroughDisguise = 20,
	GSEvent_TakeOutNonLethal = 21,
	GSEvent_TargetKilled = 22,
	GSEvent_NonTargetKilled = 23,
	GSEvent_AllTargetsKilled = 24,
	GSEvent_AccidentKill = 25,
	GSEvent_ObjectiveUpdate = 26,
	GSEvent_TargetAccidentKill = 27,
	GSEvent_ObjectiveActivate = 28,
	GSEvent_Headshot = 29,
	GSEvent_Fiberwire = 30,
	GSEvent_UsedEliminateSilent = 31,
	GSEvent_ItemFound = 32,
	GSEvent_ItemStashed = 33,
	GSEvent_BodyBagPlaced = 34,
	GSEvent_Projectile_HeadShot = 35,
	GSEvent_Projectile_BodyShot = 36,
	GSEvent_Projectile_Crowd_HeadShot = 37,
	GSEvent_Projectile_Crowd_BodyShot = 38,
	GSEvent_Projectile_Missed = 39,
};

// Size: 0x4
enum class EGSExplodingPropType : int32_t
{
	eGSExplodingProp_Unknown = 0,
	eGSExplodingProp_Barrel = 1,
	eGSExplodingProp_PetrolCan = 2,
	eGSExplodingProp_GasCanister = 3,
	eGSExplodingProp_GasTank = 4,
	eGSExplodingProp_Mine = 5,
	eGSExplodingProp_Pig = 6,
	eGSExplodingProp_Pigeon = 7,
	eGSExplodingProp_FireworksBox = 8,
	eGSExplodingProp_Car = 9,
};

// Size: 0x4
enum class EGSKillSituation : int32_t
{
	GSKILLSITUATION_UNKNOWN = 0,
	GSKILLSITUATION_CLOSECOMBAT = 1,
	GSKILLSITUATION_SILENT = 2,
	GSKILLSITUATION_ENVIRONMENT = 3,
	GSKILLSITUATION_ACTION = 4,
	GSKILLSITUATION_SHOOTINGBALLET = 5,
	GSKILLSITUATION_DEADLYTHROW = 6,
	GSKILLSITUATION_PULLTHROUGHWINDOW = 7,
	GSKILLSITUATION_PUSHOVERRAILING = 8,
	GSKILLSITUATION_PACIFY = 9,
	GSKILLSITUATION_FIBERWIRE = 10,
};

// Size: 0x4
enum class EGSKillVictim : int32_t
{
	GSKILLVICTIM_UNKNOWN = 0,
	GSKILLVICTIM_CIVILIAN = 1,
	GSKILLVICTIM_GUARD = 2,
	GSKILLVICTIM_TARGET = 3,
};

// Size: 0x4
enum class EGait : int32_t
{
	eGait_Normal = 0,
	eGait_Reposition = 1,
	eGait_Alert = 2,
	eGait_Scared = 3,
	eGait_Prone = 4,
	eGait_Dead = 5,
	eGait_Angry = 6,
	eGait_Cheer = 7,
	eGait_Clap = 8,
	eGait_Party = 9,
	eGait_Mingle = 10,
	eGait_Protest = 11,
	eGait_Shop = 12,
	eGait_Excited = 13,
	eGait_Jeer = 14,
	eGait_Haggle = 15,
	eGait_Rally = 16,
	eGait_Chatting = 17,
	eGait_Concerned = 18,
	eGait_Custom0 = 19,
	eGait_Custom1 = 20,
	eGait_Custom2 = 21,
	eGait_Custom3 = 22,
	eGait_Custom4 = 23,
	eGait_Custom5 = 24,
	eGait_Custom6 = 25,
	eGait_Custom7 = 26,
	eGait_Custom8 = 27,
	eGait_Custom9 = 28,
};

// Size: 0x4
enum class EGameEventArgType : int32_t
{
	GE_ARGS_KILL = 0,
	GE_ARGS_PRIORITYKILL = 1,
	GE_ARGS_SITUATION = 2,
	GE_ARGS_INVENTORY = 3,
	GE_ARGS_SHOOTINGBALLET = 4,
	GE_ARGS_EXPLODINGPROP = 5,
	GE_ARGS_EVENT = 6,
	GE_ARGS_CHECKPOINTEVENT = 7,
	GE_ARGS_AI_SITUATION = 8,
};

// Size: 0x4
enum class EGameTension : int32_t
{
	EGT_Undefined = 0,
	EGT_Ambient = 1,
	EGT_Agitated = 2,
	EGT_Searching = 3,
	EGT_AlertedLow = 4,
	EGT_AlertedHigh = 5,
	EGT_Hunting = 6,
	EGT_Arrest = 7,
	EGT_Combat = 8,
};

// Size: 0x4
enum class EGameUIMenu : int32_t
{
	eUIMenu_IntroMenu = 0,
	eUIMenu_PauseMenu = 1,
	eUIMenu_PhoneMenu = 2,
	eUIMenu_MapMenu = 3,
	eUIMenu_ModalDialogMenu = 4,
	eUIMenu_GameplayMenu = 5,
	eUIMenu_InventorySelectorMenu = 6,
	eUIMenu_ActionSelectorMenu = 7,
	eUIMenu_ActionSelectorInventoryMenu = 8,
	eUIMenu_IntelSelectorMenu = 9,
	eUIMenu_NotebookMenu = 10,
	eUIMenu_LogbookMenu = 11,
	eUIMenu_TutorialMenu = 12,
	eUIMenu_SplashHintMenu = 13,
	eUIMenu_Count = 14,
};

// Size: 0x4
enum class EGestureCategory : int32_t
{
	EGC_None = 0,
	EGC_AmbientDialog = 1,
	EGC_TrespassWarn1 = 2,
	EGC_TrespassWarn2 = 3,
	EGC_TrespassWarn3 = 4,
	EGC_StopWarn = 5,
};

// Size: 0x4
enum class EGuardPointType : int32_t
{
	GPT_Hold = 0,
	GPT_Combat = 1,
	GPT_CombatAndHold = 2,
	GPT_VIPSafeRoom = 3,
};

// Size: 0x4
enum class EHM5GameInputFlag : int32_t
{
	eGameInputActionPerform = 0,
	eGameInputActionPickup = 1,
	eGameInputActionAbort = 2,
	eGameInputActionDoor = 3,
	eGameInputWeaponZoomIn = 4,
	eGameInputWeaponZoomOut = 5,
	eGameInputActionShoot = 6,
	eGameInputActionPrecisionShoot = 7,
	eGameInputAimOTS = 8,
	eGameInputCoverAction = 9,
	eGameInputCoverAlternativeAction = 10,
	eGameInputInventoryAccept = 11,
	eGameInputEquipCloseCombatProps = 12,
	eGameInputEquipCloseCombatPropsInverse = 13,
	eGameInputEquipShortRange = 14,
	eGameInputEquipLongRange = 15,
	eGameInputHolsterItem = 16,
	eGameInputDropItem = 17,
	eGameInputTogglePlacement = 18,
	eGameInputActivatePropQuick = 19,
	eGameInputActivateProp = 20,
	eGameInputActivatePropHold = 21,
	eGameInputActivatePropSecondary = 22,
	eGameInputShootingBalletActivate = 23,
	eGameInputShootingBalletExecute = 24,
	eGameInputShootingBalletCancel = 25,
	eGameInputShootingBalletHMView = 26,
	eGameInputGuideAction = 27,
	eGameInputGuideActionHold = 28,
	eGameInputGuideActionSecondary = 29,
	eGameInputGuideEnterWindow = 30,
	eGameInputGuideSneakPastWindow = 31,
	eGameInputGuideSneakPastWindowHold = 32,
	eGameInputGuideKill = 33,
	eGameInputSlideLadder = 34,
	eGameInputCloseCombat = 35,
	eGameInputFiberwire = 36,
	eGameInputCloseCombatCounter = 37,
	eGameInputCloseCombatTakeDown = 38,
	eGameInputCloseCombatDisarm = 39,
	eGameInputSurrender = 40,
	eGameInputShowItem = 41,
	eGameInputReload = 42,
	eGameInputTakeDisguise = 43,
	eGameInputDragDropBody = 44,
	eGameInputDumpBody = 45,
	eGameInputSneakToggle = 46,
	eGameInputCamSwitch = 47,
	eGameInputActivateRun = 48,
	eGameInputInstinctMode = 49,
	eGameInputContractTargetTag = 50,
	eGameInputThrow = 51,
	eGameInputCloseCombatChainHigh = 52,
	eGameInputCloseCombatChainLow = 53,
	eGameInputCloseCombatChainCounter = 54,
	eGameInputTakeHumanShield = 55,
	eGameInputSkipCutSequence = 56,
	eGameInputCloseCombatChoke = 57,
	eGameInputFocusedInteractionFaceUp = 58,
	eGameInputFocusedInteractionFaceLeft = 59,
	eGameInputFocusedInteractionFaceDown = 60,
	eGameInputFocusedInteractionLeftStickAnalog = 61,
	eGameInputActionsNUM = 62,
};

// Size: 0x4
enum class EHM5SoundBulletType : int32_t
{
	ESBT_SMALL = 0,
	ESBT_MEDIUM = 1,
	ESBT_LARGE = 2,
	ESBT_GORGEOUS = 3,
	ESBT_ANY = 4,
};

// Size: 0x4
enum class EHM5SoundCloseCombatEvent : int32_t
{
	ECCE_PUNCH_FACE = 0,
	ECCE_PUNCH_BODY = 1,
	ECCE_ATTACK_ELBOW = 2,
	ECCE_ATTACK_KNEE = 3,
	ECCE_ATTACK_KICK = 4,
	ECCE_SWOOSH_SHORT = 5,
	ECCE_SWOOSH_LONG = 6,
	ECCE_CLOTH_SWOOSH = 7,
	ECCE_CLOTH_RUSTLE = 8,
	ECCE_CLOTH_STRETCH = 9,
	ECCE_GRAB = 10,
	ECCE_BONE_BREAK = 11,
	ECCE_NECK_SNAP = 12,
	ECCE_BODY_FALL = 13,
	ECCE_SKULL_CRACK = 14,
	ECCE_ANY = 15,
};

// Size: 0x4
enum class EHM5SoundFootstepEmitterTarget : int32_t
{
	EFSAT_MAIN = 0,
	EFSAT_NPC = 1,
};

// Size: 0x4
enum class EHM5SoundFootstepEvent : int32_t
{
	EFSE_START = 0,
	EFSE_STOP = 1,
	EFSE_LEFT = 2,
	EFSE_RIGHT = 3,
	EFSE_TURN = 4,
	EFSE_SLIDE = 5,
	EFSE_JUMP = 6,
	EFSE_LAND = 7,
};

// Size: 0x4
enum class EHM5SoundFootstepStance : int32_t
{
	EFSS_SNEAK = 0,
	EFSS_SNEAKRUN = 1,
	EFSS_WALKSLOWLY = 2,
	EFSS_WALK = 3,
	EFSS_RUN = 4,
	EFSS_ANY = 5,
};

// Size: 0x4
enum class EHM5SoundFootwearType : int32_t
{
	EFWT_UNDEFINED = 0,
	EFWT_BAREFOOT = 1,
	EFWT_SLIPPERS = 2,
	EFWT_DISPOSABLE_SLIPPERS = 3,
	EFWT_SANDALS = 4,
	EFWT_SNEAKERS = 5,
	EFWT_SNEAKERS_METALLEG = 6,
	EFWT_LEATHER = 7,
	EFWT_FEMALE_LEATHER = 8,
	EFWT_BOOTS = 9,
	EFWT_COWBOY_BOOTS = 10,
	EFWT_FEMALE_COWBOY_BOOTS = 11,
	EFWT_RUBBER_BOOTS = 12,
	EFWT_HIGH_HEELS = 13,
	EFWT_LEATHER_KEYS = 14,
	EFWT_SWAT_BOOTS = 15,
};

// Size: 0x4
enum class EHM5SoundRicochetType : int32_t
{
	ESRT_VARIATION1 = 0,
	ESRT_VARIATION2 = 1,
};

// Size: 0x4
enum class EHUDElement : int32_t
{
	HUD_ELEMENT_NONE = 0,
	HUD_ELEMENT_MINIMAP = 1,
	HUD_ELEMENT_DISGUISE = 2,
	HUD_ELEMENT_WEAPON_DISPLAY = 4,
	HUD_ELEMENT_FOCUS_BAR = 8,
	HUD_ELEMENT_RETICULES = 16,
	HUD_ELEMENT_WEAPON_SELECTOR = 32,
	HUD_ELEMENT_SPECIAL_BAR = 64,
	HUD_ELEMENT_TEXT_MESSAGES = 128,
	HUD_ELEMENT_CONTRACT_MARKS = 256,
	HUD_ELEMENT_RATING_UPDATE = 512,
	HUD_ELEMENT_RANKING = 1024,
	HUD_ELEMENT_CHALLENGES = 2048,
	HUD_ELEMENT_CUSTOM_TEXTS = 4096,
	HUD_ELEMENT_ACTION_BUTTONS = 8192,
	HUD_ELEMENT_ATTENTION_PEAKS = 16384,
	HUD_ELEMENT_RATING_TRACKER = 32768,
	HUD_ELEMENT_TARGET_TRACKER = 65536,
	HUD_ELEMENT_HINTS = 131072,
	HUD_ELEMENT_CONTRACT_SCORING = 262144,
	HUD_ELEMENT_TUTORIAL = 524288,
	HUD_ELEMENT_HEALTH_BAR = 1048576,
	HUD_ELEMENT_OBJECTIVES = 2097152,
	HUD_ALL_ELEMENTS = 8388607,
};

// Size: 0x4
enum class EHUDIconFlags : int32_t
{
	HUD_ICON_FLAG_POSITION = 1,
	HUD_ICON_FLAG_VALUE = 2,
	HUD_ICON_FLAG_SCALE = 4,
	HUD_ICON_FLAG_TEXT = 8,
};

// Size: 0x4
enum class EHUDIconType : int32_t
{
	HUD_ICON_NONE = 0,
	HUD_ICON_ALARM_TIMER = 1,
	HUD_ICON_CLOSECOMBAT = 2,
	HUD_ICON_BREADCRUMB = 3,
	HUD_ICON_EXIT = 4,
	HUD_ICON_OBJECTIVE = 5,
	HUD_ICON_TARGET = 6,
	HUD_ICON_TUTORIAL_ARROW = 7,
};

// Size: 0x4
enum class EHUDMessageStatus : int32_t
{
	HUD_MESSAGE_UNUSED = 0,
	HUD_MESSAGE_ATTACH = 1,
	HUD_MESSAGE_FADEIN = 2,
	HUD_MESSAGE_DISPLAY = 3,
	HUD_MESSAGE_FADEOUT = 4,
};

// Size: 0x4
enum class EHandleClosetSpeechState : int32_t
{
	HCSS_Initial = 0,
	HCSS_Taunt = 1,
	HCSS_Fire = 2,
	HCSS_Done = 3,
};

// Size: 0x4
enum class EHeroGameState : int32_t
{
	eHGS_Reserved_QueryALL = 0,
	eHGS_Reserved_QueryAny = 1,
	eHGS_InstinctModeActive = 2,
	eHGS_IsHardToSee = 3,
	eHGS_Sneaking = 4,
	eHGS_InCloseCombat = 5,
	eHGS_ItemHandlingActive = 6,
	eHGS_CamSwitched = 7,
	eHGS_SniperMode = 8,
	eHGS_OTSMode = 9,
	eHGS_DualWielding = 10,
	eHGS_PreciseAim = 11,
	eHGS_ActivatingAltFire = 12,
	eHGS_FiredLastFrFocusBurnRate = 13,
	eHGS_FiredLastFrFocusGainValue = 14,
	eHGS_BurningFocus = 15,
	eHGS_InsideCloset = 16,
	eHGS_Peeking = 17,
	eHGS_FocusedInteraction = 18,
	eHGS_HoldsUtility = 19,
	eHGS_FacingRight = 20,
	eHGS_MvAgility = 21,
	eHGS_MvCover = 22,
	eHGS_MvDragging = 23,
	eHGS_MvHumanShield = 24,
	eHGS_MvVentilatorShaft = 25,
	eHGS_MvDrainPipe = 26,
	eHGS_MvLedgeWalk = 27,
	eHGS_MvLedgeHang = 28,
	eHGS_MvLocomotion = 29,
	eHGS_MvShootingBallet = 30,
	eHGS_MvCloseCombat = 31,
	eHGS_MvSurrendering = 32,
	eHGS_MvFriskComplying = 33,
	eHGS_MvShowItem = 34,
	eHGS_MvThrow = 35,
	eHGS_MvFiberWireKill = 36,
	eHGS_MvAlign = 37,
	eHGS_MvTakedown = 38,
	eHGS_MvSubAction = 39,
	eHGS_NUM = 40,
};

// Size: 0x4
enum class EHintMessageSoundType : int32_t
{
	EHintMessageSound_None = 0,
	EHintMessageSound_GeneralHint = 1,
	EHintMessageSound_UsefulItem = 2,
	EHintMessageSound_NeedsItem = 3,
	EHintMessageSound_ObjectiveExit = 4,
	EHintMessageSound_Target = 5,
	EHintMessageSound_AccidentKill = 6,
	EHintMessageSound_Trespassing = 7,
	EHintMessageSound_CanBeTurnedOn = 8,
	EHintMessageSound_CanBeTurnedOff = 9,
	EHintMessageSound_Agility = 10,
};

// Size: 0x4
enum class EHintMessageType : int32_t
{
	EHintMessageType_Hint = 0,
	EHintMessageType_InstinctHint = 1,
	EHintMessageType_InstinctPrompt = 2,
	EHintMessageType_Tutorial = 3,
};

// Size: 0x4
enum class EHitmanPermissionFlag : int32_t
{
	eHPFlag_InventorySelect = 0,
	eHPFlag_CanHolsterItem = 1,
	eHPFlag_CanDropItem = 2,
	eHPFlag_CanDualWield = 3,
	eHPFlag_CameraControl = 4,
	eHPFlag_MovementControl = 5,
	eHPFlag_AimControl = 6,
	eHPFlag_CanOpenNotebook = 7,
	eHPFlag_CanOpenPauseMenu = 8,
	eHPFlag_PermissionsNUM = 9,
};

// Size: 0x4
enum class EHumanShieldSpeechState : int32_t
{
	HMSS_FirstWarning = 0,
	HMSS_SecondWarningVictim = 1,
	HMSS_SecondWarning = 2,
	HMSS_ThirdWarning = 3,
	HMSS_FlankTarget = 4,
	HMSS_TakeDown = 5,
	HMSS_Done = 6,
};

// Size: 0x4
enum class EInformationBarMessage : int32_t
{
	eIBM_Clear = 0,
	eIBM_LastEnemyKilledCP = 1,
	eIBM_InvestigateStand = 2,
	eIBM_BodyFound = 3,
	eIBM_BloodPoolFound = 4,
	eIBM_Suspicious = 5,
	eIBM_DisguiseBlown = 6,
	eIBM_Hunt = 7,
	eIBM_Exposed = 8,
	eIBM_LandMineArmed = 9,
	eIBM_RadioOn = 10,
	eIBM_Trespassing = 11,
	eIBM_NUM = 12,
};

// Size: 0x4
enum class EIntelStage : int32_t
{
	eIT_MAIN = 0,
	eIT_STAGE = 1,
	eIT_HINT = 2,
};

// Size: 0x4
enum class EIntelTensionLevel : int32_t
{
	eITL_Undefined = 0,
	eITL_Ambient = 1,
	eITL_Agitated = 2,
	eITL_Searching = 3,
	eITL_AlertedLow = 4,
	eITL_AlertedHigh = 5,
	eITL_Hunting = 6,
	eITL_Arrest = 7,
	eITL_Combat = 8,
};

// Size: 0x4
enum class EIntelType : int32_t
{
	eIT_DATA = 0,
	eIT_OPPORTUNITY = 1,
	eIT_BACKGROUND = 2,
	eIT_HANDLER = 3,
	eIT_UNDEFINED = 4,
};

// Size: 0x4
enum class EInteractionIndicatorState : int32_t
{
	EIIS_AVAILABLE = 0,
	EIIS_COLLAPSED = 1,
	EIIS_ACTIVATING = 2,
	EIIS_NOTAVAILABLE = 3,
};

// Size: 0x4
enum class EInteractionInputType : int32_t
{
	EIIT_UNKNOWN = 0,
	EIIT_PRESS = 1,
	EIIT_HOLD = 2,
	EIIT_HOLD_DOWN = 3,
	EIIT_REPEAT = 4,
	EIIT_GUIDE = 5,
};

// Size: 0x4
enum class EInvestigationState : int32_t
{
	IS_FindTargetLocation = 0,
	IS_WaitForVIPGroup = 1,
	IS_WaitForLeader = 2,
	IS_PreAcknowledge = 3,
	IS_Acknowledge = 4,
	IS_Acknowledging = 5,
	IS_Investigate = 6,
	IS_Investigating = 7,
	IS_Resolve = 8,
	IS_Resolving = 9,
	IS_Completed = 10,
};

// Size: 0x4
enum class EInvestigationType : int32_t
{
	IT_Generic = 0,
	IT_HearBulletImpact = 1,
	IT_HearFootsteps = 2,
	IT_CarAlarm = 3,
	IT_HearBark = 4,
	IT_HearPain = 5,
	IT_HearRadio = 6,
	IT_HearItemToss = 7,
	IT_SeeItemToss = 8,
	IT_HearAccident = 9,
	IT_CuriousSound = 10,
	IT_CuriousItemSound = 11,
	IT_SeeWeapon = 12,
	IT_SeeItem = 13,
	IT_Perceptible = 14,
	IT_Toss = 15,
	IT_CrowdCurious = 16,
	IT_CameraDefect = 17,
};

// Size: 0x4
enum class EItemLocation : int32_t
{
	eIL_Anywhere = 0,
	eIL_Inventory = 1,
	eIL_RightHand = 2,
	eIL_LeftHand = 3,
	eIL_FreeBone = 4,
	eIL_Count = 5,
};

// Size: 0x4
enum class EItemModifierType : int32_t
{
	MODIFIER_NONE = 0,
	MODIFIER_THROW = 1,
	MODIFIER_CARRY = 2,
	MODIFIER_AMMO = 3,
	MODIFIER_PRECISION = 4,
	MODIFIER_DAMAGE = 5,
	MODIFIER_POINTSHOOTING = 6,
	MODIFIER_IMPACT = 7,
	MODIFIER_EXPLOSIVE = 8,
	MODIFIER_RANGE = 9,
	MODIFIER_ZOOM = 10,
	MODIFIER_SUPPRESSOR = 11,
	MODIFIER_RECOIL = 12,
	MODIFIER_RATEOFFIRE = 13,
	MODIFIER_SCOPEBOBBING = 14,
	MODIFIER_MUZZLEVELOCITY = 15,
	MODIFIER_PIERCING = 16,
	MODIFIER_KNOCKDOWN = 17,
	MODIFIER_FULLAUTO = 18,
	MODIFIER_PRECISIONSHOT = 19,
	MODIFIER_SCOPETIMESLOWDOWN = 20,
	MODIFIER_STYLE = 21,
};

// Size: 0x4
enum class EKeywordSetBehavior : int32_t
{
	EKWSB_All = 0,
	EKWSB_None = 1,
	EKWSB_Any = 2,
	EKWSB_No = 3,
};

// Size: 0x4
enum class EKillType : int32_t
{
	EKillType_Undefined = 0,
	EKillType_Throw = 1,
	EKillType_Fiberwire = 2,
	EKillType_PistolExecute = 3,
	EKillType_ItemTakeOutFront = 4,
	EKillType_ItemTakeOutBack = 5,
	EKillType_ChokeOut = 6,
	EKillType_SnapNeck = 7,
	EKillType_KnockOut = 8,
	EKillType_Push = 9,
	EKillType_Pull = 10,
	EKillType_HumanShield = 11,
	eKillType_ShootingBallet = 12,
};

// Size: 0x4
enum class EKnownEntityType : int32_t
{
	KET_UNKNOWN = 0,
	KET_HITMAN = 1,
	KET_ACTOR = 2,
	KET_ITEM = 3,
	KET_LOCATION = 4,
	KET_OBJECT = 5,
	KET_COVER = 6,
	KET_PERCEPTIBLE = 7,
	KET_TEMPCROWDBODY = 8,
};

// Size: 0x4
enum class ELastSoundTension : int32_t
{
	EST_Unknown = 0,
	EST_Ambient = 1,
	EST_Yellow = 2,
	EST_Orange = 3,
	EST_Red = 4,
};

// Size: 0x4
enum class ELedgeDismountBehavior : int32_t
{
	eLDB_DontCare = 0,
	eLDB_Stand = 1,
	eLDB_Crouch = 2,
};

// Size: 0x4
enum class ELedgeDismountDirection : int32_t
{
	eLDD_DontCare = 0,
	eLDD_FaceLedge = 1,
	eLDD_FaceLeft = 2,
	eLDD_FaceRight = 3,
	eLDD_Turn180 = 4,
};

// Size: 0x4
enum class ELocale : int32_t
{
	Locale_En = 0,
	Locale_Fr = 1,
	Locale_It = 2,
	Locale_De = 3,
	Locale_Es = 4,
	Locale_Ru = 5,
	Locale_Mx = 6,
	Locale_Br = 7,
	Locale_Pl = 8,
	Locale_Cn = 9,
	Locale_Jp = 10,
};

// Size: 0x4
enum class EMarkerClipAlgorithm : int32_t
{
	MCA_NONE = 0,
	MCA_SIMPLE = 1,
	MCA_ADVANCED = 2,
};

// Size: 0x4
enum class EMarkerInclusionMode : int32_t
{
	MIM_DEFAULT = 0,
	MIM_IF_FORCE_INCLUDED_ONLY = 1,
};

// Size: 0x4
enum class EMeBarState : int32_t
{
	ME_BAR_NONE = 0,
	ME_BAR_TRESPASSING = 1,
	ME_BAR_DEEPTRESPASSING = 2,
	ME_BAR_VISIBLY_ARMED = 3,
	ME_BAR_CHANGING_DISGUISE = 4,
	ME_BAR_DISGUISE_BLOWN = 5,
	ME_BAR_DISGUISE_SUSPICIOUS = 6,
	ME_BAR_NEAR_BODY = 7,
};

// Size: 0x4
enum class EMorphemeEventId : int32_t
{
	eDE_None = 0,
	eDE_UnholsterWeapon = 18,
	eDE_HolsterWeapon = 19,
	eDE_FireWeapon = 20,
	eDE_AttachWeapon = 21,
	eDE_DetachWeapon = 22,
	eDE_LegR = 100,
	eDE_LegL = 101,
	eDE_TransitionEnd_LegR = 200,
	eDE_TransitionEnd_LegL = 201,
	eDE_Finish = 255,
	eDE_InterpolationStart = 300,
	eDE_InterpolationEnd = 301,
	eDE_TransitionSignal = 400,
	eDE_TransitionEnd = 500,
	eDE_DisableNPCHitmanCollision = 700,
	eDE_EnableNPCHitmanCollision = 701,
	eDE_EnableRagdollRangeStart = 800,
	eDE_EnableRagdollRangeEnd = 801,
	eDE_StartBlendingOut = 850,
	eDE_FinishBlendingOut = 851,
	eDE_StartOrientationBlend = 860,
	eDE_FinishOrientationBlend = 861,
	eDE_RecoveryPowerRagdollEnd = 862,
	eDE_RecoveryBlendEnd = 863,
	eDE_ImpactFinished = 900,
	eDE_ActFinished = 1000,
	eDE_ActFinishedWhenMoving = 1001,
	eDE_ActReached = 1005,
	eDE_ActLoop = 1050,
	eDE_ActFullbodyStartMarker = 1090,
	eDE_ActFullbodyEndMarker = 1091,
	eDE_ReactionFinished = 1100,
	eDE_StandToCrouch = 1500,
	eDE_CrouchToStand = 1501,
	eDE_OffHandIKEnable = 1600,
	eDE_OffHandIKDisable = 1601,
	eDE_StandToMoveRotationToTranslation = 1700,
	eDE_MoveToStandTranslationToRotation = 1701,
	eDE_HeadIKEnable = 1800,
	eDE_HeadIKDisable = 1801,
	eDE_WindowLeaningEnable = 2000,
	eDE_WindowLeaningDisable = 2001,
	eDE_PreventDeathAnimations = 2002,
	eDE_AllowDeathAnimations = 2003,
	eDE_HeadControlEnable = 2010,
	eDE_HeadControlDisable = 2011,
	eDE_CombatActEndMarker = 3000,
	eDE_CombatAim = 3100,
	eDE_CombatEnableRightHandIK = 3010,
	eDE_CombatEnableLeftHandIK = 3011,
	eDE_CombatEndEnableIK = 3015,
	eDE_CombatStartDisableIK = 3020,
	eDE_CombatEndDisableIK = 3025,
	eDE_CombatEnableShoot = 3030,
	eDE_CombatDisableShoot = 3040,
	eDE_CombatEnableBlindShoot = 3050,
	eDE_CombatDisableBlindShoot = 3060,
	eDE_ActBehaviorEventStart = 4000,
	eDE_ActItemPickup = 4001,
	eDE_ActItemDrop = 4002,
	eDE_AmbientItemUseMarker = 4010,
	eDE_ActBehaviorEventEnd = 4999,
	eDE_Act_LeadIn_Marker = 10301,
	eDE_Act_UB_BlendIn_End = 10050,
	eDE_Act_FB_BlendIn_Start = 10051,
	eDE_Act_FB_BlendIn_End = 10052,
	eDE_Act_FB_BlendOut_End = 10053,
};

// Size: 0x4
enum class EMotionType : int32_t
{
	MOTION_LOCKED = 0,
	MOTION_LIMITED = 1,
	MOTION_FREE = 2,
};

// Size: 0x4
enum class EMoveEndState : int32_t
{
	MES_Moving = 0,
	MES_Stopping = 1,
	MES_Standing = 2,
};

// Size: 0x4
enum class EMoveSpeed : int32_t
{
	MS_Sneaking = 0,
	MS_Walking = 1,
	MS_Jogging = 2,
	MS_Sprinting = 3,
	MS_Flash = 4,
};

// Size: 0x4
enum class EObjectiveType : int32_t
{
	OBJECTIVE_PRIMARY = 0,
	OBJECTIVE_SECONDARY = 1,
	OBJECTIVE_TERTIARY = 2,
};

// Size: 0x4
enum class EOnlinTest : int32_t
{
	eHELLO = 0,
	eWORLD = 1,
};

// Size: 0x1
enum class EOrderCompletionStatus : int8_t
{
	OCS_Undetermined = 0,
	OCS_Succeeded = 1,
	OCS_Interrupted = 2,
	OCS_Blocked = 3,
	OCS_Failed = 4,
};

// Size: 0x4
enum class EOutfitAICategory : int32_t
{
	OAC_Undefined = 0,
	OAC_Fallback = 1,
	OAC_47Suit = 2,
	OAC_47TRAINING = 3,
	OAC_47MARRAKESH = 4,
	OAC_47SAPIENZA = 5,
	OAC_47BANGKOK = 6,
	OAC_47COLORADO = 7,
	OAC_47HOKKAIDO = 8,
	OAC_47PREORDER = 9,
	OAC_Bodyguard = 10,
	OAC_CameraMan = 11,
	OAC_Chef = 12,
	OAC_Cleaner = 13,
	OAC_Cop = 14,
	OAC_Crew = 15,
	OAC_DaSilva = 16,
	OAC_Gardner = 17,
	OAC_Hazmat = 18,
	OAC_HouseStaff = 19,
	OAC_Maintenance = 20,
	OAC_Officer = 21,
	OAC_Priest = 22,
	OAC_Printer = 23,
	OAC_Scientist = 24,
	OAC_Security = 25,
	OAC_Sheik = 26,
	OAC_Stylist = 27,
	OAC_Waiter = 28,
	OAC_Busker = 29,
	OAC_Caddie = 30,
	OAC_ChurchStaff = 31,
	OAC_Cyclist = 32,
	OAC_Filmcrew = 33,
	OAC_Fortune = 34,
	OAC_Hippie = 35,
	OAC_Investor = 36,
	OAC_KGB = 37,
	OAC_Lawyer = 38,
	OAC_Kruger = 39,
	OAC_Masseur = 40,
	OAC_Mechanic = 41,
	OAC_Norfolk = 42,
	OAC_Plague = 43,
	OAC_Psych = 44,
	OAC_Shopkeep = 45,
	OAC_Soldier = 46,
	OAC_Tux = 47,
	OAC_Vampire = 48,
	OAC_YachtCrew = 49,
	OAC_Exterminator = 50,
	OAC_SoundCrew = 51,
	OAC_Intern = 52,
	OAC_Stalker = 53,
	OAC_Scarecrow = 54,
	OAC_Hacker = 55,
	OAC_SpecOps = 56,
	OAC_Berg = 57,
	OAC_Morgue = 58,
	OAC_Surgeon = 59,
	OAC_Doctor = 60,
	OAC_Director = 61,
	OAC_Ninja = 62,
	OAC_Baseball = 63,
	OAC_KillBill = 64,
	OAC_Pilot = 65,
	OAC_Yoga = 66,
	OAC_Mummy = 67,
	OAC_Cowboy = 68,
	OAC_Staff = 69,
	OAC_Santa = 70,
	OAC_MambaCrew = 71,
	OAC_Delivery = 72,
	OAC_GOTY_Clown = 73,
	OAC_GOTY_Cowboy = 74,
	OAC_GOTY_DarkSniper = 75,
};

// Size: 0x1
enum class EParticleColorUsage : int8_t
{
	REPLACE_PARTICLE_COLOR = 0,
	LEAVE_PARTICLE_COLOR = 1,
};

// Size: 0x4
enum class EParticleDecalSpawnEntity_Constraints : int32_t
{
	FACTOR_AND_RANDOMIZE = 0,
	SIZE_RANGE = 1,
};

// Size: 0x4
enum class EParticleModifierImpulseDirections : int32_t
{
	TARGET_ZAXIS_DIRECTION = 0,
	TOWARDS_TARGET_PIVOT = 1,
	AWAY_FROM_TARGET_PIVOT = 2,
};

// Size: 0x1
enum class EParticleSpritePivotLocation : int8_t
{
	CENTER_PIVOT = 0,
	BOTTOM_PIVOT = 1,
	TOP_PIVOT = 2,
};

// Size: 0x4
enum class EPathFinderBoxType : int32_t
{
	PFBT_INCLUDE_MESH_COLLISION = 0,
	PFBT_EXCLUDE_MESH_COLLISION = 1,
	PFBT_CREATE_MESH_COLLISION = 2,
	PFBT_REGION = 3,
	PFBT_IGNORE = 4,
};

// Size: 0x4
enum class EPhysicsObjectType : int32_t
{
	EPHYSICSOBJECTTYPE_UNKNOWN = 0,
	EPHYSICSOBJECTTYPE_DYNAMIC = 1,
	EPHYSICSOBJECTTYPE_KINEMATIC = 2,
	EPHYSICSOBJECTTYPE_STATIC = 3,
};

// Size: 0x4
enum class EPlaceableType : int32_t
{
	PLACEABLE_NOT = 0,
	PLACEABLE_FULL_PHYSICS = 1,
	PLACEABLE_SLEEP_PHYSICS = 2,
	PLACEABLE_NO_PHYSICS = 3,
	PLACEABLE_ATTACH = 4,
};

// Size: 0x4
enum class EPlayMode : int32_t
{
	PLAYMODE_STOPPED = 1,
	PLAYMODE_PAUSED = 2,
	PLAYMODE_PLAYING = 3,
};

// Size: 0x4
enum class EPostProcessorComponentType : int32_t
{
	MRP_LOOKAT = 1,
	MRP_AIM = 2,
	MRP_LEDGEFEETLOCK = 16,
	MRP_LEDGEHANG = 32,
	MRP_SHOOTINGBALLET = 256,
	MRP_IMPACT = 1024,
	MRP_BLINDFIRE = 2048,
};

// Size: 0x4
enum class EPushNotificationType : int32_t
{
	PUSH_NOTIFICATION_OBJECTIVE = 0,
	PUSH_NOTIFICATION_DISGUISE = 1,
	PUSH_NOTIFICATION_CONTRACT = 2,
	PUSH_NOTIFICATION_CHALLENGE = 3,
	PUSH_NOTIFICATION_RATING = 4,
	PUSH_NOTIFICATION_SPECIAL_RATING_UNLOCKED = 5,
	PUSH_NOTIFICATION_CONTRACT_PICKED_UP = 6,
	PUSH_NOTIFICATION_TECHNIQUE_UNLOCKED = 7,
	PUSH_NOTIFICATION_SCORE_COMPARISON = 8,
};

// Size: 0x4
enum class ERANDOM_DISTRIBUTION : int32_t
{
	RND_UNIFORM = 0,
	RND_SAWTOOTH = 1,
};

// Size: 0x4
enum class ERatingCategory : int32_t
{
	ERatingCategory_Invalid = 0,
	ERatingCategory_Flawless = 1,
	ERatingCategory_Violence = 2,
	ERatingCategory_Cunning = 3,
	ERatingCategory_Noise = 4,
	ERatingCategory_COUNT = 5,
};

// Size: 0x4
enum class ERatingTitle : int32_t
{
	ERatingTitle_SilentAssassin = 0,
	ERatingTitle_PerfectAssassin = 1,
	ERatingTitle_Ninja = 2,
	ERatingTitle_GloryBlazer = 3,
	ERatingTitle_Eraser = 4,
	ERatingTitle_Exhibitionist = 5,
	ERatingTitle_Trickster = 6,
	ERatingTitle_Chameleon = 7,
	ERatingTitle_Spider = 8,
	ERatingTitle_Angel = 9,
	ERatingTitle_COUNT = 10,
};

// Size: 0x4
enum class ERatingTitleRequirement : int32_t
{
	ERatingTitleRequirement_Optional = 0,
	ERatingTitleRequirement_Required = 1,
	ERatingTitleRequirement_Fails = 2,
};

// Size: 0x1
enum class ERayDetailLevel : int8_t
{
	RAYDETAILS_NONE = 0,
	RAYDETAILS_BONES = 1,
	RAYDETAILS_MESH = 2,
};

// Size: 0x4
enum class ERayType : int32_t
{
	ERAY_CLOSESTHIT_SIMPLE = 0,
	ERAY_CLOSESTHIT_DETAILED = 1,
};

// Size: 0x4
enum class ERegionId : int32_t
{
	RegionId_Default = 0,
	RegionId_Japan = 1,
	RegionId_Asia = 2,
};

// Size: 0x4
enum class ERegionMask : int32_t
{
	eRM_None = 1,
	eRM_LowCover = 2,
	eRM_HighCover = 4,
	eRM_Stairs = 8,
	eRM_Separator = 16,
	eRM_User_1 = 32,
	eRM_User_2 = 64,
	eRM_User_3 = 128,
	eRM_User_4 = 256,
	eRM_User_5 = 512,
	eRM_User_6 = 1024,
	eRM_User_7 = 2048,
	eRM_User_8 = 4096,
};

// Size: 0x1
enum class ERenderGlowTypes : int8_t
{
	ERENDERGLOWTYPE_NONE = 0,
	ERENDERGLOWTYPE_ENEMIES = 1,
	ERENDERGLOWTYPE_ALLIES = 2,
	ERENDERGLOWTYPE_CIVILIAN = 3,
	ERENDERGLOWTYPE_ITEMS = 4,
	ERENDERGLOWTYPE_STASHED_ITEMS = 5,
	ERENDERGLOWTYPE_SETPIECE = 6,
	ERENDERGLOWTYPE_BACKGROUND = 7,
	ERENDERGLOWTYPE_CONTRACT_TARGET = 8,
	ERENDERGLOWTYPE_OBJECTIVES = 9,
	ERENDERGLOWTYPE_ENFORCER = 10,
	ERENDERGLOWTYPE_LTMEMORY = 11,
	ERENDERGLOWTYPE_TAGGED = 12,
	ERENDERGLOWTYPE_TAGFOCUS_UNTAGGED = 13,
	ERENDERGLOWTYPE_TAGFOCUS_TAGGED = 14,
	ERENDERGLOWTYPE_BACKGROUNDUNMASKED = 15,
	ERENDERGLOWTYPE_INTERACTION = 16,
	ERENDERGLOWTYPE_TRAVERSAL = 17,
	ERENDERGLOWTYPE_EMISSIVE_UI = 18,
};

// Size: 0x4
enum class ERequirementId : int32_t
{
	EREQUIREMENT_INVALID = 0,
	EREQUIREMENT_TOKEN_OUTFIT_LEGACY_HERO_REQUIEMSUIT = 1,
	EREQUIREMENT_FIREARMS_HERO_PISTOL_TACTICAL_015_SU_SKIN05 = 2,
	EREQUIREMENT_PROP_DEVICE_SONYPREORDER_WHITE_RUBBERDUCK_REMOTE_EXPLOSIVE = 3,
	EREQUIREMENT_GOTY_PATIENT_ZERO = 4,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_PARIS_CLOWN = 5,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_HOKKAIDO_COWBOY = 6,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_MARRAKESH_DARK_SNIPER = 7,
	EREQUIREMENT_ANNIVERSARY_OUTFITS = 8,
};

// Size: 0x4
enum class ESBCamProfileBone : int32_t
{
	eSBCamProfileBone_Neck = 0,
	eSBCamProfileBone_Spine = 1,
	eSBCamProfileBone_Hand = 2,
	eSBCamProfileBone_Ground = 3,
	eSBCamProfileBone_Num = 4,
};

// Size: 0x4
enum class ESBPose : int32_t
{
	eSBPose_RifleShootPose = 0,
	eSBPose_DualLeftHigh = 1,
	eSBPose_DualFrontHigh = 2,
	eSBPose_DualBackLeftHigh = 3,
	eSBPose_DualBackRightHigh = 4,
	eSBPose_DualRightHigh = 5,
	eSBPose_PistolShootPose = 6,
	eSBPose_ShotGunShootPoseHigh = 7,
	eSBPose_ShotGunShootPoseHip = 8,
	eSBPose_Num = 9,
};

// Size: 0x4
enum class ESOUND_3DROLLOFF_TYPE : int32_t
{
	SOUND_3D_LINEAR_ROLLOFF = 0,
	SOUND_3D_LOGARITHMIC_ROLLOFF = 1,
	SOUND_3D_CUSTOM_ROLLOFF = 2,
};

// Size: 0x4
enum class ESaveLoadStatus : int32_t
{
	ESaveLoadStatus_OK = 0,
	ESaveLoadStatus_PROCESSING = 1,
	ESaveLoadStatus_MISSING = 2,
	ESaveLoadStatus_ERROR_NODISKSPACE = 3,
	ESaveLoadStatus_ERROR_DEVICEREMOVED = 4,
	ESaveLoadStatus_ERROR_CORRUPT = 5,
	ESaveLoadStatus_ERROR_VERSION = 6,
	ESaveLoadStatus_ERROR_TAMPERED = 7,
	ESaveLoadStatus_ERROR_SAVING = 8,
	ESaveLoadStatus_ERROR_FATAL = 9,
	ESaveLoadStatus_ERROR_ONLINE = 10,
	ESaveLoadStatus_ERROR_REQUIREMENTCHECK = 11,
	ESaveLoadStatus_ERROR_INVALIDATED = 12,
};

// Size: 0x4
enum class ESaveType : int32_t
{
	ESaveType_AutoSave = 0,
	ESaveType_QuickSave = 1,
	ESaveType_SystemData = 2,
	ESaveType_LocalProfile = 3,
};

// Size: 0x4
enum class EScreenAnchor : int32_t
{
	SCREEN_ANCHOR_TOP_LEFT = 0,
	SCREEN_ANCHOR_TOP_CENTER = 1,
	SCREEN_ANCHOR_TOP_RIGHT = 2,
	SCREEN_ANCHOR_MIDDLE_LEFT = 3,
	SCREEN_ANCHOR_MIDDLE_CENTER = 4,
	SCREEN_ANCHOR_MIDDLE_RIGHT = 5,
	SCREEN_ANCHOR_BOTTOM_LEFT = 6,
	SCREEN_ANCHOR_BOTTOM_CENTER = 7,
	SCREEN_ANCHOR_BOTTOM_RIGHT = 8,
};

// Size: 0x4
enum class EScreenplayTriggerEvent : int32_t
{
	STT_ReportCrime = 0,
	STT_ReportCrimeToHitman = 1,
	STT_ReportCrimeMoveBack = 2,
};

// Size: 0x4
enum class ESentryActionPrompt : int32_t
{
	eSAP_None = 0,
	eSAP_Frisk = 1,
	eSAP_ShowItem = 2,
	eSAP_Max = 3,
};

// Size: 0x4
enum class ESequencePreviewState : int32_t
{
	PREVIEW_STOPPED = 0,
	PREVIEW_PLAYING = 1,
	PREVIEW_PAUSED = 2,
};

// Size: 0x4
enum class ESettingsParam : int32_t
{
	ESP_ProjectileDamage = 0,
	ESP_ProjectileDPSThreshold = 1,
	ESP_AttentionGain = 2,
	ESP_VisibilityDistance = 3,
	ESP_VisibilityConeHeight = 4,
	ESP_ShootMaxSpread = 5,
	ESP_ShootMinSpread = 6,
	ESP_ShootMaxSpreadRange = 7,
	ESP_CCounterEndLength = 8,
	ESP_CCChoiceWindowLength = 9,
	ESP_CCChainFailDamage = 10,
	ESP_CCCounterFailDamage = 11,
};

// Size: 0x4
enum class EShatterSystemCoreBehavior : int32_t
{
	eSSCB_Static = 0,
	eSSCB_Kinematic = 1,
	eSSCB_Dynamic = 2,
};

// Size: 0x4
enum class EShootIntensity : int32_t
{
	SHOOT_INTENSITY_LOW = 0,
	SHOOT_INTENSITY_MEDIUM = 1,
	SHOOT_INTENSITY_HIGH = 2,
};

// Size: 0x4
enum class ESituationJoinReason : int32_t
{
	AISJR_Default = 0,
	AISJR_HeardSound = 1,
	AISJR_Alarm = 2,
	AISJR_HitmanStrange = 3,
	AISJR_HitmanIllegal = 4,
	AISJR_Assist = 5,
	AISJR_Propagate = 6,
	AISJR_Spawned = 7,
	AISJR_HelpCivilian = 8,
	AISJR_Escalating = 9,
	AISJR_DeadBody = 10,
	AISJR_Bloodpool = 11,
	AISJR_StandDown = 12,
	AISJR_Report = 13,
	AISJR_ForcedToHold = 14,
};

// Size: 0x4
enum class ESituationType : int32_t
{
	AIST_Any = 0,
	AIST_DetectedInPrivate = 1,
	AIST_InvestigateStanding = 2,
	AIST_InvestigateCurious = 3,
	AIST_InvestigateWeapon = 4,
	AIST_GuardBody = 5,
	AIST_Entourage = 6,
	AIST_HandleTrespassing = 7,
	AIST_DeadBody = 8,
	AIST_InvestigateCautious = 9,
	AIST_Sentry = 10,
	AIST_HandleDisguise = 11,
	AIST_SniperCombat = 12,
	AIST_StandOff = 13,
	AIST_RecoverUnconscious = 14,
	AIST_AvoidExplosion = 15,
	AIST_Evacuate = 16,
	AIST_ProtoCombat = 17,
	AIST_DangerousArea = 18,
	AIST_CloseCombat = 19,
	AIST_Accident = 20,
	AIST_Spectator = 21,
	ESituationType_Count = 22,
};

// Size: 0x4
enum class ESmartBehaviorOrder : int32_t
{
	SBO_Stand = 0,
	SBO_Move = 1,
	SBO_React = 2,
	SBO_Act = 3,
	SBO_MoveToAct = 4,
	SBO_MoveToCover = 5,
	SBO_ShootFromCover = 6,
	SBO_Death = 7,
	SBO_Teleport = 8,
};

// Size: 0x4
enum class ESmartWaitCondition : int32_t
{
	SWC_Time = 0,
	SWC_Distance = 1,
	SWC_Executing = 2,
	SWC_Executed = 3,
};

// Size: 0x4
enum class ESmoothingMode : int32_t
{
	ESM_LINEAR = 0,
	ESM_EXPONENTIAL = 1,
};

// Size: 0x4
enum class ESniperScoreMessageType : int32_t
{
	ESSMT_STYLE_DEFAULT = 0,
	ESSMT_STYLE_SCORE = 1,
	ESSMT_STYLE_PENALTY = 2,
	ESSMT_STYLE_STREAK = 3,
	ESSMT_STYLE_CIVKILL = 4,
};

// Size: 0x4
enum class ESoundChannelGroup : int32_t
{
	ESCG_NONE = 0,
	SND_Default = 1,
	SND_Phys_Rigidbody = 2,
	SND_Phys_Shatter = 3,
	SND_Wpn_HM = 4,
	SND_Wpn_HM_Shot = 5,
	SND_Wpn_NPC = 6,
	SND_Wpn_Impacts = 7,
	SND_Wpn_Flybys = 8,
	SND_Characters = 9,
	SND_Ambience = 10,
	SND_Props = 11,
	SND_Prop_Item = 12,
	SND_FS_HM = 13,
	SND_FS_NPC = 14,
	SND_VisualFX = 15,
	SND_VisualFX_ShotActivate = 16,
	SND_VisualFX_Explosions = 17,
	SND_Diag_HM = 18,
	SND_Diag_NPC = 19,
	SND_CS_Ingame = 20,
	SND_CS_PreRend = 21,
	SND_Music_Env = 22,
	SND_MusicNonEnv = 23,
	SND_SpecialFX_ShootingBallet = 24,
	SND_SpecialFX_CC = 25,
	SND_SpecialFX_Jumps = 26,
	SND_SpecialFX_Closet = 27,
	SND_SpecialFX_Vent = 28,
	SND_SpecialFX_Instinct = 29,
	SND_SpecialFX_HumanShield = 30,
	SND_SpecialFX_Disguise = 31,
	SND_SpecialFX_Agility = 32,
	SND_Stingers_SFX = 33,
	SND_GUI = 34,
	SND_Test = 35,
	ANIM_HM_Generic = 36,
	ANIM_HM_Loco = 37,
	ANIM_HM_Agility = 38,
	ANIM_HM_Suit_Flap = 39,
	ANIM_HM_Suit_Release = 40,
	ANIM_HM_Suit_Slide = 41,
	ANIM_HM_Suit_LandImpact = 42,
	ANIM_HM_Suit_Grab = 43,
	ANIM_HM_Suit_Roll = 44,
	ANIM_HM_Suit_Swoosh_Body = 45,
	ANIM_HM_Suit_Swoosh_Fast = 46,
	ANIM_HM_CC_Impacts = 47,
	ANIM_HM_CC_Movement = 48,
	ANIM_NPC_Generic = 49,
	ANIM_NPC_Loco = 50,
	ANIM_NPC_CC_Impacts = 51,
	ANIM_NPC_CC_Movement = 52,
	SND_Wpn_HM_Tail = 53,
	SND_Wpn_NPC_Tail = 54,
	SND_Diag_NPC_Crowd = 55,
	SND_Phys_RigidBody_Ragdoll = 56,
	SND_Diag_VO = 57,
	SND_GUI_Menu = 58,
	SND_Props_Doors = 59,
	SND_Wpn_HM_Handguns = 60,
	SND_Wpn_HM_Revolvers = 61,
	SND_Wpn_HM_Rifles = 62,
	SND_Wpn_HM_Shotguns = 63,
	SND_Wpn_HM_Smgs = 64,
	SND_Wpn_HM_Snipers = 65,
	SND_Wpn_HM_Other = 66,
	SND_Wpn_NPC_Handguns = 67,
	SND_Wpn_NPC_Revolvers = 68,
	SND_Wpn_NPC_Rifles = 69,
	SND_Wpn_NPC_Shotguns = 70,
	SND_Wpn_NPC_Smgs = 71,
	SND_Wpn_NPC_Snipers = 72,
	SND_Wpn_NPC_Other = 73,
	SND_Diag_NPC_Oneliner = 74,
	SND_Moments = 75,
};

// Size: 0x4
enum class ESoundCollisionType : int32_t
{
	ESCT_IMPACT = 0,
	ESCT_ROLLING = 1,
	ESCT_SLIDING = 2,
	ESCT_ENDED = 3,
	ESCT_SHATTER = 4,
};

// Size: 0x4
enum class ESoundGateFlags : int32_t
{
	SOUNDGATE_FLAGS_AMBIENCE = 1,
	SOUNDGATE_FLAGS_OCCLUSION = 2,
	SOUNDGATE_FLAGS_ALL = 255,
};

// Size: 0x4
enum class ESoundGateType : int32_t
{
	SOUNDGATE_TYPE_ROUND = 0,
	SOUNDGATE_TYPE_SHARPCORNERS = 1,
};

// Size: 0x4
enum class ESoundMaterialType : int32_t
{
	eWood = 0,
	eWoodPlank = 1,
	eMetal = 2,
	eMetalHeavy = 3,
	eMetalCar = 4,
	eMetalRattle = 5,
	eMetalFence = 6,
	eMetalSteamPipe = 7,
	eMetalNoDecal = 8,
	eGlass = 9,
	eGlassShards = 10,
	ePlastic = 11,
	ePlasticHollow = 12,
	eWater = 13,
	eWaterDeep = 14,
	eConcrete = 15,
	eGround = 16,
	eFlesh = 17,
	eHeroFlesh = 18,
	eGravel = 19,
	eDirt = 20,
	eGrass = 21,
	eCeramic = 22,
	ePaper = 23,
	eCloth = 24,
	eWoodCreaky = 25,
	eFabric = 26,
	eMetalThin = 27,
	eMetalChainLinkFence = 28,
	eMetalOilBarrels = 29,
	eMetalWeapon = 30,
	eRubber = 31,
	eShell = 32,
	eMarble = 33,
	eCatwalk = 34,
	eWoodAwesome = 35,
	ePaperBag = 36,
	eMetalTube = 37,
	eInaudible = 38,
	eRagdoll_Body = 39,
	eRagdoll_Feet = 40,
	eRagdoll_Hand = 41,
	eRagdoll_Head = 42,
	eSword = 43,
	eMetalMechanical = 44,
	eWoodStickMetal = 45,
	ePropsCoin = 46,
	ePropsScrewdriver = 47,
	ePropsCrowbar = 48,
	ePropsWrench = 49,
	ePropsKnife = 50,
	eRoofTiles = 51,
	eGlassCar = 52,
	eMetalPlate = 53,
	ePropsBat = 54,
	ePropsClub = 55,
	ePropsShovel = 56,
	ePropsAxe = 57,
	ePropsHammer = 58,
	ePropsRubberRod = 59,
	ePropsMetalRod = 60,
	ePropsFireExtinguisher = 61,
	ePropsCan = 62,
	ePropsMarbelBall = 63,
	ePropsBrick = 64,
	eSand = 65,
	eRoofTile = 66,
	ePropsPlasticDevice = 67,
	ePropsSuitcaseMetal = 68,
	ePropsSuitcaseLeather = 69,
	ePropsSuitcaseScissors = 70,
	eCarpet = 71,
	eWeaponClip = 72,
	eWindowGlass = 73,
	eSilent = 74,
	eSnowHard = 75,
	ePropsBatJapan = 76,
	eUndefined = 77,
};

// Size: 0x4
enum class ESoundPlayParameters : int32_t
{
	SOUND_PLAY_SINGLE = 0,
	SOUND_PLAY_RANDOM = 1,
	SOUND_PLAY_SHUFFLE = 2,
};

// Size: 0x4
enum class ESpeechPriority : int32_t
{
	SP_AMBIENT = 0,
	SP_ALERTED = 1,
	SP_PAIN = 2,
	SP_ALERTED_IMPORTANT = 3,
	SP_COMBAT = 4,
	SP_COMBAT_IMPORTANT = 5,
	SP_DEATH = 6,
	SP_MAX = 7,
	SP_COUNT__ = 8,
};

// Size: 0x4
enum class ESpeed : int32_t
{
	eSpeed_Idle = 0,
	eSpeed_Slow = 1,
	eSpeed_Normal = 2,
	eSpeed_Fast = 3,
	eSpeed_Sprint = 4,
};

// Size: 0x4
enum class EStandDownType : int32_t
{
	SDT_None = 0,
	SDT_Response = 1,
	SDT_Specific = 2,
};

// Size: 0x4
enum class EStandRepositionStrategy : int32_t
{
	SRS_InPlaceRepositioning = 0,
	SRS_NoRepositioning = 1,
};

// Size: 0x4
enum class EStashpointContainedEntityType : int32_t
{
	PICKUP_NONE = 0,
	PICKUP_ITEMS = 1,
	PICKUP_OUTFIT = 2,
	PICKUP_PICKEDUP = 3,
};

// Size: 0x4
enum class EStealthSituation : int32_t
{
	SS_TAKE_HUMAN_SHIELD = 0,
	SS_HUMAN_SHIELD_DEAD = 1,
	SS_HUMAN_SHIELD_EXIT = 2,
	SS_DISGUISE_TAKEN = 3,
	SS_DISGUISE_TRESPASSING = 4,
	SS_DISGUISE_ILLEGAL_ACTION = 5,
	SS_DISGUISE_REMOVED = 6,
	SS_DISGUISE_INVESTIGATED = 7,
	SS_DISGUISE_BLOWN = 8,
	SS_HIDE_IN_CLOSET_FIRSTTIME = 9,
	SS_HIDE_IN_CLOSET = 10,
	SS_DOOR_START_LOCKPICKING = 11,
	SS_DOOR_CANCEL_LOCKPICKING = 12,
	SS_LANDMINE_ARMED = 13,
	SS_RADIO_ON = 14,
	SS_VENT_ENTER = 15,
	SS_VENT_EXIT = 16,
	SS_BLEND_IN_ACTIVATED = 17,
	SS_BODY_DISCOVERED = 18,
	SS_BLOODPOOL_DISCOVERED = 19,
	SS_INVESTIGATE_GUNSHOT = 20,
	SS_INVESTIGATE_NOISE = 21,
	SS_INVESTIGATE_EXPLOSION = 22,
	SS_FUSEBOX_DISABLE_UNIQUE = 23,
	SS_FUSEBOX_DISABLE = 24,
	SS_INVESTIGATING_FUSEBOX = 25,
	SS_FUSEBOX_FIXED = 26,
	SS_KEYCARD_PICKUP = 27,
	SS_KEYCARD_USE = 28,
	SS_BODY_PUT_IN_CONTAINER = 29,
	SS_BODY_DRAGGING_SEEN = 30,
	SS_BODY_OVER_RAIL = 31,
	SS_BODY_OVER_LEDGE = 32,
	SS_USE_HEALTH_STATION = 33,
	SS_HITMAN_SPOTTED = 34,
	SS_HITMAN_HIDDEN = 35,
	SS_HITMAN_ENTERED_COMBAT = 36,
	SS_TRESPASSING = 37,
	SS_SECURITYTAPE_PICKUP = 38,
	SS_NEWOBJECTIVE = 39,
	SS_FOCUSADDED = 40,
	SS_FOCUSFULL = 41,
	SS_FOCUSEMPTY = 42,
	SS_STARTED_SPRINTING = 43,
	SS_STARTED_SNEAKING = 44,
	SS_TOOK_COVER = 45,
	SS_INVESTIGATE_CURIOUS = 46,
	SS_GENERIC_PICKUP = 47,
	SS_ATTENTION_ON = 48,
	SS_ATTENTION_OFF = 49,
	SS_DEADBODY_SEEN = 50,
	SS_TARGET_EVACUATES = 51,
	SS_UNKNOWN_BODY_SPOTTED = 52,
};

// Size: 0x4
enum class ESyncEvent : int32_t
{
	eSyncEvent_None = 0,
	eSyncEvent_LeftFoot = 100,
	eSyncEvent_RightFoot = 200,
};

// Size: 0x4
enum class ETakeDownAnim : int32_t
{
	eCoverLowOverNarrowCloseFront = 0,
	eCoverLowOverNarrowCloseBack = 1,
	eCoverLowOverNarrowFarFront = 2,
	eCoverLowOverNarrowFarBack = 3,
	eCoverLowOverWideFront = 4,
	eCoverLowOverWideBack = 5,
	eCoverLowCornerFront = 6,
	eCoverLowCornerBack = 7,
	eCoverHighCornerFront = 8,
	eCoverHighCornerBack = 9,
	eLocomotionBack = 10,
	eLocomotionFallback = 11,
	eLocomotionChair = 12,
	eChokeGroundLoop = 13,
	eChokeGroundEndPacify = 14,
	eChokeGroundEndKill = 15,
	eChokeGroundFallBackLoop = 16,
	eChokeGroundFallBackEndPacify = 17,
	eChokeGroundFallBackEndKill = 18,
	eChokeChairLoop = 19,
	eChokeChairEndPacify = 20,
	eChokeChairEndKill = 21,
	eChokeChairEndLeft90 = 22,
	eChokeChairEndLeft45 = 23,
	eChokeChairEndFront = 24,
	eChokeChairEndRight45 = 25,
	eChokeChairEndRight90 = 26,
	eTakeDownAnimLast = 27,
};

// Size: 0x4
enum class ETakeDownState : int32_t
{
	eTD_Cover = 0,
	eTD_Locomotion = 1,
	eTD_ChokeLoop = 2,
	eTD_ChokeFinish = 3,
	eTD_Deactivating = 4,
	eTD_Unknown = 5,
};

// Size: 0x1
enum class ETessellationFactorMode : int8_t
{
	TESSELLATIONFACTORMODE_FIXED = 0,
	TESSELLATIONFACTORMODE_OBJECT = 1,
	TESSELLATIONFACTORMODE_TRIANGLE = 2,
};

// Size: 0x1
enum class ETessellationMode : int8_t
{
	TESSELLATIONMODE_FLAT = 0,
	TESSELLATIONMODE_PHONG = 1,
};

// Size: 0x4
enum class ETestEnumForPG2 : int32_t
{
	TestEnum_Alpha = 0,
	TestEnum_Beta = 1,
	TestEnum_Gamma = 2,
	TestEnum_Delta = 3,
	TestEnum_Epsilon = 4,
};

// Size: 0x4
enum class ETextAlignment : int32_t
{
	TEXT_ALIGN_LEFT = 0,
	TEXT_ALIGN_CENTER = 1,
	TEXT_ALIGN_RIGHT = 2,
};

// Size: 0x4
enum class EThrowType : int32_t
{
	THROW_NONE = 0,
	THROW_COIN = 1,
	THROW_NORMAL = 2,
	THROW_HEAVY = 3,
	THROW_PACIFY_LIGHT = 4,
	THROW_PACIFY_HEAVY = 5,
	THROW_DEADLY_LIGHT = 6,
	THROW_DEADLY_HEAVY = 7,
};

// Size: 0x4
enum class EThrownCollisionSoundLoudness : int32_t
{
	eLoudness_Default = 0,
	eLoudness_Low = 1,
	eLoudness_Normal = 2,
	eLoudness_Loud = 3,
};

// Size: 0x4
enum class ETimerEntityCommandType : int32_t
{
	ETECT_Add = 0,
	ETECT_Remove = 1,
	ETECT_Reset = 2,
};

// Size: 0x4
enum class EUIActionGroupIcon : int32_t
{
	EUIAGI_NoIcon = 0,
	EUIAGI_GenericTool = 1,
	EUIAGI_Crowbar = 2,
	EUIAGI_Wrench = 3,
	EUIAGI_Screwdriver = 4,
	EUIAGI_ExplosiveDevice = 5,
	EUIAGI_Poison = 6,
	EUIAGI_Coin = 7,
	EUIAGI_Lockpick = 8,
	EUIAGI_LockpickElectic = 9,
	EUIAGI_Card = 10,
	EUIAGI_Key = 11,
	EUIAGI_Password = 12,
	EUIAGI_SAPIENZA_GolfBall = 13,
	EUIAGI_SAPIENZA_ChemicalTube = 14,
	EUIAGI_SAPIENZA_FlowBouquet = 15,
	EUIAGI_SAPIENZA_Ammunitions = 16,
	EUIAGI_RatFood = 17,
	EUIAGI_Gunpowder = 18,
	EUIAGI_Cannonball = 19,
	EUIAGI_FuguFish = 20,
	EUIAGI_CakeTopper = 21,
	EUIAGI_Knife = 22,
	EUIAGI_SpaghettiCan = 23,
	EUIAGI_MAX = 24,
};

// Size: 0x4
enum class EUIBusyOperationId : int32_t
{
	eOperationId_GameSave = 0,
	eOperationId_MenuTransition = 1,
	eOperationId_ManuallyTriggered = 2,
	eOperationId_TriggerBootFlow = 3,
	eOperationId_SaveContract = 4,
	eOperationId_StartContract = 5,
	eOperationId_SessionStart = 6,
	eOperationId_ReportContract = 7,
	eOperationId_ConnectionFlow = 8,
	eOperationId_LoadingTransitionDelayed = 9,
	eOperationId_SaveSuccess = 10,
	eOperationId_SaveFailed = 11,
	eOperationId_SessionReconnect = 12,
	eOperationId_DefaultLoadout = 13,
	eOperationId_Max = 13,
	eOperationId_Custom_01 = 14,
	eOperationId_Custom_Begin = 14,
	eOperationId_Custom_02 = 15,
	eOperationId_Custom_03 = 16,
	eOperationId_Custom_04 = 17,
	eOperationId_Custom_05 = 18,
	eOperationId_Custom_06 = 19,
	eOperationId_Custom_07 = 20,
	eOperationId_Custom_08 = 21,
	eOperationId_Custom_09 = 22,
	eOperationId_Custom_10 = 23,
	eOperationId_Custom_11 = 24,
	eOperationId_Custom_12 = 25,
	eOperationId_Custom_13 = 26,
	eOperationId_Custom_14 = 27,
	eOperationId_Custom_15 = 28,
	eOperationId_Custom_16 = 29,
	eOperationId_Custom_17 = 30,
	eOperationId_Custom_18 = 31,
	eOperationId_Custom_19 = 32,
	eOperationId_Custom_20 = 33,
	eOperationId_Custom_21 = 34,
	eOperationId_Custom_22 = 35,
	eOperationId_Custom_23 = 36,
	eOperationId_Custom_24 = 37,
	eOperationId_Custom_25 = 38,
	eOperationId_Custom_End = 39,
	eOperationId_None = 40,
};

// Size: 0x4
enum class EUIBusyState : int32_t
{
	eBusyState_Saving = 0,
	eBusyState_Saving_Failed = 1,
	eBusyState_Saving_Success = 2,
	eBusyState_Online_Connecting = 3,
	eBusyState_Loading = 4,
	eBusyState_Fetching = 5,
	eBusyState_None = 6,
};

// Size: 0x4
enum class EVIPInvestigateReason : int32_t
{
	VIR_Undefined = 0,
	VIR_HearBulletImpact = 1,
	VIR_HearPain = 2,
	VIR_HearCarAlarm = 3,
	VIR_HearRadio = 4,
	VIR_HearItemToss = 5,
	VIR_HearWarning = 6,
	VIR_HearAccident = 7,
	VIR_HearCuriousSoundFromItem = 8,
	VIR_HearCuriousSound = 9,
	VIR_SeeWeapon = 10,
	VIR_SeeSuspiciousPerceptible = 11,
	VIR_SeeInterestingItem = 12,
	VIR_SightInvestigation = 13,
	VIR_HearFootSteps = 14,
	VIR_HearAngrySpeaks = 15,
	VIR_HearCloseCombat = 16,
	VIR_HearSilencedGun = 17,
	VIR_HearNeckBreak = 18,
	VIR_HearEmptyGun = 19,
	VIR_HearFyberwire = 20,
	VIR_HearCCChoke = 21,
	VIR_HearGunshot = 22,
	VIR_HearExplosion = 23,
	VIR_SeeDeadBody = 24,
	VIR_SeeGuardBody = 25,
	VIR_SeeDeath = 26,
	VIR_SeeProjectileDamage = 27,
	VIR_SeeExplosionDamage = 28,
	VIR_SeeNPCBeingShot = 29,
	VIR_SeeHMThrowing = 30,
	VIR_SightReaction = 31,
	VIR_SeeAgility = 32,
	VIR_SeeHMEnteringACloset = 33,
	VIR_SeeHMExitingACloset = 34,
	VIR_HMBumpingIntoMe = 35,
	VIR_SeeSickNPC = 36,
	VIR_SeeHMInMiPrivateSpace = 37,
	VIR_HitByItem = 38,
};

// Size: 0x1
enum class EValueUpdateStrategy : int8_t
{
	UPDATE_STRATEGY_REPLACE = 0,
	UPDATE_STRATEGY_ADD_TO = 1,
	UPDATE_STRATEGY_MULTIPLY = 2,
};

// Size: 0x4
enum class EVictimMovementType : int32_t
{
	eVictimMovementNone = -1,
	eVictimMovementPullVictimFromWindow = 0,
	eVictimMovementThrowBodyOverRail = 1,
	eVictimMovementDumpBodyOverLedge = 2,
	eVictimMovementTakeDown = 3,
	eVictimMovementRecoveryFinisher = 4,
	eVictimMovementGrabVictim = 5,
	eVictimMovementPushVictimThroughWindowAndRail = 6,
	eVictimMovementContextKill = 7,
	eVictimMovementKickVictimOverLedge = 8,
	eVictimMovementCoupDeGrace = 9,
	eVictimMovementCloseCombat = 10,
	eVictimMovementLast = 11,
};

// Size: 0x4
enum class EViewportLock : int32_t
{
	VPL_None = 0,
	VPL_Rectangular = 1,
	VPL_Rectangular_AvoidMinimapOverlap = 2,
};

// Size: 0x4
enum class EVolumeTriggerEntityTypeFlags : int32_t
{
	VTET_Hitman = 1,
	VTET_ActorAlive = 2,
	VTET_ActorDead = 4,
	VTET_ActorPacified = 8,
	VTET_ThrownItem = 16,
	VTET_Spatial = 32,
	VTET_SoundSweetener = 64,
	VTET_ExplodeableItem = 128,
	VTET_Item = 256,
	VTET_SpatialVisible = 512,
};

// Size: 0x4
enum class EWaypointRotationAlignment : int32_t
{
	RA_NONE = 0,
	RA_LOOSE = 1,
	RA_EXACT = 2,
};

// Size: 0x4
enum class EWeaponAnimationCategory : int32_t
{
	eWAC_Undefined = 0,
	eWAC_Pistol = 1,
	eWAC_Revolver = 2,
	eWAC_SMG_2H = 3,
	eWAC_SMG_1H = 4,
	eWAC_Rifle = 5,
	eWAC_Sniper = 6,
	eWAC_Shotgun_Pump = 7,
	eWAC_Shotgun_Semi = 8,
};

// Size: 0x4
enum class EWeaponSpecialSituation : int32_t
{
	WSS_NORMAL = 0,
	WSS_BAREHANDS = 1,
	WSS_EXPLOSION = 2,
	WSS_ACCIDENT = 3,
	WSS_NPC_FRIENDLY_FIRE = 4,
	WSS_EXECUTE_PISTOL = 5,
	WSS_ANY_WEAPON = 6,
	WSS_INVISIBLE = 7,
};

// Size: 0x4
enum class EWeaponUpgradeIcon : int32_t
{
	WEAPON_UPGRADE_ICON_NONE = 0,
	WEAPON_UPGRADE_ICON_SILENCER = 1,
	WEAPON_UPGRADE_ICON_RED_DOT_SIGHT = 2,
	WEAPON_UPGRADE_ICON_AMMUNITION = 3,
	WEAPON_UPGRADE_ICON_MAGAZINE = 4,
	WEAPON_UPGRADE_ICON_EXTCLIP = 5,
	WEAPON_UPGRADE_ICON_SHELLS = 6,
	WEAPON_UPGRADE_ICON_SLIDE = 7,
	WEAPON_UPGRADE_ICON_BOLT = 8,
	WEAPON_UPGRADE_ICON_BARREL = 9,
	WEAPON_UPGRADE_ICON_HAMMER = 10,
	WEAPON_UPGRADE_ICON_CHUTE = 11,
	WEAPON_UPGRADE_ICON_DUALWIELD = 12,
	WEAPON_UPGRADE_ICON_MAGNUM = 13,
	WEAPON_UPGRADE_ICON_STOCK = 14,
};

// Size: 0x4
enum class EWeaponUpgradeUse : int32_t
{
	eWUU_PrimaryOnly = 0,
	eWUU_SecondaryOnly = 1,
	eWUU_AllFireModes = 2,
};

// Size: 0x8
class /*alignas(4)*/ ZResourcePtr{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZResourcePtr& p_Other) const;
	bool operator!=(const ZResourcePtr& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0xC
class /*alignas(4)*/ SVector3{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SVector3& p_Other) const;
	bool operator!=(const SVector3& p_Other) const { return !(*this == p_Other); }

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
};

// Size: 0x8
class /*alignas(0)*/ IBoneAnimator{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IBoneAnimator& p_Other) const;
	bool operator!=(const IBoneAnimator& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(8)*/ ZEntityRef{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZEntityRef& p_Other) const;
	bool operator!=(const ZEntityRef& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x30
class /*alignas(4)*/ SMatrix43{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SMatrix43& p_Other) const;
	bool operator!=(const SMatrix43& p_Other) const { return !(*this == p_Other); }

	SVector3 XAxis; // 0x0
	SVector3 YAxis; // 0xC
	SVector3 ZAxis; // 0x18
	SVector3 Trans; // 0x24
};

class ZSpatialEntity
{
public:
	// Size: 0x4
	enum class ERoomBehaviour : int32_t
	{
		ROOM_STATIC = 0,
		ROOM_DYNAMIC = 1,
		ROOM_STATIC_OUTSIDE_CLIENT = 2,
	};

};

// Size: 0x8
class /*alignas(0)*/ IComponentInterface{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IComponentInterface& p_Other) const;
	bool operator!=(const IComponentInterface& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IActor{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IActor& p_Other) const;
	bool operator!=(const IActor& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IActorProvider{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IActorProvider& p_Other) const;
	bool operator!=(const IActorProvider& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IActorProviderFilter{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IActorProviderFilter& p_Other) const;
	bool operator!=(const IActorProviderFilter& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IAnimPlayerEntity{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IAnimPlayerEntity& p_Other) const;
	bool operator!=(const IAnimPlayerEntity& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IAudioEmitter{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IAudioEmitter& p_Other) const;
	bool operator!=(const IAudioEmitter& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IBodybagEntity{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IBodybagEntity& p_Other) const;
	bool operator!=(const IBodybagEntity& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IBoneCollidable{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IBoneCollidable& p_Other) const;
	bool operator!=(const IBoneCollidable& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IBulletImpactListener{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IBulletImpactListener& p_Other) const;
	bool operator!=(const IBulletImpactListener& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

class ICameraEntity
{
public:
	// Size: 0x4
	enum class EProjectionType : int32_t
	{
		ePerspectiveRH = 0,
		eOrtogonalRH = 1,
		eCustom = 2,
	};

};

class ICloset
{
public:
	// Size: 0x4
	enum class EClosetType : int32_t
	{
		eTypeClosetNormal = 0,
		eTypeClosetCake = 1,
		eTypeClosetDumpster = 2,
		eTypeClosetLast = 3,
	};

};

// Size: 0x8
class /*alignas(0)*/ IContractEvaluationContextListener{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IContractEvaluationContextListener& p_Other) const;
	bool operator!=(const IContractEvaluationContextListener& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x10
class /*alignas(8)*/ ZGuid{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZGuid& p_Other) const;
	bool operator!=(const ZGuid& p_Other) const { return !(*this == p_Other); }

	uint32 _a; // 0x0
	uint16 _b; // 0x4
	uint16 _c; // 0x6
	uint8 _d; // 0x8
	uint8 _e; // 0x9
	uint8 _f; // 0xA
	uint8 _g; // 0xB
	uint8 _h; // 0xC
	uint8 _i; // 0xD
	uint8 _j; // 0xE
	uint8 _k; // 0xF
};

// Size: 0x8
class /*alignas(0)*/ IContractObjective{
public:
	// Size: 0x4
	enum class Category : int32_t
	{
		PRIMARY = 0,
		SECONDARY = 1,
		CONDITION = 2,
	};

	// Size: 0x4
	enum class ObjectiveType : int32_t
	{
		KILL = 0,
		SETPIECE = 1,
		CUSTOMKILL = 2,
		CUSTOM = 3,
	};

	// Size: 0x4
	enum class State : int32_t
	{
		IN_PROGRESS = 0,
		COMPLETED = 1,
		FAILED = 2,
	};

	// Size: 0x4
	enum class Type : int32_t
	{
		CONTRACT_OBJ_EVENT_BASED = 0,
		CONTRACT_OBJ_SM_BASED = 1,
	};


public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IContractObjective& p_Other) const;
	bool operator!=(const IContractObjective& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IEscortOutSituation{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IEscortOutSituation& p_Other) const;
	bool operator!=(const IEscortOutSituation& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IEventConsumerCollection{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IEventConsumerCollection& p_Other) const;
	bool operator!=(const IEventConsumerCollection& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IFreeCameraControl{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IFreeCameraControl& p_Other) const;
	bool operator!=(const IFreeCameraControl& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IHM5Door{
public:
	// Size: 0x4
	enum class ECPDoorLockType : int32_t
	{
		CPDLT_NORMAL_LOCK = 0,
		CPDLT_PUSH_BAR_PAD_LOCK = 1,
	};

	// Size: 0x4
	enum class EInitialState : int32_t
	{
		IS_CLOSED = 0,
		IS_OPEN = 1,
		IS_OPEN_IN = 2,
		IS_OPEN_OUT = 3,
	};

	// Size: 0x4
	enum class EOpenDir : int32_t
	{
		OD_AWAY = 0,
		OD_TOWARS = 1,
		OD_IN = 2,
		OD_OUT = 3,
	};

	// Size: 0x4
	enum class EOpenMode : int32_t
	{
		OM_TWO_WAY = 0,
		OM_OPEN_POS_SIDE_ONLY = 1,
		OM_OPEN_NEG_SIDE_ONLY = 2,
		OM_DISABLED = 3,
	};

	// Size: 0x4
	enum class eCloseMode : int32_t
	{
		CM_AUTOCLOSE = 0,
		CM_MANUALCLOSE = 1,
		CM_NEVERCLOSE = 2,
	};


public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IHM5Door& p_Other) const;
	bool operator!=(const IHM5Door& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IHM5WeaponInventory{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IHM5WeaponInventory& p_Other) const;
	bool operator!=(const IHM5WeaponInventory& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IHumanBody{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IHumanBody& p_Other) const;
	bool operator!=(const IHumanBody& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

class IItemWeapon
{
public:
	// Size: 0x4
	enum class EDeadlyThrowType : int32_t
	{
		DEADLYTHROW_NONE = 0,
		DEADLYTHROW_LIGHT = 1,
		DEADLYTHROW_HEAVY = 2,
	};

};

// Size: 0x4
enum class IKEndEffector : int32_t
{
	BEE_Pelvis = 0,
	BEE_SpineOrigin = 1,
	BEE_SpineEnd = 2,
	BEE_Head = 3,
	BEE_LeftUpperArm = 4,
	BEE_RightUpperArm = 5,
	BEE_LeftForeArm = 6,
	BEE_RightForeArm = 7,
	BEE_LeftHand = 8,
	BEE_LeftHandThumb = 9,
	BEE_LeftHandIndex = 10,
	BEE_LeftHandMiddle = 11,
	BEE_LeftHandRing = 12,
	BEE_LeftHandPinky = 13,
	BEE_RightHand = 14,
	BEE_RightHandThumb = 15,
	BEE_RightHandIndex = 16,
	BEE_RightHandMiddle = 17,
	BEE_RightHandRing = 18,
	BEE_RightHandPinky = 19,
	BEE_LeftFoot = 20,
	BEE_RightFoot = 21,
	BEE_LeftToe = 22,
	BEE_RightToe = 23,
	BEE_Count = 24,
};

class ILightEntity
{
public:
	// Size: 0x4
	enum class EFrameIndexStrategy : int32_t
	{
		WRAP = 0,
		CLAMP = 1,
	};

	// Size: 0x1
	enum class ELightType : int8_t
	{
		LT_DIRECTIONAL = 0,
		LT_ENVIRONMENT = 1,
		LT_OMNI = 2,
		LT_SPOT = 3,
		LT_SQUARESPOT = 4,
		LT_CAPSULE = 5,
		LT_AREA_QUAD = 6,
	};

	// Size: 0x4
	enum class ERoomLightFlow : int32_t
	{
		AUTOMATIC = 0,
		LOCAL = 1,
		ALLROOMS = 2,
	};

};

// Size: 0x8
class /*alignas(0)*/ IMetricValue{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IMetricValue& p_Other) const;
	bool operator!=(const IMetricValue& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IMorphemeCutSequenceAnimatable{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IMorphemeCutSequenceAnimatable& p_Other) const;
	bool operator!=(const IMorphemeCutSequenceAnimatable& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IMorphemeCutSequenceAnimationEntity{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IMorphemeCutSequenceAnimationEntity& p_Other) const;
	bool operator!=(const IMorphemeCutSequenceAnimationEntity& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IMorphemeEventConsumer{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IMorphemeEventConsumer& p_Other) const;
	bool operator!=(const IMorphemeEventConsumer& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IOnlineConfigurationListener{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IOnlineConfigurationListener& p_Other) const;
	bool operator!=(const IOnlineConfigurationListener& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IPureWaterReflectable{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IPureWaterReflectable& p_Other) const;
	bool operator!=(const IPureWaterReflectable& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x1
class /*alignas(1)*/ IRenderCompositorEntity{
public:
	// Size: 0x4
	enum class EMode : int32_t
	{
		eSourceA = 0,
		eSourceB = 1,
		eLayered = 2,
		eAlphaLayered = 3,
	};

	// Size: 0x4
	enum class EViewportAnchor : int32_t
	{
		eFill = 0,
		eTopLeft = 1,
		eTopRight = 2,
		eBottomLeft = 3,
		eBottomRight = 4,
	};


public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IRenderCompositorEntity& p_Other) const;
	bool operator!=(const IRenderCompositorEntity& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[1] {};
};

// Size: 0x8
class /*alignas(0)*/ IRenderMaterialDescriptor{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IRenderMaterialDescriptor& p_Other) const;
	bool operator!=(const IRenderMaterialDescriptor& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

class IRenderMaterialEntity
{
public:
	// Size: 0x4
	enum class EModifierOperation : int32_t
	{
		eLeave = 0,
		eReplace = 1,
		eModulate = 2,
		eAdd = 3,
		eColor = 128,
	};

};

class IRoomEntity
{
public:
	// Size: 0x4
	enum class EReasoningGridImportance : int32_t
	{
		RGI_NoGrid = 0,
		RGI_Low = 1,
		RGI_Normal = 2,
		RGI_High = 3,
		RGI_Extreme = 4,
	};

};

namespace IScatterContainerEntity {
	// Size: 0x4
	enum class EBrushStampMode : int32_t
	{
		BRUSHSTAMP_ADD = 0,
		BRUSHSTAMP_SUB = 1,
		BRUSHSTAMP_SOLID = 2,
	};

	// Size: 0x4
	enum class EBrushType : int32_t
	{
		BRUSH_SQUARE = 0,
		BRUSH_CIRCLE = 1,
	};

	// Size: 0x4
	enum class ECanvasClearMode : int32_t
	{
		CLEAR_ALL = 0,
		CLEAR_INTENSITY = 1,
		CLEAR_SPECIFICMATERIAL = 2,
		CLEAR_ALLMATERIALS = 3,
		CLEAR_SETINTENSITYVALUECLEARMATERIAL = 4,
		CLEAR_SETINTENSITYVALUEKEEPMATERIAL = 5,
		CLEAR_SETINTENSITYVALUEANDMATERIAL = 6,
		CLEAR_SETMATERIALKEEPINTENSITYVALUE = 7,
	};

	// Size: 0x4
	enum class ECanvasSize : int32_t
	{
		SIZE_128 = 0,
		SIZE_256 = 1,
		SIZE_512 = 2,
		SIZE_1024 = 3,
		SIZE_2048 = 4,
		SIZE_4096 = 5,
	};

	// Size: 0x4
	enum class EResizeMode : int32_t
	{
		MODE_CLEAR = 0,
		MODE_KEEPASCENTER = 1,
		MODE_SCALE = 2,
	};

}

// Size: 0x8
class /*alignas(0)*/ ISequenceTarget{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ISequenceTarget& p_Other) const;
	bool operator!=(const ISequenceTarget& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ ISituation{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ISituation& p_Other) const;
	bool operator!=(const ISituation& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ ISoundMaterialDescriptor{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ISoundMaterialDescriptor& p_Other) const;
	bool operator!=(const ISoundMaterialDescriptor& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ ITriggerListener{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ITriggerListener& p_Other) const;
	bool operator!=(const ITriggerListener& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IUIDataListener{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IUIDataListener& p_Other) const;
	bool operator!=(const IUIDataListener& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IValueEntity{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IValueEntity& p_Other) const;
	bool operator!=(const IValueEntity& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

// Size: 0x8
class /*alignas(0)*/ IWorldMapMarker{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const IWorldMapMarker& p_Other) const;
	bool operator!=(const IWorldMapMarker& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

namespace InputControlNamesp {
	// Size: 0x4
	enum class eHM5InputAction : int32_t
	{
		eIAButtonFaceDown_Downedge = 0,
		eIAButtonFaceDown_FastTap = 1,
		eIAButtonFaceDown_HldDwnOnce = 2,
		eIAButtonFaceDown_Hold = 3,
		eIAButtonFaceDown_HoldDown = 4,
		eIAButtonFaceLeft_Downedge = 5,
		eIAButtonFaceLeft_HldDwnOnce = 6,
		eIAButtonFaceLeft_Hold = 7,
		eIAButtonFaceLeft_HoldDown = 8,
		eIAButtonFaceLeft_FastTap = 9,
		eIAButtonFaceLeft_Tap = 10,
		eIAButtonFaceLeft_Release = 11,
		eIAButtonFaceLeft_Repeat = 12,
		eIAButtonFaceRight_Downedge = 13,
		eIAButtonFaceRight_HldDwnOnce = 14,
		eIAButtonFaceRight_Hold = 15,
		eIAButtonFaceRight_HoldDown = 16,
		eIAButtonFaceRight_FastTap = 17,
		eIAButtonFaceRight_Tap = 18,
		eIAButtonFaceRight_Release = 19,
		eIAButtonFaceRight_Repeat = 20,
		eIAButtonFaceUp_Downedge = 21,
		eIAButtonFaceUp_FastTap = 22,
		eIAButtonFaceUp_HldDwnOnce = 23,
		eIAButtonFaceUp_Hold = 24,
		eIAButtonFaceUp_HoldDown = 25,
		eIABumperLeft_FastTap = 26,
		eIABumperLeft_Hold = 27,
		eIABumperLeft_Holddown = 28,
		eIABumperRight_FastTap = 29,
		eIABumperRight_Hold = 30,
		eIABumperRight_Holddown = 31,
		eIADpadUp_Downedge = 32,
		eIADpadUp_HldDwnOnce = 33,
		eIADpadUp_FastTap = 34,
		eIADpadDown_Downedge = 35,
		eIADpadDown_FastTap = 36,
		eIADpadDown_HldDwnOnce = 37,
		eIADpadLeft_Downedge = 38,
		eIADpadRight_Downedge = 39,
		eIAThumbRight_Downedge = 40,
		eIAThumbLeft_Hold = 41,
		eIAThumbLeft_DownEdge = 42,
		eIATriggerLeft_FastTap = 43,
		eIATriggerLeft_Hold = 44,
		eIATriggerLeft_Holddown = 45,
		eIATriggerRight_FastTap = 46,
		eIATriggerRight_Hold = 47,
		eIATriggerRight_Holddown = 48,
		eIAGenericStart_Hold = 49,
		eIAKBMMoveUp = 50,
		eIAKBMMoveDown = 51,
		eIAKBMMoveLeft = 52,
		eIAKBMMoveRight = 53,
		eIAKBMUse = 54,
		eIAKBMUse2 = 55,
		eIAKBMUse2Hold = 56,
		eIAKBMPickup = 57,
		eIAKBMCover = 58,
		eIAKBMDragBody = 59,
		eIAKBMMelee = 60,
		eIAKBMMelee_Repeat = 61,
		eIAKBMActivateProp = 62,
		eIAKBMActivateProp_HldDwnOnce = 63,
		eIAKBMTakeDisguise = 64,
		eIAKBMRun = 65,
		eIAKBMAim = 66,
		eIAKBMShoot = 67,
		eIAKBMShoot_Downedge = 68,
		eIAKBMShoot_Release = 69,
		eIAKBMReload = 70,
		eIAKBMInstinct = 71,
		eIAKBMCamSwitch = 72,
		eIAKBMSneak = 73,
		eIAKBMHolster = 74,
		eIAKBMFireMode = 75,
		eIAKBMNotebook = 76,
		eIAKBMPause = 77,
		eIAKBMWeapon1 = 78,
		eIAKBMWeapon2 = 79,
		eIAKBMWeapon3 = 80,
		eIAKBMWeapon4 = 81,
		eIAKBMWeapon5 = 82,
		eIAKBMWeapon6 = 83,
		eIAKBMWeapon7 = 84,
		eIAKBMPrecisionAim = 85,
		eIAKBMZoomIn = 86,
		eIAKBMZoomOut = 87,
		eIAKBMDropItem = 88,
		eIAKBMInventory = 89,
		eIAKBMSurrender = 90,
		eIAKBMSurrender_Hold = 91,
		eIAKBMSurrender_HoldDown = 92,
		eIAKBMSurrender_HoldDownOnce = 93,
		eIAKBMTogglePlacement = 94,
		eIAKBMOkay = 95,
		eIAKBMCancel = 96,
		eIAKBMAccept = 97,
		eIATriggerLeft_Analog = 98,
		eIATriggerRight_Analog = 99,
		eIAStickLeftHorizontal_Analog = 100,
		eIAStickLeftVertical_Analog = 101,
		eIAStickRightHorizontal_Analog = 102,
		eIAStickRightVertical_Analog = 103,
		eIAStickLeftHorizontal_Raw = 104,
		eIAStickLeftVertical_Raw = 105,
		eIAStickRightHorizontal_Raw = 106,
		eIAStickRightVertical_Raw = 107,
		eIABumperLeft_Analog = 108,
		eIABumperRight_Analog = 109,
		eIAKBMMoveHorizontal = 110,
		eIAKBMMoveVertical = 111,
		eIAKBMLookHorizontal = 112,
		eIAKBMLookVertical = 113,
		eIActionsNUM = 114,
	};

	// Size: 0x4
	enum class eHM5InputActionID : int32_t
	{
		eIDButtonFaceDown = 0,
		eIDButtonFaceLeft = 1,
		eIDButtonFaceRight = 2,
		eIDButtonFaceUp = 3,
		eIDBumperLeft = 4,
		eIDBumperRight = 5,
		eIDDpadDown = 6,
		eIDDpadLeft = 7,
		eIDDpadRight = 8,
		eIDDpadUp = 9,
		eIDThumbLeft = 10,
		eIDThumbRight = 11,
		eIDButtonStart = 12,
		eIDButtonSelect = 13,
		eIDTriggerLeft = 14,
		eIDTriggerRight = 15,
		eIDStickLeftHorizontal = 16,
		eIDStickLeftVertical = 17,
		eIDStickRightHorizontal = 18,
		eIDStickRightVertical = 19,
		eIDKeyboard = 20,
		eID_INVALID = 21,
	};

	// Size: 0x4
	enum class eHM5InputActionType : int32_t
	{
		eTypeGet = 0,
		eTypeHold = 1,
		eTypeRepeat = 2,
		eTypeTap = 3,
		eTypeRelease = 4,
		eTypeDownedge = 5,
		eTypeFastTap = 6,
		eTypeHoldDown = 7,
		eTypeFireOnceHoldDown = 8,
		eTypeClickHold = 9,
		eTypePress = 10,
		eTypeANALOG = 11,
		eTypeANALOGRAW = 12,
		eTypeRELATIVE = 13,
		eTYPE_INVALID = 14,
	};

}

namespace MenuWeaponUpgradeData {
	// Size: 0x4
	enum class EUpgradeAction : int32_t
	{
		EUPGRADE_ACTION_NONE = 0,
		EUPGRADE_ACTION_INSTALL = 1,
		EUPGRADE_ACTION_REMOVE = 2,
		EUPGRADE_ACTION_UNLOCK_SLOT = 3,
		EUPGRADE_ACTION_BUY_NEXT_LEVEL = 4,
		EUPGRADE_ACTION_EQUIP_WEAPON = 5,
		EUPGRADE_ACTION_UNEQUIP_WEAPON = 6,
		EUPGRADE_ACTION_CLEAR_LEVELS = 7,
	};

}

// Size: 0x28
class /*alignas(4)*/ S25DProjectionSettings{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const S25DProjectionSettings& p_Other) const;
	bool operator!=(const S25DProjectionSettings& p_Other) const { return !(*this == p_Other); }

	float32 fNearDistance; // 0x0
	float32 fFarDistance; // 0x4
	float32 fNearScale; // 0x8
	float32 fFarScale; // 0xC
	float32 fScaleFactor; // 0x10
	float32 fNearAlpha; // 0x14
	float32 fFarAlpha; // 0x18
	float32 fAlphaFactor; // 0x1C
	EViewportLock eViewportLock; // 0x20
	float32 fViewportGutter; // 0x24
};

// Size: 0x8
class /*alignas(4)*/ S3rdPersonCameraSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const S3rdPersonCameraSaveData& p_Other) const;
	bool operator!=(const S3rdPersonCameraSaveData& p_Other) const { return !(*this == p_Other); }

	float32 m_fAngleYaw; // 0x0
	float32 m_fAnglePitch; // 0x4
};

// Size: 0x8
class /*alignas(8)*/ ZGameTime{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZGameTime& p_Other) const;
	bool operator!=(const ZGameTime& p_Other) const { return !(*this == p_Other); }

	int64 m_nTicks; // 0x0
};

// Size: 0x18
class /*alignas(8)*/ SAIEventSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAIEventSaveData& p_Other) const;
	bool operator!=(const SAIEventSaveData& p_Other) const { return !(*this == p_Other); }

	EAIEventType m_eType; // 0x0
	bool m_bHandled; // 0x4
	uint8_t _pad5[3] {};
	ZGameTime m_nStart; // 0x8
	ZGameTime m_nEnd; // 0x10
};

// Size: 0x28
class /*alignas(4)*/ SAIModifierServiceActorSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAIModifierServiceActorSaveData& p_Other) const;
	bool operator!=(const SAIModifierServiceActorSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActorRef; // 0x0
	bool m_bNeedsVolumeUpdate; // 0x4
	bool m_bNeedsKnowledgeUpdate; // 0x5
	uint8_t _pad6[2] {};
	uint32 m_uiModVolume; // 0x8
	uint32 m_uiModBehavior; // 0xC
	uint32 m_uiModRole; // 0x10
	uint32 m_uiModItem; // 0x14
	uint32 m_uiModSituation; // 0x18
	uint32 m_uiModOutfit; // 0x1C
	uint32 m_uiModOverride; // 0x20
	uint32 m_uiModStatus; // 0x24
};

// Size: 0x20
class /*alignas(8)*/ SAIModifierServiceSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAIModifierServiceSaveData& p_Other) const;
	bool operator!=(const SAIModifierServiceSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bFullVolumeUpdate; // 0x0
	uint8_t _pad1[7] {};
	TArray<SAIModifierServiceActorSaveData> m_aActors; // 0x8
};

// Size: 0x1
class /*alignas(1)*/ SAIPerceptibleEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAIPerceptibleEntitySaveData& p_Other) const;
	bool operator!=(const SAIPerceptibleEntitySaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bPerceptibleEnabled; // 0x0
};

// Size: 0x1
class /*alignas(1)*/ SAIVisionBlockerSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAIVisionBlockerSaveData& p_Other) const;
	bool operator!=(const SAIVisionBlockerSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bEnabled; // 0x0
};

// Size: 0xC
class /*alignas(4)*/ SAccessoryItemSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAccessoryItemSaveData& p_Other) const;
	bool operator!=(const SAccessoryItemSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rEntity; // 0x0
	uint32 m_nBoneId; // 0x4
	bool m_bAttached; // 0x8
	bool m_bVisible; // 0x9
	uint8_t _padA[2] {};
};

class ZBoneAttachEntity
{
public:
	// Size: 0x4
	enum class EResetMode : int32_t
	{
		eAtBoneOrigin = 0,
		eKeepOffset = 1,
	};

};

// Size: 0xC
class /*alignas(4)*/ SColorRGB{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SColorRGB& p_Other) const;
	bool operator!=(const SColorRGB& p_Other) const { return !(*this == p_Other); }

	float32 r; // 0x0
	float32 g; // 0x4
	float32 b; // 0x8
};

class ZActBehaviorEntity
{
public:
	// Size: 0x4
	enum class EApproachAlignment : int32_t
	{
		AA_STRICT = 0,
		AA_LOOSE = 1,
	};

	// Size: 0x4
	enum class EMovementType : int32_t
	{
		MT_WALK = 0,
		MT_SNAP = 1,
		MT_IGNORE_POSITION = 2,
	};

	// Size: 0x4
	enum class ERotationAlignment : int32_t
	{
		RA_NONE = 0,
		RA_LOOSE = 1,
		RA_EXACT = 2,
	};

	// Size: 0x4
	enum class EState : int32_t
	{
		UNDEFINED = 0,
		IDLE = 1,
		STOPPING = 2,
		PREPARING = 3,
		MOVING = 4,
		ENTERING = 5,
		RUNNING = 6,
		TIMEDOUT = 7,
		COMPLETE = 8,
	};

};

// Size: 0x10
class /*alignas(8)*/ SActBehaviorEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActBehaviorEntitySaveData& p_Other) const;
	bool operator!=(const SActBehaviorEntitySaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bStartedSignalSent; // 0x0
	bool m_bReachedSignalSent; // 0x1
	uint8_t _pad2[2] {};
	ZActBehaviorEntity::EState m_nState; // 0x4
	ZGameTime m_ActStartTime; // 0x8
};

// Size: 0x10
class /*alignas(16)*/ float4{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const float4& p_Other) const;
	bool operator!=(const float4& p_Other) const { return !(*this == p_Other); }

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
	float32 w; // 0xC
};

// Size: 0x40
class /*alignas(16)*/ SActOrderSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActOrderSaveData& p_Other) const;
	bool operator!=(const SActOrderSaveData& p_Other) const { return !(*this == p_Other); }

	ZString m_sAct; // 0x0
	float32 m_fDuration; // 0x10
	uint32 m_rChildNetworkEntity; // 0x14
	uint8_t _pad18[8] {};
	float4 m_faceTarget; // 0x20
	bool m_bBlendOutImmediatelyUponTimeout; // 0x30
	bool m_bDropCarriedItems; // 0x31
	bool m_bStopCurrentActFast; // 0x32
	uint8_t _pad33[13] {};
};

// Size: 0x18
class /*alignas(8)*/ SActionRadialArcDisplayInfo{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActionRadialArcDisplayInfo& p_Other) const;
	bool operator!=(const SActionRadialArcDisplayInfo& p_Other) const { return !(*this == p_Other); }

	bool hidden; // 0x0
	bool locked; // 0x1
	bool active; // 0x2
	bool illegal; // 0x3
	int32 icon; // 0x4
	ZString label; // 0x8
};

// Size: 0x18
class /*alignas(8)*/ SActionRadialArcDisplayInfoArray_dummy{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActionRadialArcDisplayInfoArray_dummy& p_Other) const;
	bool operator!=(const SActionRadialArcDisplayInfoArray_dummy& p_Other) const { return !(*this == p_Other); }

	TArray<SActionRadialArcDisplayInfo> dummy; // 0x0
};

// Size: 0x4
class /*alignas(4)*/ SActorAccessoryItemActionSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorAccessoryItemActionSaveData& p_Other) const;
	bool operator!=(const SActorAccessoryItemActionSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
};

// Size: 0x18
class /*alignas(4)*/ SActorAnimSetSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorAnimSetSaveData& p_Other) const;
	bool operator!=(const SActorAnimSetSaveData& p_Other) const { return !(*this == p_Other); }

	EAnimSetType m_eAnimSet; // 0x0
	uint32 m_rCustomAnimationSet; // 0x4
	EGameTension m_eVariationResourceMaxTension; // 0x8
	EActorEmotionState m_eVariationResourceMaxEmotionState; // 0xC
	EAnimSetState m_eAnimSetEmotionState; // 0x10
	EAnimSetType m_ePreCustomAnimSet; // 0x14
};

// Size: 0x8
class /*alignas(4)*/ SActorBoneAttachSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorBoneAttachSaveData& p_Other) const;
	bool operator!=(const SActorBoneAttachSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rAttachmentTarget; // 0x0
	bool m_bIsAttached; // 0x4
	uint8_t _pad5[3] {};
};

// Size: 0x30
class /*alignas(8)*/ SActorBoneAttachmentsSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorBoneAttachmentsSaveData& p_Other) const;
	bool operator!=(const SActorBoneAttachmentsSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SActorBoneAttachSaveData> m_aData; // 0x18
};

// Size: 0x10
class /*alignas(4)*/ SVector4{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SVector4& p_Other) const;
	bool operator!=(const SVector4& p_Other) const { return !(*this == p_Other); }

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
	float32 w; // 0xC
};

// Size: 0x20
class /*alignas(4)*/ SActorBoneSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorBoneSaveData& p_Other) const;
	bool operator!=(const SActorBoneSaveData& p_Other) const { return !(*this == p_Other); }

	SVector4 mQuaterion; // 0x0
	SVector4 mTranslation; // 0x10
};

// Size: 0x1
class /*alignas(1)*/ SActorSoundDefs{
public:
	// Size: 0x4
	enum class EDefinition : int32_t
	{
		_NoSound = 0,
		Dth_BrkNck = 1,
		Dth_Fll = 2,
		Dth_GnSht = 3,
		Dth_HdSht = 4,
		Dth_Mpct = 5,
		Dth_SltThrt = 6,
		Dth_Strngl = 7,
		Dth_Xplo = 8,
		Dth_PrpF = 9,
		Dth_Electro = 10,
		Dth_Burn = 11,
		Dth_Crush = 12,
		Dth_Scrm = 13,
		Dth_Hrt = 14,
		Dth_SrpsGrab = 15,
		Dth_HumShldStrain = 16,
		Dth_Snore = 17,
		Dth_Groan = 18,
		Dth_Dump = 19,
		Dth_PrpTssFrntAck = 20,
		Dth_Headlock = 21,
		Gen_Grt47 = 22,
		Gen_GrtGrd47WGun = 23,
		Gen_GrtTrgt = 24,
		Gen_GrtTrgtRsp = 25,
		Gen_NPC2NPCGrt = 26,
		Gen_NPC2NPCRsp = 27,
		Gen_GtHlp = 28,
		Gen_GtHlpLd = 29,
		Gen_GtHlp47Knwn = 30,
		Gen_Mssng = 31,
		Gen_HMHere = 32,
		Gen_HMThere = 33,
		Gen_SrpsLow = 34,
		Gen_SrpsLowShort = 35,
		Gen_Srps = 36,
		Gen_SrpsLd = 37,
		Gen_StndRsp = 38,
		Gen_Stop = 39,
		Gen_StopLd = 40,
		Gen_Reveal = 41,
		Gen_ThumbsUp = 42,
		Gen_BrknAck = 43,
		Gen_Ack = 44,
		Gen_AckLd = 45,
		Gen_AckNtnse = 46,
		Gen_BumpAck = 47,
		Gen_Curse = 48,
		Gen_CurseLow = 49,
		Gen_DrpGun = 50,
		Gen_DrpCase = 51,
		Gen_CoinCurse = 52,
		Gen_TransportGreet = 53,
		Gen_NoWay1 = 54,
		Gen_NoWay2Kidding = 55,
		Gen_NoWay3Joke = 56,
		Gen_NoWay44Real = 57,
		Gen_NoWay5DntBeliv = 58,
		Gen_NoWay6Serious = 59,
		Gen_NoWay7Horrible = 60,
		Gen_Way1 = 61,
		Gen_Way2Kidding = 62,
		Gen_Way3Joke = 63,
		Gen_Way44Real = 64,
		Gen_Way5DntBeliv = 65,
		Gen_Way6Serious = 66,
		Gen_Way7Horrible = 67,
		Gen_NkdRunAck = 68,
		Gen_Grasp = 69,
		Gen_Amused = 70,
		Gen_Annoyed = 71,
		Gen_BdygrdArrive = 72,
		Gen_BdygrdMovOut = 73,
		Gen_GiveUp = 74,
		Gen_Off = 75,
		Gen_On = 76,
		Gen_PanicLow = 77,
		Gen_Sick = 78,
		Gen_SmellAck = 79,
		Gen_SmrtPhnAct = 80,
		Gen_PhoneAct = 81,
		Gtag = 82,
		ClsCmbt_Ack = 83,
		ClsCmbt_Tnt = 84,
		Cmbt_BackupCll = 85,
		Cmbt_BadDsg = 86,
		Cmbt_Beg = 87,
		Cmbt_ClsAck = 88,
		Cmbt_Fire = 89,
		Cmbt_FireLdr = 90,
		Cmbt_GtHit = 91,
		Cmbt_HitHM = 92,
		Cmbt_HMClsCmbtAck = 93,
		Cmbt_HMCvr = 94,
		Cmbt_HMFire = 95,
		Cmbt_HMFlnk = 96,
		Cmbt_HMHeadPopr = 97,
		Cmbt_HMKll = 98,
		Cmbt_HMKllCiv = 99,
		Cmbt_HMKllName = 100,
		Cmbt_HMKllPrpTss = 101,
		Cmbt_HMMssTnt = 102,
		Cmbt_HMShrpShtr = 103,
		Cmbt_HMSpttd = 104,
		Cmbt_HMVnshd = 105,
		Cmbt_Hold = 106,
		Cmbt_HoldLdr = 107,
		Cmbt_HumShldRls1 = 108,
		Cmbt_HumShldRls2 = 109,
		Cmbt_HumShldRls3 = 110,
		Cmbt_HumShldRlsFem1 = 111,
		Cmbt_HumShldRlsFem2 = 112,
		Cmbt_HumShldRlsFem3 = 113,
		Cmbt_HumShldVctm = 114,
		Cmbt_HumShldLdr = 115,
		Cmbt_LngLst = 116,
		Cmbt_LngLstRsp = 117,
		Cmbt_LstMnStn = 118,
		Cmbt_LstSght = 119,
		Cmbt_LstSghtRsp = 120,
		Cmbt_NdrAttck = 121,
		Cmbt_Relod = 122,
		Cmbt_Scrm = 123,
		Cmbt_TkDwnLdr = 124,
		Cmbt_VntAck = 125,
		Cmbt_Whmp = 126,
		Cmbt_StalemateHold = 127,
		Cmbt_StalemateTnt = 128,
		Cmbt_TriggerTheAlarm = 129,
		Cmbt_47Mpty = 130,
		Cmbt_47SuperSize = 131,
		Evac_PrtTrgtSolo = 132,
		Evac_PrtTrgtAck = 133,
		Evac_PrtTrgtAckLdr = 134,
		Evac_PrtTrgtEscrt = 135,
		Evac_PrtTrgtStop = 136,
		Evac_PrtTrgtStnd = 137,
		Evac_PrtTrgtStndRsp = 138,
		Evac_Cornered = 139,
		Evac_MovOut = 140,
		Evac_PathChange = 141,
		Evac_PeelOff = 142,
		Evac_LastPeelOff = 143,
		Evac_ShltrArrv = 144,
		Evac_ShltrBad = 145,
		Evac_ShltrLdr = 146,
		Evac_ShltrRsp = 147,
		Evac_TrgtHitRsp = 148,
		AvoidXplo_Ack = 149,
		AvoidXplo_Stnd = 150,
		Ar_47BadAction = 151,
		Ar_47X = 152,
		Ar_BadDsg = 153,
		Ar_BlmeKll = 154,
		Ar_BlameKnckDwn = 155,
		Ar_BlameKnckDwnPT = 156,
		Ar_BlameKllPT = 157,
		Ar_47BadActionPT = 158,
		Ar_DrgBody = 159,
		Ar_FkeSrrdrTnt = 160,
		Ar_HMDoor = 161,
		Ar_Strangle = 162,
		Ar_Trspss = 163,
		Ar_WeapWrn1 = 164,
		Ar_WeapWrn2 = 165,
		Ar_Wrn1 = 166,
		Ar_Wrn2 = 167,
		Ar_Wrn3 = 168,
		Ar_VictimAck = 169,
		Ar_Thief = 170,
		Sniper_Ack = 171,
		InCa_BackupCll = 172,
		InCa_ChckCvr = 173,
		InCa_CivRptFail = 174,
		InCa_CivUpset = 175,
		InCa_ClstTnt = 176,
		InCa_HMTnt = 177,
		InCa_Idle = 178,
		InCa_NitiateHMKnwn = 179,
		InCa_SrchLdr = 180,
		InCa_Stnd = 181,
		InCa_StndAgtd = 182,
		InCa_StndAgtdLdr = 183,
		InCa_StndAgtdHMKnwn = 184,
		InCa_StndAgtdHMKnwnLdr = 185,
		InCa_StndHMKnwn = 186,
		InCa_StndHMKnwnLdr = 187,
		InCa_StndLdr = 188,
		InCa_StndRsp = 189,
		InCa_StndLckDwnFlsAlrm = 190,
		InCa_VntTnt = 191,
		InCa_Brk2Civ = 192,
		InCa_Brk2Grd = 193,
		InCa_Brk2Rdo = 194,
		InCa_BrkAsk = 195,
		InCa_GhostAsk = 196,
		InCa_TriggerTheAlarm = 197,
		InCa_Xpln47Thief = 198,
		InCa_DstrssInv = 199,
		InCa_DstrssLdr = 200,
		InCa_DstrssInvLdr = 201,
		InCa_WakeAsk = 202,
		InCa_47Rcall = 203,
		InCa_WakerStnd = 204,
		InCa_ClsCmbtAck = 205,
		InCa_SeeDthInv = 206,
		InCa_SeeDthInvLdr = 207,
		InCa_SeeDthLdr = 208,
		InCa_XploInv = 209,
		InCa_XploInvLdr = 210,
		InCa_XploLdr = 211,
		InCa_AlarmAck = 212,
		InCa_GnShtInv = 213,
		InCa_GnShtInvLdr = 214,
		InCa_GnShtLdr = 215,
		InCa_RecurSvrInv = 216,
		InCa_RecurSvrInvLdr = 217,
		InCa_RecurSvrInvRsp = 218,
		InCa_RecurSvrLdr = 219,
		InCa_RecurSvrRsp = 220,
		InCa_LckDwnGtOutLdr = 221,
		InCa_LckDwnGtOutRsp = 222,
		InCa_LckDwnWrn1 = 223,
		InCa_LckDwnWrn2 = 224,
		InCa_LckDwnWrn3 = 225,
		InCa_LckDwnCivCmnt = 226,
		InCa_FrskAck = 227,
		InCa_Frsk = 228,
		InCa_FrskCln = 229,
		InCa_FrskWpn = 230,
		InCa_Xpln47Wpn = 231,
		InCa_XplnAccdnt = 232,
		InCa_XplnDedBdy = 233,
		InCa_XplnDedBdyMassive = 234,
		InCa_XplnDrgBdy = 235,
		InCa_XplnDstrss = 236,
		InCa_XplnExplo = 237,
		InCa_XplnGhost = 238,
		InCa_XplnGnsht = 239,
		InCa_XplnNkdBdy = 240,
		InCa_XplnPcfdBdy = 241,
		InCa_XplnSeeDth = 242,
		InCa_XplnTrspss = 243,
		InCa_XplnX = 244,
		InCa_XplnWpn = 245,
		InCa_XplnDsg = 246,
		InCa_XplnImposter = 247,
		InCa_XplnRecurSvr = 248,
		InCa_XplnRsp = 249,
		InCa_XplnAckRdo = 250,
		InCa_XplnKnckDwn = 251,
		InCa_XplnKnckDwnVctm = 252,
		InCa_XplnKnckDwnGhost = 253,
		InCa_XplnSeeStrngl = 254,
		InCa_XplnHuntTargetWin = 255,
		InCa_XplnHuntTargetFail = 256,
		InCa_VIPDownAck = 257,
		InCa_VIPKillAck = 258,
		Accdnt_Inv = 259,
		InDedBdy_BloodPllAck = 260,
		InDedBdy_Ack = 261,
		InDedBdy_NkdAck = 262,
		InDedBdy_Inv = 263,
		InDedBdy_BllPllRpt = 264,
		InDedBdy_Massive = 265,
		InDedBdy_PcfdInv = 266,
		InDedBdy_CntnAck = 267,
		InDedBdy_Stnd = 268,
		InDedBdy_CircleBdy = 269,
		InDedBdy_CivCmnt = 270,
		InDedBdy_PrmtrBrchWrn1 = 271,
		InDedBdy_PrmtrBrchWrn2 = 272,
		InDedBdy_47AsGrdAck = 273,
		InDedBdy_BodyGone = 274,
		InDedBdy_VctmRcvr = 275,
		InDedBdy_WakerWake = 276,
		InDedBdy_WakeRsp = 277,
		InDedBdy_WakeNkdLdr = 278,
		InDedBdy_WakeNkdRsp = 279,
		Rcvr_Xpln47 = 280,
		Rcvr_XplnDsg = 281,
		Rcvr_XplnKnckDwn = 282,
		InDsg_FllwWrn1 = 283,
		InDsg_FllwWrn2 = 284,
		InDsg_FllwWrn3 = 285,
		InDsg_Pzzl = 286,
		InDsg_Stnd = 287,
		InDsg_StndDistance = 288,
		InDsg_StndHidden = 289,
		InDsg_HdNPlnSght = 290,
		InDsg_FllwWrn1Ack = 291,
		InDsg_FllwWrn1BadAction = 292,
		InDsg_FllwWrn1Wpn = 293,
		InDsg_FllwWrn1BadSound = 294,
		InDsg_FllwWrnJoinr = 295,
		InDsg_FllwWrn1ShadyItem = 296,
		Trspss_Stnd = 297,
		Trspss_Wrn1 = 298,
		Trspss_Wrn2 = 299,
		Trspss_Wrn3 = 300,
		Trspss_Rsp = 301,
		Trspss_SrchAckLegal47 = 302,
		Trspss_EscortAck = 303,
		Trspss_EscortRequest = 304,
		Trspss_EscortRequestRepeat = 305,
		Trspss_EscortStayClose = 306,
		Trspss_EscortOk = 307,
		Trspss_EscortStnd = 308,
		Trspss_EscortArrest = 309,
		Trspss_EscortExit = 310,
		Trspss_EscortStayRequest = 311,
		InCu_Brk2Rdo = 312,
		InCu_CivCmnd = 313,
		InCu_Stnd = 314,
		InCu_CivRsp = 315,
		InCu_BackupRqst = 316,
		InCu_CrAlrmAck = 317,
		InCu_CrAlrmLdr = 318,
		InCu_CrAlrmStndRsp = 319,
		InCu_FtStpsAck = 320,
		InCu_FtStpsStnd = 321,
		InCu_PrpTssHearAck = 322,
		InCu_PrpTssHearInv = 323,
		InCu_PrpTssHearLdr = 324,
		InCu_PrpTssHearStndRsp = 325,
		InCu_PrpTssSeeAck = 326,
		InCu_PrpTssSeeInv = 327,
		InCu_PrpTssSeeLdr = 328,
		InCu_PrpTssSeeStndRsp = 329,
		InCu_RdoAck = 330,
		InCu_RdoInv = 331,
		InCu_RdoLdr = 332,
		InCu_RdoStndRsp = 333,
		InCu_WpnInv = 334,
		InCu_RecurAck = 335,
		InCu_RecurInv = 336,
		InCu_RecurLdr = 337,
		InCu_RecurRsp = 338,
		InCu_ItemAckLdr = 339,
		InCu_CrAlrmStndStndRsp = 340,
		InCu_EscrtTrgtRedLight = 341,
		InCu_EscrtTrgtGreenLight = 342,
		InSt_HMAglty = 343,
		InSt_HMBz = 344,
		InSt_HMBzStnd = 345,
		InSt_HMEntXit = 346,
		InSt_HMInCvr = 347,
		InSt_HMSnkng = 348,
		InSt_PrpTssSee = 349,
		InSt_Stnd = 350,
		InSt_Wrn = 351,
		InSt_HM2Cls = 352,
		InSt_SickAck = 353,
		InSt_AdiosRequest = 354,
		InSt_PQ = 355,
		FseBx_Fixed = 356,
		FseBx_Fixing = 357,
		FseBx_GoFix = 358,
		FseBx_SabAck = 359,
		Sentry_DenyEntry = 360,
		Sentry_Frsk = 361,
		Sentry_FrskRequest = 362,
		Sentry_ItemRequest = 363,
		Sentry_Accepted = 364,
		Sentry_FrskWpnAck = 365,
		Sentry_47LoiterAck = 366,
		Sentry_DenyDsg = 367,
		VIP_MssgnA_Ldr = 368,
		VIP_MssgnB_Rsp = 369,
		VIP_MssgnC_Ldr = 370,
		VIP_MssgnD_Rsp = 371,
		VIP_MssngCallOut = 372,
		Dth_Sick = 373,
		Dth_Poison = 374,
		Gen_Avoid = 375,
		Gen_CloseCall = 376,
		Gen_PhnPckUP = 377,
		Gen_PhoneActLockdown = 378,
		Cmbt_FlushOutLdr = 379,
		Cmbt_HMPrptssKnckOut = 380,
		InCa_FrskHeadsUpLdr = 381,
		InCa_FrskHeadsUpRdo = 382,
		InCa_XplnLOS = 383,
		InCa_XplnGotShot = 384,
		InDedBdy_CivCmntPhone = 385,
		InDedBdy_NoFaulVctmXpln = 386,
		InDsg_FllwWrn1Nkd = 387,
		Ar_BlameKnckDwnMelee = 388,
		Exp_Carry = 389,
		Exp_ClearThroat = 390,
		Exp_Cough = 391,
		Exp_Drink = 392,
		Exp_Exhale = 393,
		Exp_Idle = 394,
		Exp_Inhale = 395,
		Exp_InhaleFast = 396,
		Exp_Sniff = 397,
		Exp_Swallow = 398,
		Exp_Think = 399,
		Exp_Scared = 400,
		Exp_Gld = 401,
		Exp_Dsppntd = 402,
		Exp_InPain = 403,
		InCa_AckBdy = 404,
		InCa_AckBdyLdr = 405,
		InDedBdy_CivCmntPcfd = 406,
		InDedBdy_CivCmntPhonePcfd = 407,
		Gen_SocialAck = 408,
	};


public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorSoundDefs& p_Other) const;
	bool operator!=(const SActorSoundDefs& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[1] {};
};

// Size: 0xC
class /*alignas(4)*/ SActorDynamicTemplateHandlerSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorDynamicTemplateHandlerSaveData& p_Other) const;
	bool operator!=(const SActorDynamicTemplateHandlerSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
	uint32 m_rItem; // 0x4
	uint32 m_rSetpiece; // 0x8
};

// Size: 0x4
class /*alignas(4)*/ SActorDynamicTemplateManipulatorSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorDynamicTemplateManipulatorSaveData& p_Other) const;
	bool operator!=(const SActorDynamicTemplateManipulatorSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
};

// Size: 0x40
class /*alignas(8)*/ SActorDynamicTemplateSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorDynamicTemplateSaveData& p_Other) const;
	bool operator!=(const SActorDynamicTemplateSaveData& p_Other) const { return !(*this == p_Other); }

	ZString m_sName; // 0x0
	EGameTension m_eTensionLimit; // 0x10
	EActorEmotionState m_eEmotionLimit; // 0x14
	ZGameTime m_nTimeLimit; // 0x18
	EGameTension m_eTensionRemoveLimit; // 0x20
	EActorEmotionState m_eEmotionRemoveLimit; // 0x24
	ZGameTime m_nTimeRemoveLimit; // 0x28
	int64 m_resourceID; // 0x30
	uint32 m_rInstance; // 0x38
	uint8_t _pad3C[4] {};
};

// Size: 0x60
class /*alignas(8)*/ SActorGoalSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorGoalSaveData& p_Other) const;
	bool operator!=(const SActorGoalSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<int32> m_aEntities; // 0x0
	TArray<bool> m_aHandled; // 0x18
	TArray<bool> m_aIsCurrent; // 0x30
	TArray<float32> m_fExpiredTime; // 0x48
};

// Size: 0x10
class /*alignas(4)*/ SActorInventoryItemSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorInventoryItemSaveData& p_Other) const;
	bool operator!=(const SActorInventoryItemSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rItem; // 0x0
	EAttachLocation m_eAttachLocation; // 0x4
	EGameTension m_eMaxTension; // 0x8
	bool m_bLeftHand; // 0xC
	bool m_bWeapon; // 0xD
	uint8_t _padE[2] {};
};

// Size: 0x18
class /*alignas(8)*/ SActorInventorySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorInventorySaveData& p_Other) const;
	bool operator!=(const SActorInventorySaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SActorInventoryItemSaveData> m_aItems; // 0x0
};

// Size: 0x8
class /*alignas(4)*/ SActorItemActionSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorItemActionSaveData& p_Other) const;
	bool operator!=(const SActorItemActionSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
	uint32 m_rItem; // 0x4
};

// Size: 0x4
class /*alignas(4)*/ SActorKeywordProxySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorKeywordProxySaveData& p_Other) const;
	bool operator!=(const SActorKeywordProxySaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
};

// Size: 0x30
class /*alignas(8)*/ SActorKeywordProxiesSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorKeywordProxiesSaveData& p_Other) const;
	bool operator!=(const SActorKeywordProxiesSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SActorKeywordProxySaveData> m_aData; // 0x18
};

// Size: 0x18
class /*alignas(8)*/ SActorManagerReferencableData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorManagerReferencableData& p_Other) const;
	bool operator!=(const SActorManagerReferencableData& p_Other) const { return !(*this == p_Other); }

	TArray<ESituationType> m_aSituationTypes; // 0x0
};

// Size: 0x40
class /*alignas(16)*/ SMatrix{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SMatrix& p_Other) const;
	bool operator!=(const SMatrix& p_Other) const { return !(*this == p_Other); }

	float4 XAxis; // 0x0
	float4 YAxis; // 0x10
	float4 ZAxis; // 0x20
	float4 Trans; // 0x30
};

// Size: 0x18
class /*alignas(8)*/ SEventSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SEventSaveData& p_Other) const;
	bool operator!=(const SEventSaveData& p_Other) const { return !(*this == p_Other); }

	EAISharedEventType m_nType; // 0x0
	uint8_t _pad4[4] {};
	ZGameTime m_nStart; // 0x8
	ZGameTime m_nEnd; // 0x10
};

// Size: 0x48
class /*alignas(8)*/ SSituationGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SSituationGroupSaveData& p_Other) const;
	bool operator!=(const SSituationGroupSaveData& p_Other) const { return !(*this == p_Other); }

	ZString m_sClassTypeName; // 0x0
	uint32 m_nSituation; // 0x10
	uint8_t _pad14[4] {};
	TArray<uint32> m_aActors; // 0x18
	int32 m_nGroupID; // 0x30
	uint8_t _pad34[4] {};
	ZVariant m_CustomData; // 0x38
};

// Size: 0x48
class /*alignas(8)*/ SSituationMemberSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SSituationMemberSaveData& p_Other) const;
	bool operator!=(const SSituationMemberSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
	ESituationJoinReason m_eJoinReason; // 0x4
	bool m_bIsOrderValid; // 0x8
	uint8_t _pad9[7] {};
	ZVariant m_OrderData; // 0x10
	ZVariant m_PendingOrderData; // 0x20
	uint32 m_rDramaRole; // 0x30
	uint8_t _pad34[4] {};
	ZVariant m_CustomData; // 0x38
};

// Size: 0x68
class /*alignas(8)*/ SSituationSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SSituationSaveData& p_Other) const;
	bool operator!=(const SSituationSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rSituation; // 0x0
	ESituationType m_eType; // 0x4
	int32 m_nTargetSharedEntity; // 0x8
	uint8_t _padC[4] {};
	ZVariant m_Data; // 0x10
	TArray<SSituationMemberSaveData> m_aMemberData; // 0x20
	TArray<SSituationGroupSaveData> m_aGroupData; // 0x38
	int32 m_nNextGroupID; // 0x50
	uint8_t _pad54[4] {};
	ZGameTime m_situationStartTime; // 0x58
	bool m_bSituationEnded; // 0x60
	uint8_t _pad61[7] {};
};

// Size: 0x4
class /*alignas(4)*/ SActorProviderApproachSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorProviderApproachSaveData& p_Other) const;
	bool operator!=(const SActorProviderApproachSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rCastActor; // 0x0
};

// Size: 0x80
class /*alignas(16)*/ SKnownEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SKnownEntitySaveData& p_Other) const;
	bool operator!=(const SKnownEntitySaveData& p_Other) const { return !(*this == p_Other); }

	int32 m_nSharedIndex; // 0x0
	uint8_t _pad4[4] {};
	TArray<SAIEventSaveData> m_aEvents; // 0x8
	uint32 m_nBooleanEvents; // 0x20
	uint32 m_nBooleanEventsHandled; // 0x24
	uint8_t _pad28[8] {};
	SMatrix m_knownWorldMatrix; // 0x30
	ZGameTime m_tLastWorldMatrixUpdate; // 0x70
	uint16 m_nGoals; // 0x78
	uint8_t _pad7A[6] {};
};

// Size: 0xC88
class /*alignas(8)*/ SKnowledgeSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SKnowledgeSaveData& p_Other) const;
	bool operator!=(const SKnowledgeSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SKnownEntitySaveData> m_aKnownEntities; // 0x0
	TFixedArray<EAIGoal, 31> m_aGoalKeys; // 0x18
	uint8_t _pad94[4] {};
	TFixedArray<SActorGoalSaveData, 31> m_aGoals; // 0x98
	float32 m_fHMAttention; // 0xC38
	float32 m_fHMAttentionLastUpdate; // 0xC3C
	float32 m_fHMDisguiseAttention; // 0xC40
	float32 m_fHMTrespassingAttention; // 0xC44
	float32 m_fHMLastTrespassingAttentionMax; // 0xC48
	uint8_t _padC4C[4] {};
	ZGameTime m_tLastTrespassingAttentionGain; // 0xC50
	ZGameTime m_tLastAttentionEvaluate; // 0xC58
	float32 m_fHMWeaponAttention; // 0xC60
	float32 m_fHMWeaponAttentionChange; // 0xC64
	EGameTension m_eGameTension; // 0xC68
	uint8_t _padC6C[4] {};
	ZGameTime m_tAmbientStartTime; // 0xC70
	ZGameTime m_tExpiredAIModifierSuppressSocialGreeting; // 0xC78
	uint32 m_behaviorModifiers; // 0xC80
	uint8_t _padC84[4] {};
};

// Size: 0x18
class /*alignas(8)*/ SEventHistorySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SEventHistorySaveData& p_Other) const;
	bool operator!=(const SEventHistorySaveData& p_Other) const { return !(*this == p_Other); }

	TArray<ZGameTime> m_aOccurences; // 0x0
};

// Size: 0x40
class /*alignas(8)*/ SActorRagdollPoseSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorRagdollPoseSaveData& p_Other) const;
	bool operator!=(const SActorRagdollPoseSaveData& p_Other) const { return !(*this == p_Other); }

	SVector3 m_vBodyVelocity; // 0x0
	uint8_t _padC[4] {};
	TArray<SActorBoneSaveData> m_aBones; // 0x10
	TArray<uint32> m_aBoneIndices; // 0x28
};

// Size: 0x20
class /*alignas(8)*/ SActorProviderDirectSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorProviderDirectSaveData& p_Other) const;
	bool operator!=(const SActorProviderDirectSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aActors; // 0x0
	bool m_bRunning; // 0x18
	uint8_t _pad19[7] {};
};

// Size: 0x4
class /*alignas(4)*/ SActorProxySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorProxySaveData& p_Other) const;
	bool operator!=(const SActorProxySaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
};

// Size: 0x30
class /*alignas(8)*/ SActorProxiesSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorProxiesSaveData& p_Other) const;
	bool operator!=(const SActorProxiesSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SActorProxySaveData> m_aData; // 0x18
};

// Size: 0x18
class /*alignas(8)*/ SActorSpreadControllerCandidateSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorSpreadControllerCandidateSaveData& p_Other) const;
	bool operator!=(const SActorSpreadControllerCandidateSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_CandidateActor; // 0x0
	uint8_t _pad4[4] {};
	ZGameTime m_CandidateTime; // 0x8
	bool m_bValidCandidate; // 0x10
	uint8_t _pad11[7] {};
};

// Size: 0x78
class /*alignas(8)*/ SActorSpreadControllerSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorSpreadControllerSaveData& p_Other) const;
	bool operator!=(const SActorSpreadControllerSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aSpreadingActors; // 0x0
	TArray<ZGameTime> m_aSpreadingActorsAddedTime; // 0x18
	TArray<uint32> m_aNewCandidates; // 0x30
	TArray<SActorSpreadControllerCandidateSaveData> m_aCandidates; // 0x48
	uint32 m_rCurrentSpreadingActor; // 0x60
	uint32 m_nCurrentActorIndex; // 0x64
	bool m_bPlayerCheckEnabled; // 0x68
	bool m_bPlayerSpreading; // 0x69
	bool m_bPlayerIsValidCandidate; // 0x6A
	bool m_bPlayerIsCandidate; // 0x6B
	uint8_t _pad6C[4] {};
	ZGameTime m_PlayerCandidateTime; // 0x70
};

// Size: 0x8
class /*alignas(4)*/ SActorSpreadTransitionOperatorMaterialActorSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorSpreadTransitionOperatorMaterialActorSaveData& p_Other) const;
	bool operator!=(const SActorSpreadTransitionOperatorMaterialActorSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_Actor; // 0x0
	float32 m_fOpacity; // 0x4
};

// Size: 0x18
class /*alignas(8)*/ SActorSpreadTransitionOperatorMaterialSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorSpreadTransitionOperatorMaterialSaveData& p_Other) const;
	bool operator!=(const SActorSpreadTransitionOperatorMaterialSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SActorSpreadTransitionOperatorMaterialActorSaveData> m_aActorMaterialOverrides; // 0x0
};

// Size: 0x4
class /*alignas(4)*/ SActorStandInSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorStandInSaveData& p_Other) const;
	bool operator!=(const SActorStandInSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
};

// Size: 0x30
class /*alignas(8)*/ SActorStandInEntitiesSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorStandInEntitiesSaveData& p_Other) const;
	bool operator!=(const SActorStandInEntitiesSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SActorStandInSaveData> m_aData; // 0x18
};

// Size: 0x8
class /*alignas(4)*/ SActorTagSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorTagSaveData& p_Other) const;
	bool operator!=(const SActorTagSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bSeen; // 0x0
	bool m_bTagged; // 0x1
	uint8_t _pad2[2] {};
	uint32 m_rActorRef; // 0x4
};

// Size: 0x28
class /*alignas(8)*/ SActorTagManagerSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SActorTagManagerSaveData& p_Other) const;
	bool operator!=(const SActorTagManagerSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bContractsCreationMode; // 0x0
	uint8_t _pad1[3] {};
	int32 m_nTagCount; // 0x4
	int32 m_nMaxTagCount; // 0x8
	bool m_bTaggingEnabled; // 0xC
	uint8_t _padD[3] {};
	TArray<SActorTagSaveData> m_aActorTagData; // 0x10
};

// Size: 0x30
class /*alignas(16)*/ SAgitatedBystanderOrderSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAgitatedBystanderOrderSaveData& p_Other) const;
	bool operator!=(const SAgitatedBystanderOrderSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rBystanderPoint; // 0x0
	uint8_t _pad4[12] {};
	float4 m_vCover; // 0x10
	float4 m_vCoverDir; // 0x20
};

// Size: 0x20
class /*alignas(4)*/ SBoneTransformSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBoneTransformSaveData& p_Other) const;
	bool operator!=(const SBoneTransformSaveData& p_Other) const { return !(*this == p_Other); }

	SVector4 mQuaterion; // 0x0
	SVector4 mTranslation; // 0x10
};

// Size: 0x38
class /*alignas(8)*/ SAnimPlayerSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAnimPlayerSaveData& p_Other) const;
	bool operator!=(const SAnimPlayerSaveData& p_Other) const { return !(*this == p_Other); }

	SVector4 mTrajectoryQuaterion; // 0x0
	SVector4 mTrajectoryTranslation; // 0x10
	TArray<SBoneTransformSaveData> m_aBones; // 0x20
};

// Size: 0x28
class /*alignas(4)*/ SAnimatedActorActOrderSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAnimatedActorActOrderSaveData& p_Other) const;
	bool operator!=(const SAnimatedActorActOrderSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bOverrideExistingAct; // 0x0
	uint8_t _pad1[3] {};
	uint32 m_nForcedAnimationNode; // 0x4
	uint32 m_rChildNetworkAct; // 0x8
	SVector3 m_vOriginPosition; // 0xC
	SVector4 m_vOriginQuaternion; // 0x18
};

// Size: 0x20
class /*alignas(4)*/ SAnimatedActorMoveOrderSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAnimatedActorMoveOrderSaveData& p_Other) const;
	bool operator!=(const SAnimatedActorMoveOrderSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bPrecisePositioning; // 0x0
	bool m_bPreciseOrientation; // 0x1
	bool m_bIgnoreEndCollision; // 0x2
	bool m_bForcedEnpointSet; // 0x3
	float32 m_fStopMoveDistance; // 0x4
	SVector3 m_vWaypoint; // 0x8
	SVector3 m_vFacingDirection; // 0x14
};

// Size: 0x18
class /*alignas(8)*/ SAnimatedActorOrderSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAnimatedActorOrderSaveData& p_Other) const;
	bool operator!=(const SAnimatedActorOrderSaveData& p_Other) const { return !(*this == p_Other); }

	EActorAnimationOrder m_eOrderType; // 0x0
	uint8_t _pad4[4] {};
	ZVariant m_OrderData; // 0x8
};

// Size: 0x38
class /*alignas(8)*/ SAnimatedActorReactOrderSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAnimatedActorReactOrderSaveData& p_Other) const;
	bool operator!=(const SAnimatedActorReactOrderSaveData& p_Other) const { return !(*this == p_Other); }

	SVector3 m_vFaceTarget; // 0x0
	SVector3 m_vLookAtTarget; // 0xC
	uint32 m_rChildNetworkEntity; // 0x18
	EActorEmotionState m_targetEmotionState; // 0x1C
	bool m_bDeadbody; // 0x20
	bool m_bExplosion; // 0x21
	bool m_bTrespassing; // 0x22
	bool m_bDropCarriedItems; // 0x23
	bool m_bFaceTargetSet; // 0x24
	bool m_bLookAtTargetSet; // 0x25
	uint8_t _pad26[2] {};
	ZString m_sAct; // 0x28
};

// Size: 0xC
class /*alignas(4)*/ SAnimatedActorStandOrderSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAnimatedActorStandOrderSaveData& p_Other) const;
	bool operator!=(const SAnimatedActorStandOrderSaveData& p_Other) const { return !(*this == p_Other); }

	SVector3 m_vFacingDirection; // 0x0
};

// Size: 0x14
class /*alignas(4)*/ SAttentionHUDUIElement{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAttentionHUDUIElement& p_Other) const;
	bool operator!=(const SAttentionHUDUIElement& p_Other) const { return !(*this == p_Other); }

	float32 fAngle; // 0x0
	float32 fAttention; // 0x4
	float32 fAlpha; // 0x8
	float32 fRadius; // 0xC
	int32 nColor; // 0x10
};

// Size: 0x18
class /*alignas(8)*/ SAttentionHUDUIElementArray_Dummy{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAttentionHUDUIElementArray_Dummy& p_Other) const;
	bool operator!=(const SAttentionHUDUIElementArray_Dummy& p_Other) const { return !(*this == p_Other); }

	TArray<SAttentionHUDUIElement> dummy; // 0x0
};

// Size: 0x14
class /*alignas(4)*/ SAudioEmitterEventSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAudioEmitterEventSaveData& p_Other) const;
	bool operator!=(const SAudioEmitterEventSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_nEventId; // 0x0
	bool m_bPaused; // 0x4
	uint8_t _pad5[3] {};
	uint32 m_nFlags; // 0x8
	uint32 m_rEventSender; // 0xC
	int32 m_nSeekPosition; // 0x10
};

// Size: 0x8
class /*alignas(4)*/ SAudioEmitterRTPCSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAudioEmitterRTPCSaveData& p_Other) const;
	bool operator!=(const SAudioEmitterRTPCSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_nParamId; // 0x0
	float32 m_fValue; // 0x4
};

// Size: 0x10
class /*alignas(4)*/ SAudioEmitterSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAudioEmitterSaveData& p_Other) const;
	bool operator!=(const SAudioEmitterSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rEmitter; // 0x0
	uint32 m_nNumberOfEvents; // 0x4
	uint32 m_nNumberOfRTPCs; // 0x8
	uint32 m_nNumberOfSwitches; // 0xC
};

// Size: 0x8
class /*alignas(4)*/ SAudioEmitterStateSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAudioEmitterStateSaveData& p_Other) const;
	bool operator!=(const SAudioEmitterStateSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_nGroupId; // 0x0
	uint32 m_nStateId; // 0x4
};

// Size: 0x8
class /*alignas(4)*/ SAudioEmitterSwitchSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAudioEmitterSwitchSaveData& p_Other) const;
	bool operator!=(const SAudioEmitterSwitchSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_nGroupId; // 0x0
	uint32 m_nStateId; // 0x4
};

// Size: 0x10
class /*alignas(8)*/ SAudioEventData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAudioEventData& p_Other) const;
	bool operator!=(const SAudioEventData& p_Other) const { return !(*this == p_Other); }

	uint64 m_EmitterID; // 0x0
	uint32 m_EventID; // 0x8
	uint32 m_PlayingID; // 0xC
};

// Size: 0xA8
class /*alignas(8)*/ SAudioSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAudioSaveData& p_Other) const;
	bool operator!=(const SAudioSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SAudioEmitterSaveData> m_aEmitters; // 0x0
	TArray<SAudioEmitterEventSaveData> m_aEmitterEvents; // 0x18
	TArray<SAudioEmitterRTPCSaveData> m_aEmitterRTPCs; // 0x30
	TArray<SAudioEmitterSwitchSaveData> m_aEmitterSwitches; // 0x48
	TArray<SAudioEmitterStateSaveData> m_aGlobalStates; // 0x60
	TArray<SAudioEmitterRTPCSaveData> m_aGlobalRTPCs; // 0x78
	TArray<uint32> m_aEventsEnabledAfterInit; // 0x90
};

// Size: 0x18
class /*alignas(8)*/ SFSMSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SFSMSaveData& p_Other) const;
	bool operator!=(const SFSMSaveData& p_Other) const { return !(*this == p_Other); }

	EFSMStateStatus m_eStateStatus; // 0x0
	int32 m_state; // 0x4
	int32 m_prevState; // 0x8
	uint8_t _padC[4] {};
	ZGameTime m_tCurrentStateEnterTime; // 0x10
};

// Size: 0x40
class /*alignas(16)*/ SAvoidDangerousAreaGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SAvoidDangerousAreaGroupSaveData& p_Other) const;
	bool operator!=(const SAvoidDangerousAreaGroupSaveData& p_Other) const { return !(*this == p_Other); }

	SFSMSaveData m_fsmState; // 0x0
	uint32 m_rDangerousArea; // 0x18
	uint8_t _pad1C[4] {};
	float4 m_vDestinationPoint; // 0x20
	int32 m_iGridId; // 0x30
	bool m_bWaitUntilDangerEnds; // 0x34
	uint8_t _pad35[11] {};
};

// Size: 0x18
class /*alignas(8)*/ SBehaviorTreeEntityReference{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBehaviorTreeEntityReference& p_Other) const;
	bool operator!=(const SBehaviorTreeEntityReference& p_Other) const { return !(*this == p_Other); }

	bool m_bList; // 0x0
	uint8_t _pad1[7] {};
	ZString m_sName; // 0x8
};

// Size: 0x10
class /*alignas(8)*/ ZResourceID{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZResourceID& p_Other) const;
	bool operator!=(const ZResourceID& p_Other) const { return !(*this == p_Other); }

	ZString m_uri; // 0x0
};

// Size: 0x18
class /*alignas(8)*/ SBehaviorTreeEvaluationLogEntry{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBehaviorTreeEvaluationLogEntry& p_Other) const;
	bool operator!=(const SBehaviorTreeEvaluationLogEntry& p_Other) const { return !(*this == p_Other); }

	uint32 m_nBehaviorTreeIndex; // 0x0
	uint8_t _pad4[4] {};
	uint64 m_nConditionOffset; // 0x8
	bool m_bResult; // 0x10
	uint8_t _pad11[7] {};
};

// Size: 0x30
class /*alignas(8)*/ SBehaviorTreeEvaluationLog{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBehaviorTreeEvaluationLog& p_Other) const;
	bool operator!=(const SBehaviorTreeEvaluationLog& p_Other) const { return !(*this == p_Other); }

	TArray<ZResourceID> m_BehaviorTrees; // 0x0
	TArray<SBehaviorTreeEvaluationLogEntry> m_Entries; // 0x18
};

// Size: 0x10
class /*alignas(8)*/ SBehaviorTreeInputPinCondition{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBehaviorTreeInputPinCondition& p_Other) const;
	bool operator!=(const SBehaviorTreeInputPinCondition& p_Other) const { return !(*this == p_Other); }

	ZString m_sName; // 0x0
};

// Size: 0x30
class /*alignas(8)*/ SBehaviorTreeInfo{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBehaviorTreeInfo& p_Other) const;
	bool operator!=(const SBehaviorTreeInfo& p_Other) const { return !(*this == p_Other); }

	TArray<SBehaviorTreeEntityReference> m_references; // 0x0
	TArray<SBehaviorTreeInputPinCondition> m_inputPinConditions; // 0x18
};

// Size: 0x8
class /*alignas(4)*/ ZBehaviorTreeVariable{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZBehaviorTreeVariable& p_Other) const;
	bool operator!=(const ZBehaviorTreeVariable& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[8] {};
};

class ZWaypointEntity
{
public:
	// Size: 0x4
	enum class EMovementType : int32_t
	{
		MT_WALK = 0,
		MT_WALK_IF_NOT_IN_SEQUENCE = 1,
		MT_SNAP = 2,
		MT_IGNORE_POSITION = 3,
	};

};

class ZMoveToPositionBehaviorEntity
{
public:
	// Size: 0x4
	enum class EApproachAlignment : int32_t
	{
		AA_STRICT = 0,
		AA_LOOSE = 1,
	};

	// Size: 0x4
	enum class EMovementType : int32_t
	{
		MT_WALK = 0,
		MT_SNAP = 1,
		MT_IGNORE_POSITION = 2,
	};

	// Size: 0x4
	enum class ERotationAlignment : int32_t
	{
		RA_NONE = 0,
		RA_LOOSE = 1,
		RA_EXACT = 2,
	};

};

class ZPatrolBehaviorEntity
{
public:
	// Size: 0x4
	enum class EMovementType : int32_t
	{
		MT_WALK = 0,
		MT_SNAP = 1,
		MT_IGNORE_POSITION = 2,
	};

	// Size: 0x4
	enum class ERotationAlignment : int32_t
	{
		RA_NONE = 0,
		RA_LOOSE = 1,
		RA_EXACT = 2,
	};

};

// Size: 0x18
class /*alignas(8)*/ SBlobsConfigResourceEntry{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBlobsConfigResourceEntry& p_Other) const;
	bool operator!=(const SBlobsConfigResourceEntry& p_Other) const { return !(*this == p_Other); }

	ZString Id; // 0x0
	ZRuntimeResourceID BlobRid; // 0x10
};

// Size: 0x60
class /*alignas(16)*/ ZRayQueryInput{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZRayQueryInput& p_Other) const;
	bool operator!=(const ZRayQueryInput& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[96] {};
};

class ZSequenceEntity
{
public:
	// Size: 0x4
	enum class ECommand : int32_t
	{
		COMMAND_START = 0,
		COMMAND_ENABLE_PREVIEW = 1,
		COMMAND_STOP = 2,
		COMMAND_DISABLE_PREVIEW = 3,
		COMMAND_ABORT = 4,
		COMMAND_PAUSE = 5,
		COMMAND_UNPAUSE = 6,
		COMMAND_SETTIME = 7,
		COMMAND_GAME_PAUSE = 8,
		COMMAND_GAME_UNPAUSE = 9,
		COMMAND_PREVIEW_PAUSE = 10,
		COMMAND_PREVIEW_STOP = 11,
		COMMAND_PREVIEW_PLAY = 12,
		COMMAND_PREVIEW_LOOPED = 13,
		COMMAND_CLEAR = 14,
	};

	// Size: 0x4
	enum class ELetterBoxAspect : int32_t
	{
		LETTERBOXASPECT_WIDESCREEN = 0,
		LETTERBOXASPECT_CINEMASCOPE = 1,
	};

};

class ZHM5BodyContainer
{
public:
	// Size: 0x4
	enum class EBCAnimSet : int32_t
	{
		BC_CONTAINER_STANDARD = 0,
		BC_CONTAINER_WOODCHIPPER = 1,
		BC_CAR_STANDARD_TRUNK = 2,
		BC_CONTAINER_CLOSET = 3,
		BC_CONTAINER_LAUNDRYCHUTE = 4,
	};

	// Size: 0x4
	enum class EBCBodyMode : int32_t
	{
		BC_1_VICTIM = 0,
		BC_2_VICTIMS = 1,
		BC_1_VICTIM_FLUSHABLE = 2,
		BC_1_VICTIM_AUTOFLUSHABLE = 3,
	};

	// Size: 0x4
	enum class EBCState : int32_t
	{
		BC_CLOSED = 0,
		BC_OPEN = 1,
		BC_FLUSH = 2,
		BC_OPENING = 3,
		BC_CLOSING = 4,
		BC_FLUSHING = 5,
	};

	// Size: 0x4
	enum class eBCCloseMode : int32_t
	{
		BC_AUTOCLOSE = 0,
		BC_MANUALCLOSE = 1,
	};

};

// Size: 0x10
class /*alignas(4)*/ SBodyContainerSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBodyContainerSaveData& p_Other) const;
	bool operator!=(const SBodyContainerSaveData& p_Other) const { return !(*this == p_Other); }

	ZHM5BodyContainer::EBCState m_eBCState; // 0x0
	float32 m_fLidAutoCloseTime; // 0x4
	float32 m_fLidOpenFraction; // 0x8
	bool m_bFrameUpdateActive; // 0xC
	uint8_t _padD[3] {};
};

// Size: 0x30
class /*alignas(8)*/ SBodyContainersSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBodyContainersSaveData& p_Other) const;
	bool operator!=(const SBodyContainersSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SBodyContainerSaveData> m_aData; // 0x18
};

// Size: 0x34
class /*alignas(4)*/ SBodyPartDamageMultipliers{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBodyPartDamageMultipliers& p_Other) const;
	bool operator!=(const SBodyPartDamageMultipliers& p_Other) const { return !(*this == p_Other); }

	float32 m_fHeadDamageMultiplier; // 0x0
	float32 m_fFaceDamageMultiplier; // 0x4
	float32 m_fArmDamageMultiplier; // 0x8
	float32 m_fLArmDamageScalar; // 0xC
	float32 m_fRArmDamageScalar; // 0x10
	float32 m_fHandDamageMultiplier; // 0x14
	float32 m_fLHandDamageScalar; // 0x18
	float32 m_fRHandDamageScalar; // 0x1C
	float32 m_fLegDamageMultiplier; // 0x20
	float32 m_fLLegDamageScalar; // 0x24
	float32 m_fRLegDamageScalar; // 0x28
	float32 m_fTorsoDamageMultiplier; // 0x2C
	bool m_bApplyLeftRightScalars; // 0x30
	uint8_t _pad31[3] {};
};

// Size: 0x20
class /*alignas(4)*/ SBodybagBoneSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBodybagBoneSaveData& p_Other) const;
	bool operator!=(const SBodybagBoneSaveData& p_Other) const { return !(*this == p_Other); }

	SVector4 mQuaterion; // 0x0
	SVector4 mTranslation; // 0x10
};

// Size: 0x58
class /*alignas(8)*/ SBodybagSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBodybagSaveData& p_Other) const;
	bool operator!=(const SBodybagSaveData& p_Other) const { return !(*this == p_Other); }

	SVector3 m_vLinkedPosition; // 0x0
	SVector4 m_vLinkedQuaternionRotation; // 0xC
	uint8_t _pad1C[4] {};
	TArray<SBodybagBoneSaveData> m_aBones; // 0x20
	TArray<uint32> m_aBoneIndices; // 0x38
	uint32 m_rDeadActor; // 0x50
	uint8_t _pad54[4] {};
};

// Size: 0x8
class /*alignas(4)*/ SBoneAttachSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBoneAttachSaveData& p_Other) const;
	bool operator!=(const SBoneAttachSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rEntity; // 0x0
	bool m_bIsAttached; // 0x4
	uint8_t _pad5[3] {};
};

// Size: 0x18
class /*alignas(8)*/ SBoneScalesList{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SBoneScalesList& p_Other) const;
	bool operator!=(const SBoneScalesList& p_Other) const { return !(*this == p_Other); }

	TArray<SVector3> m_aBoneScales; // 0x0
};

// Size: 0x8
class /*alignas(4)*/ SCamBone{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCamBone& p_Other) const;
	bool operator!=(const SCamBone& p_Other) const { return !(*this == p_Other); }

	BoneId::Enum m_eBoneId; // 0x0
	float32 m_fWeight; // 0x4
};

// Size: 0xD8
class /*alignas(8)*/ ZSituationGroup{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZSituationGroup& p_Other) const;
	bool operator!=(const ZSituationGroup& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[216] {};
};

class ZCautiousBackupGroup
{
public:
	// Size: 0x4
	enum class EGroupState : int32_t
	{
		GS_DistanceField = 0,
		GS_SendBackup = 1,
		GS_Waiting = 2,
		GS_Completed = 3,
	};

};

// Size: 0x50
class /*alignas(8)*/ SCautiousBackupGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCautiousBackupGroupSaveData& p_Other) const;
	bool operator!=(const SCautiousBackupGroupSaveData& p_Other) const { return !(*this == p_Other); }

	ZCautiousBackupGroup::EGroupState m_eGroupState; // 0x0
	uint32 m_pLeader; // 0x4
	uint16 m_nTargetNodeIndex; // 0x8
	uint8_t _padA[6] {};
	TArray<uint32> m_aCandidates; // 0x10
	uint32 m_pCandidate; // 0x28
	uint8_t _pad2C[4] {};
	TArray<uint16> m_aReservedApproachNodeIndices; // 0x30
	ZGameTime m_tStart; // 0x48
};

// Size: 0x38
class /*alignas(8)*/ SCautiousHuntSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCautiousHuntSaveData& p_Other) const;
	bool operator!=(const SCautiousHuntSaveData& p_Other) const { return !(*this == p_Other); }

	SFSMSaveData m_fsmState; // 0x0
	ZGameTime m_tAnnounceHuntCoolDown; // 0x18
	ZGameTime m_tAnnouncedHunt; // 0x20
	ZGameTime m_tShareHuntTargetCoolDown; // 0x28
	bool m_bAnnounceHunt; // 0x30
	bool m_bAnnouncedHunt; // 0x31
	bool m_bPlayAnnouncementDialog; // 0x32
	bool m_bHuntTargetKnownKiller; // 0x33
	bool m_bSharedHuntTarget; // 0x34
	bool m_bTargetBlamed; // 0x35
	bool m_bRuleActive; // 0x36
	uint8_t _pad37[1] {};
};

class ZCautiousInvestigateGroup
{
public:
	// Size: 0x4
	enum class EApproachOrderState : int32_t
	{
		AOS_RequestHuntApproachNode = 0,
		AOS_RequestLeaderApproachNode = 1,
		AOS_WaitForApproachNode = 2,
		AOS_RequestLOSNode = 3,
		AOS_Ready = 4,
		AOS_NoApproachNode = 5,
	};

	// Size: 0x4
	enum class EAssistantState : int32_t
	{
		AS_Waiting = 0,
		AS_CalculateFields = 1,
		AS_RequestNode = 2,
		AS_Moving = 3,
		AS_Investigating = 4,
		AS_Max = 5,
	};

	// Size: 0x4
	enum class EInvestigateGroupState : int32_t
	{
		IGS_FindAssistant = 0,
		IGS_PreAcknowledge = 1,
		IGS_Acknowledge = 2,
		IGS_Approach = 3,
		IGS_Approaching = 4,
		IGS_Investigating = 5,
		IGS_DeadBody = 6,
		IGS_Completed = 7,
		IGS_Max = 8,
	};

};

// Size: 0x40
class /*alignas(8)*/ SExactCompressedGridFloatField{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SExactCompressedGridFloatField& p_Other) const;
	bool operator!=(const SExactCompressedGridFloatField& p_Other) const { return !(*this == p_Other); }

	float32 m_fInitialValue; // 0x0
	uint32 m_nFieldSize; // 0x4
	uint32 m_nGridCRC; // 0x8
	uint8_t _padC[4] {};
	TArray<uint16> m_aIndices; // 0x10
	TArray<float32> m_aValues; // 0x28
};

// Size: 0x100
class /*alignas(16)*/ SCautiousInvestigateGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCautiousInvestigateGroupSaveData& p_Other) const;
	bool operator!=(const SCautiousInvestigateGroupSaveData& p_Other) const { return !(*this == p_Other); }

	ZGameTime m_tGroupStarted; // 0x0
	int32 m_target; // 0x8
	EDisturbanceType m_type; // 0xC
	uint32 m_pLeader; // 0x10
	uint32 m_pAssistant; // 0x14
	int32 m_nLeaderApproachNode; // 0x18
	int32 m_nAssistantApproachNode; // 0x1C
	ZCautiousInvestigateGroup::EApproachOrderState m_eApproachOrderState; // 0x20
	uint8_t _pad24[4] {};
	SFSMSaveData m_fsmState; // 0x28
	SFSMSaveData m_fsmAssistantState; // 0x40
	bool m_bUsingRecurringDialog; // 0x58
	bool m_bStartedInvestigateDialog; // 0x59
	bool m_bDelayInvestigateDialog; // 0x5A
	bool m_bReservedOccupancy; // 0x5B
	bool m_bSilentInvestigation; // 0x5C
	bool m_bInvestigateDeadBody; // 0x5D
	bool m_bMultipleBodies; // 0x5E
	bool m_bCheckSuspects; // 0x5F
	float4 m_investigateArea; // 0x60
	SExactCompressedGridFloatField m_targetDistanceField; // 0x70
	SExactCompressedGridFloatField m_targetLOSField; // 0xB0
	bool m_bValidTargetDistanceField; // 0xF0
	bool m_bValidTargetLOSField; // 0xF1
	bool m_bForceAcknowledge; // 0xF2
	uint8_t _padF3[13] {};
};

// Size: 0x40
class /*alignas(8)*/ SCompressedGridFloatField{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCompressedGridFloatField& p_Other) const;
	bool operator!=(const SCompressedGridFloatField& p_Other) const { return !(*this == p_Other); }

	bool m_bIsSparse; // 0x0
	uint8_t _pad1[3] {};
	uint32 m_nFieldSize; // 0x4
	float32 m_fInitialValue; // 0x8
	uint32 m_nGridCRC; // 0xC
	TArray<uint16> m_aIndices; // 0x10
	TArray<uint8> m_aValues; // 0x28
};

class ZInvestigateCautiousSituation
{
public:
	// Size: 0x4
	enum class EBystanderState : int32_t
	{
		BS_SelectCandidate = 0,
		BS_SelectPoint = 1,
		BS_SearchDangerField = 2,
	};

	// Size: 0x4
	enum class ESituationState : int32_t
	{
		SS_Main = 0,
		SS_StandDownPending = 1,
		SS_StandDown = 2,
	};

	// Size: 0x70
	class /*alignas(8)*/ SStateData	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SStateData& p_Other) const;
		bool operator!=(const SStateData& p_Other) const { return !(*this == p_Other); }

		ZInvestigateCautiousSituation::ESituationState m_state; // 0x0
		ZInvestigateCautiousSituation::EBystanderState m_eBystanderState; // 0x4
		ZGameTime m_tLastInvestigationEnded; // 0x8
		ZGameTime m_tLastApproachOrder; // 0x10
		ZGameTime m_tLastBackupGroupEnded; // 0x18
		ZGameTime m_tLastHunt; // 0x20
		ZGameTime m_tHuntTargetLastUpdate; // 0x28
		ZGameTime m_tNewHuntTargetTimer; // 0x30
		float32 m_fCombatAge; // 0x38
		uint8_t _pad3C[20] {};
		bool m_bLockdownZoneDisturbanceAdded; // 0x50
		bool m_bLockdownSituation; // 0x51
		bool m_bLockdownFalseAlarm; // 0x52
		bool m_bLockdownGracePeriod; // 0x53
		bool m_bHMInGuardDisguise; // 0x54
		bool m_bFrisked; // 0x55
		bool m_bAnnouncedFrisk; // 0x56
		bool m_bReasonToFrisk; // 0x57
		bool m_bSomeoneHasBeenInCombat; // 0x58
		bool m_bInvestigationGroupActive; // 0x59
		bool m_bStandDownGuards; // 0x5A
		uint8_t _pad5B[5] {};
		ZGameTime m_tStandDownDelay; // 0x60
		EDisturbanceType m_eMostSevereDisturbance; // 0x68
		bool m_bDiscoveredDeadBody; // 0x6C
		bool m_bDiscoveredPacifiedBody; // 0x6D
		uint8_t _pad6E[2] {};
	};

};

// Size: 0x20
class /*alignas(8)*/ SDisturbanceSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDisturbanceSaveData& p_Other) const;
	bool operator!=(const SDisturbanceSaveData& p_Other) const { return !(*this == p_Other); }

	int32 m_object; // 0x0
	EDisturbanceType m_type; // 0x4
	ECautiousDisturbanceState m_state; // 0x8
	uint8_t _padC[4] {};
	ZGameTime m_started; // 0x10
	int32 m_pInvestigateGroup; // 0x18
	bool m_bLockOnHitmanPosition; // 0x1C
	uint8_t _pad1D[3] {};
};

// Size: 0x1D8
class /*alignas(8)*/ SCautiousInvestigateSituationSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCautiousInvestigateSituationSaveData& p_Other) const;
	bool operator!=(const SCautiousInvestigateSituationSaveData& p_Other) const { return !(*this == p_Other); }

	ZInvestigateCautiousSituation::SStateData m_StateData; // 0x0
	int32 m_pGetHelpGroup; // 0x70
	int32 m_pBackupGroup; // 0x74
	int32 m_rTriggerAlarmGroup; // 0x78
	int32 m_pInvestigateDisguiseGroup; // 0x7C
	TArray<int32> m_cautiousVIPGroups; // 0x80
	TArray<int32> m_friskGroups; // 0x98
	ZGameTime m_tFriskCooldown; // 0xB0
	ZGameTime m_tFriskGroupEnd; // 0xB8
	ZGameTime m_tRecoverUnconsciousGroupEnd; // 0xC0
	int32 m_nHuntTarget; // 0xC8
	uint32 m_rZone; // 0xCC
	TArray<uint32> m_aGuardMembers; // 0xD0
	TArray<SDisturbanceSaveData> m_disturbances; // 0xE8
	bool m_bValidDisturbanceField; // 0x100
	uint8_t _pad101[7] {};
	SCompressedGridFloatField m_disturbanceField; // 0x108
	int32 m_recoverUnconsciousGroup; // 0x148
	bool m_bSuspendSearchOnInitialGetHelpGroup; // 0x14C
	uint8_t _pad14D[3] {};
	EDisturbanceType m_lastArrestReason; // 0x150
	EDisturbanceType m_lastStaticArrestReason; // 0x154
	EDisturbanceType m_lastStaticCombatReason; // 0x158
	bool m_bAnyGunshotDisturbance; // 0x15C
	bool m_deadBodyMassiveReported; // 0x15D
	uint8_t _pad15E[2] {};
	int32 m_deadBodiesDiscovered; // 0x160
	int32 m_deadCrowdBodiesDiscovered; // 0x164
	TArray<EAISharedEventType> m_aDynamicEnforceEventsForSearchers; // 0x168
	ZGameTime m_tLastIdleStanddown; // 0x180
	TArray<int32> m_aAvoidDangerGroups; // 0x188
	SCautiousHuntSaveData m_cautiousHuntData; // 0x1A0
};

class ZCautiousSearchGroup
{
public:
	// Size: 0x4
	enum class EAssistantState : int32_t
	{
		AS_CalculateFields = 0,
		AS_RequestNode = 1,
		AS_Approach = 2,
		AS_Approaching = 3,
		AS_Act = 4,
		AS_Acting = 5,
	};

	// Size: 0x4
	enum class ESearchGroupState : int32_t
	{
		SGS_Acknowledge = 0,
		SGS_Approach = 1,
		SGS_Approaching = 2,
		SGS_Waiting = 3,
		SGS_Completed = 4,
	};

};

// Size: 0x14
class /*alignas(4)*/ SCautiousSearchGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCautiousSearchGroupSaveData& p_Other) const;
	bool operator!=(const SCautiousSearchGroupSaveData& p_Other) const { return !(*this == p_Other); }

	uint16 m_searchNode; // 0x0
	uint16 m_assistantApproachNode; // 0x2
	ZCautiousSearchGroup::ESearchGroupState m_eGroupState; // 0x4
	ZCautiousSearchGroup::EAssistantState m_eAssistantState; // 0x8
	uint32 m_pLeader; // 0xC
	uint32 m_pAssistant; // 0x10
};

// Size: 0x48
class /*alignas(8)*/ SCautiousSituationMemberSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCautiousSituationMemberSaveData& p_Other) const;
	bool operator!=(const SCautiousSituationMemberSaveData& p_Other) const { return !(*this == p_Other); }

	ZGameTime m_tLastDisturbance; // 0x0
	ZGameTime m_tLastSearchCalc; // 0x8
	ZGameTime m_tLastInfluenceCalc; // 0x10
	ZGameTime m_tLastSearchCompleted; // 0x18
	ZGameTime m_tLastInvestigationCompleted; // 0x20
	ZGameTime m_tTimeIdling; // 0x28
	uint32 m_pGuardDutyPoint; // 0x30
	int32 m_nBulletImpactsHeard; // 0x34
	int32 m_nPatrolWaypointIndex; // 0x38
	uint32 m_nPatrolWaypointSubIndex; // 0x3C
	bool m_bBanterCandidate; // 0x40
	bool m_bCivOccupant; // 0x41
	bool m_bRecievingNewHuntTarget; // 0x42
	bool m_bLockdownEnforcer; // 0x43
	uint8_t _pad44[4] {};
};

// Size: 0x8
class /*alignas(8)*/ SCautiousVIPGroupState{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCautiousVIPGroupState& p_Other) const;
	bool operator!=(const SCautiousVIPGroupState& p_Other) const { return !(*this == p_Other); }

	ZGameTime m_tMove; // 0x0
};

// Size: 0x30
class /*alignas(8)*/ SCautiousVIPGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCautiousVIPGroupSaveData& p_Other) const;
	bool operator!=(const SCautiousVIPGroupSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_vip; // 0x0
	uint8_t _pad4[4] {};
	SFSMSaveData m_fsmState; // 0x8
	SCautiousVIPGroupState m_stateData; // 0x20
	int32 m_vipTargetNode; // 0x28
	int32 m_occupancyNode; // 0x2C
};

// Size: 0x8
class /*alignas(4)*/ SChairSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SChairSaveData& p_Other) const;
	bool operator!=(const SChairSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
	bool m_bAttached; // 0x4
	uint8_t _pad5[3] {};
};

// Size: 0x10
class /*alignas(8)*/ ZDynamicObject{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZDynamicObject& p_Other) const;
	bool operator!=(const ZDynamicObject& p_Other) const { return !(*this == p_Other); }

	ZVariant m_value; // 0x0
};

// Size: 0x20
class /*alignas(8)*/ SChallengeSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SChallengeSaveData& p_Other) const;
	bool operator!=(const SChallengeSaveData& p_Other) const { return !(*this == p_Other); }

	ZString m_sId; // 0x0
	ZDynamicObject m_State; // 0x10
};

// Size: 0x18
class /*alignas(8)*/ SChallengesSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SChallengesSaveData& p_Other) const;
	bool operator!=(const SChallengesSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SChallengeSaveData> m_mChallengeStates; // 0x0
};

// Size: 0x8
class /*alignas(4)*/ SCharacterSpeakEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCharacterSpeakEntitySaveData& p_Other) const;
	bool operator!=(const SCharacterSpeakEntitySaveData& p_Other) const { return !(*this == p_Other); }

	float32 m_fSeekPosition; // 0x0
	bool m_bWereSubtitlesSeen; // 0x4
	uint8_t _pad5[3] {};
};

// Size: 0x10
class /*alignas(4)*/ SCheckLastPositionGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCheckLastPositionGroupSaveData& p_Other) const;
	bool operator!=(const SCheckLastPositionGroupSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_pLeader; // 0x0
	uint32 m_pAssistant; // 0x4
	uint16 m_nLeaderTargetNodeIndex; // 0x8
	bool m_bLeaderOrderAssigned; // 0xA
	bool m_bAssistantOrderAssigned; // 0xB
	bool m_bSearchCompleted; // 0xC
	uint8_t _padD[3] {};
};

// Size: 0x4
class /*alignas(4)*/ SClothBundleSpawnSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SClothBundleSpawnSaveData& p_Other) const;
	bool operator!=(const SClothBundleSpawnSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rClothbundle; // 0x0
};

// Size: 0x4
class /*alignas(2)*/ SClothVertex{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SClothVertex& p_Other) const;
	bool operator!=(const SClothVertex& p_Other) const { return !(*this == p_Other); }

	uint16 m_nColumn; // 0x0
	uint16 m_nRow; // 0x2
};

// Size: 0x8
class /*alignas(4)*/ SClothWireEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SClothWireEntitySaveData& p_Other) const;
	bool operator!=(const SClothWireEntitySaveData& p_Other) const { return !(*this == p_Other); }

	float32 m_fWireLength; // 0x0
	bool m_bAttachToAnchorTransform; // 0x4
	bool m_bSimulationEnabled; // 0x5
	uint8_t _pad6[2] {};
};

// Size: 0x40
class /*alignas(16)*/ SCollidingParticle{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCollidingParticle& p_Other) const;
	bool operator!=(const SCollidingParticle& p_Other) const { return !(*this == p_Other); }

	float4 m_vPosition; // 0x0
	float4 m_vVelocity; // 0x10
	float4 m_vNewVelocity; // 0x20
	uint32 m_nColor; // 0x30
	float32 m_fSize; // 0x34
	uint8_t _pad38[8] {};
};

// Size: 0x2
class /*alignas(1)*/ SCollisionControllerAspectSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCollisionControllerAspectSaveData& p_Other) const;
	bool operator!=(const SCollisionControllerAspectSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bCollideHitman; // 0x0
	bool m_bCollideCamera; // 0x1
};

// Size: 0x30
class /*alignas(8)*/ SCollisionControllerAspectsSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCollisionControllerAspectsSaveData& p_Other) const;
	bool operator!=(const SCollisionControllerAspectsSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SCollisionControllerAspectSaveData> m_aData; // 0x18
};

// Size: 0x10
class /*alignas(4)*/ SColorRGBA{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SColorRGBA& p_Other) const;
	bool operator!=(const SColorRGBA& p_Other) const { return !(*this == p_Other); }

	float32 r; // 0x0
	float32 g; // 0x4
	float32 b; // 0x8
	float32 a; // 0xC
};

// Size: 0x30
class /*alignas(8)*/ SColorRGBSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SColorRGBSaveData& p_Other) const;
	bool operator!=(const SColorRGBSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SColorRGB> m_aData; // 0x18
};

// Size: 0x20
class /*alignas(16)*/ SCombatOrderSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCombatOrderSaveData& p_Other) const;
	bool operator!=(const SCombatOrderSaveData& p_Other) const { return !(*this == p_Other); }

	float4 m_vPos; // 0x0
	uint32 m_coverPlane; // 0x10
	uint32 m_rInteraction; // 0x14
	uint8_t _pad18[8] {};
};

// Size: 0x20
class /*alignas(8)*/ SCombatSituationMemberSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCombatSituationMemberSaveData& p_Other) const;
	bool operator!=(const SCombatSituationMemberSaveData& p_Other) const { return !(*this == p_Other); }

	ZGameTime m_tAggressiveModeTimer; // 0x0
	float32 m_fDistanceTargetMoved; // 0x8
	float32 m_fDistanceToTarget; // 0xC
	float32 m_fDistanceFieldValue; // 0x10
	EDisturbanceType m_civilianJoinReason; // 0x14
	bool m_bIsPreferredToFire; // 0x18
	bool m_bIsReinforcing; // 0x19
	bool m_bDialogPreventShooting; // 0x1A
	bool m_bCanFlee; // 0x1B
	bool m_bCantFleeNoPath; // 0x1C
	bool m_bReportedToGuard; // 0x1D
	bool m_bStandAndShoot; // 0x1E
	bool m_bAggressiveMode; // 0x1F
};

// Size: 0x20
class /*alignas(8)*/ SCombatZoneEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCombatZoneEntitySaveData& p_Other) const;
	bool operator!=(const SCombatZoneEntitySaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bIsInLockdown; // 0x0
	bool m_bIsFalseAlarm; // 0x1
	uint8_t _pad2[2] {};
	ECombatZoneState m_nState; // 0x4
	ZGameTime m_tLockdownTime; // 0x8
	ZGameTime m_tTriggerTime; // 0x10
	ZGameTime m_tEngageTime; // 0x18
};

// Size: 0x10
class /*alignas(4)*/ SConditionBase{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SConditionBase& p_Other) const;
	bool operator!=(const SConditionBase& p_Other) const { return !(*this == p_Other); }

	ECompiledConditionType eConditionType; // 0x0
	uint32 nConditionModifiers; // 0x4
	ZBehaviorTreeVariable assignTo; // 0x8
};

// Size: 0xC
class /*alignas(4)*/ SConditionalTimerEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SConditionalTimerEntitySaveData& p_Other) const;
	bool operator!=(const SConditionalTimerEntitySaveData& p_Other) const { return !(*this == p_Other); }

	int32 m_nInterval; // 0x0
	int32 m_nRemaining; // 0x4
	bool m_bValue; // 0x8
	uint8_t _pad9[3] {};
};

// Size: 0x3
class /*alignas(1)*/ SContextActionSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SContextActionSaveData& p_Other) const;
	bool operator!=(const SContextActionSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bEnabled; // 0x0
	bool m_bTriggered; // 0x1
	bool m_bShouldShow; // 0x2
};

// Size: 0x18
class /*alignas(8)*/ SContractConfigResourceEntry{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SContractConfigResourceEntry& p_Other) const;
	bool operator!=(const SContractConfigResourceEntry& p_Other) const { return !(*this == p_Other); }

	ZString Id; // 0x0
	ZRuntimeResourceID ContractRid; // 0x10
};

// Size: 0x1
class /*alignas(1)*/ SContractObjectiveHudHintEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SContractObjectiveHudHintEntitySaveData& p_Other) const;
	bool operator!=(const SContractObjectiveHudHintEntitySaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bVisible; // 0x0
};

// Size: 0x140
class /*alignas(8)*/ SContractObjectiveSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SContractObjectiveSaveData& p_Other) const;
	bool operator!=(const SContractObjectiveSaveData& p_Other) const { return !(*this == p_Other); }

	ZGuid m_Id; // 0x0
	ZString m_sText; // 0x10
	IContractObjective::Category m_eCategory; // 0x20
	bool m_bCompleted; // 0x24
	bool m_bFailed; // 0x25
	bool m_bIsHidden; // 0x26
	uint8_t _pad27[1] {};
	ZString m_sSuccessEventName; // 0x28
	ZDynamicObject m_SuccessEventValues; // 0x38
	ZString m_sFailedEventName; // 0x48
	ZDynamicObject m_FailedEventValues; // 0x58
	ZString m_sResetEventName; // 0x68
	ZDynamicObject m_ResetEventValues; // 0x78
	ZDynamicObject m_sBriefingText; // 0x88
	ZDynamicObject m_sLongBriefingText; // 0x98
	ZDynamicObject m_sHUDText; // 0xA8
	int32 m_iRepeatSuccess; // 0xB8
	int32 m_iRepeatFailed; // 0xBC
	int32 m_iCurrentSuccess; // 0xC0
	int32 m_iCurrentFailed; // 0xC4
	ZDynamicObject m_ActivationCondition; // 0xC8
	bool m_ActivationValue; // 0xD8
	bool m_bUpdateActivationOnCompleted; // 0xD9
	bool m_bDisplayAsKill; // 0xDA
	bool m_bIgnoreIfInactive; // 0xDB
	bool m_bShowInHud; // 0xDC
	bool m_bCombinedDisplayInHud; // 0xDD
	uint8_t _padDE[2] {};
	ZDynamicObject m_OnInactive; // 0xE0
	ZDynamicObject m_OnActive; // 0xF0
	ZDynamicObject m_aExits; // 0x100
	ZString m_sImage; // 0x110
	ZString m_sObjectiveType; // 0x120
	ZString m_sBriefingName; // 0x130
};

// Size: 0x18
class /*alignas(8)*/ SEntityTemplateProperty{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SEntityTemplateProperty& p_Other) const;
	bool operator!=(const SEntityTemplateProperty& p_Other) const { return !(*this == p_Other); }

	uint32 nPropertyID; // 0x0
	uint8_t _pad4[4] {};
	ZVariant value; // 0x8
};

// Size: 0x20
class /*alignas(8)*/ SCppEntity{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCppEntity& p_Other) const;
	bool operator!=(const SCppEntity& p_Other) const { return !(*this == p_Other); }

	int32 blueprintIndexInResourceHeader; // 0x0
	uint8_t _pad4[4] {};
	TArray<SEntityTemplateProperty> propertyValues; // 0x8
};

// Size: 0x18
class /*alignas(8)*/ SCppEntitySubsetInfo{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCppEntitySubsetInfo& p_Other) const;
	bool operator!=(const SCppEntitySubsetInfo& p_Other) const { return !(*this == p_Other); }

	ZString name; // 0x0
	uint32 flags; // 0x10
	uint8_t _pad14[4] {};
};

// Size: 0x20
class /*alignas(8)*/ SCppEntityBlueprint{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCppEntityBlueprint& p_Other) const;
	bool operator!=(const SCppEntityBlueprint& p_Other) const { return !(*this == p_Other); }

	TypeID typeName; // 0x0
	TArray<SCppEntitySubsetInfo> subsets; // 0x8
};

// Size: 0x30
class /*alignas(16)*/ SCrimeSceneSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrimeSceneSaveData& p_Other) const;
	bool operator!=(const SCrimeSceneSaveData& p_Other) const { return !(*this == p_Other); }

	float4 m_vPos; // 0x0
	ZGameTime m_tStart; // 0x10
	float32 m_fDuration; // 0x18
	int32 m_rSharedKnowledge; // 0x1C
	float32 m_fMaxSize; // 0x20
	bool m_bSuspicionZone; // 0x24
	uint8_t _pad25[11] {};
};

// Size: 0x18
class /*alignas(8)*/ SCrimeSceneServiceSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrimeSceneServiceSaveData& p_Other) const;
	bool operator!=(const SCrimeSceneServiceSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SCrimeSceneSaveData> m_aCrimeScenes; // 0x0
};

class ZCrowdActorEntity
{
public:
	// Size: 0x4
	enum class EActorResourceChangeFlags : int32_t
	{
		AR_MODEL = 1,
	};

	// Size: 0x4
	enum class ECharacterSoundType : int32_t
	{
		eSoundType_Male = 0,
		eSoundType_Female = 1,
		eSoundType_Female_Heels = 2,
	};

};

// Size: 0x10
class /*alignas(4)*/ SCrowdActivitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdActivitySaveData& p_Other) const;
	bool operator!=(const SCrowdActivitySaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bEnabled; // 0x0
	uint8_t _pad1[3] {};
	EGait m_eGait; // 0x4
	float32 m_nMaxEnterDelaySec; // 0x8
	float32 m_nMaxLeaveDelaySec; // 0xC
};

// Size: 0x50
class /*alignas(16)*/ SCrowdActorSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdActorSaveData& p_Other) const;
	bool operator!=(const SCrowdActorSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bEnabled; // 0x0
	uint8_t _pad1[3] {};
	ESpeed m_eWantedSpeed; // 0x4
	EGait m_eWantedGait; // 0x8
	uint32 m_nAnimSourceID; // 0xC
	uint32 m_nAnimSourceIndex; // 0x10
	uint8_t _pad14[12] {};
	float4 m_vPosition; // 0x20
	float4 m_vForward; // 0x30
	float32 m_fSpeed; // 0x40
	CrowdUtil::ECrowdActorMood m_eMood; // 0x44
	uint8_t _pad48[8] {};
};

// Size: 0x38
class /*alignas(8)*/ SCrowdBodySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdBodySaveData& p_Other) const;
	bool operator!=(const SCrowdBodySaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_pCorpseBodybagEntity; // 0x0
	uint32 m_rCrowdEntity; // 0x4
	uint16 m_iActorIndex; // 0x8
	uint8_t _padA[2] {};
	uint32 m_rPerceptibleEntity; // 0xC
	TArray<uint32> m_aKnownBy; // 0x10
	ZGameTime m_tStart; // 0x28
	bool m_bManaged; // 0x30
	uint8_t _pad31[3] {};
	int32 m_rBagSharedKnowledge; // 0x34
};

// Size: 0x80
class /*alignas(128)*/ SCrowdCells{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdCells& p_Other) const;
	bool operator!=(const SCrowdCells& p_Other) const { return !(*this == p_Other); }

	TFixedArray<uint8, 128> m_cells; // 0x0
};

// Size: 0x20
class /*alignas(4)*/ SCrowdPoseBoneSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdPoseBoneSaveData& p_Other) const;
	bool operator!=(const SCrowdPoseBoneSaveData& p_Other) const { return !(*this == p_Other); }

	SVector4 mQuaterion; // 0x0
	SVector4 mTranslation; // 0x10
};

// Size: 0x18
class /*alignas(8)*/ SCrowdPoseSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdPoseSaveData& p_Other) const;
	bool operator!=(const SCrowdPoseSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SCrowdPoseBoneSaveData> m_aBones; // 0x0
};

// Size: 0x20
class /*alignas(8)*/ SCrowdPoseCollectionSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdPoseCollectionSaveData& p_Other) const;
	bool operator!=(const SCrowdPoseCollectionSaveData& p_Other) const { return !(*this == p_Other); }

	uint64 m_id; // 0x0
	TArray<SCrowdPoseSaveData> m_aPoses; // 0x8
};

// Size: 0x18
class /*alignas(8)*/ SCrowdDeadPoseRepositorySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdDeadPoseRepositorySaveData& p_Other) const;
	bool operator!=(const SCrowdDeadPoseRepositorySaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SCrowdPoseCollectionSaveData> m_aPoseCollections; // 0x0
};

// Size: 0x40
class /*alignas(16)*/ SRegionSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SRegionSaveData& p_Other) const;
	bool operator!=(const SRegionSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_nIndex; // 0x0
	CrowdRegionType m_eType; // 0x4
	uint8_t _pad8[8] {};
	float4 m_vCenter; // 0x10
	float32 m_nDirection; // 0x20
	float32 m_nRadius; // 0x24
	uint32 m_nAngle; // 0x28
	float32 m_nLifetime; // 0x2C
	float32 m_nAge; // 0x30
	uint8 m_nGroupID; // 0x34
	uint8_t _pad35[1] {};
	int16 m_nObstacleActorIndex; // 0x36
	uint8_t _pad38[8] {};
};

// Size: 0x80
class /*alignas(8)*/ SCrowdEntitySaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdEntitySaveData& p_Other) const;
	bool operator!=(const SCrowdEntitySaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SCrowdActorSaveData> m_CrowdActorData; // 0x0
	TArray<SRegionSaveData> m_RegionData; // 0x18
	bool m_bIsCrowdAmbient; // 0x30
	uint8_t _pad31[7] {};
	SCrowdDeadPoseRepositorySaveData m_DeadPoseRepository; // 0x38
	TArray<uint32> m_aCrowdAiPoolActorsMale; // 0x50
	TArray<uint32> m_aCrowdAiPoolActorsFemale; // 0x68
};

// Size: 0x30
class /*alignas(8)*/ SCrowdFlowChannel{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdFlowChannel& p_Other) const;
	bool operator!=(const SCrowdFlowChannel& p_Other) const { return !(*this == p_Other); }

	TArray<uint8> m_aFlowVectorIndex; // 0x0
	TArray<uint16> m_aFlowCost; // 0x18
};

// Size: 0x4
class /*alignas(2)*/ ZCrowdGridPoint{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZCrowdGridPoint& p_Other) const;
	bool operator!=(const ZCrowdGridPoint& p_Other) const { return !(*this == p_Other); }

	int16 m_nHeightOffset; // 0x0
	uint8 m_nOnNavGrid; // 0x2
	uint8_t _pad3[1] {};
};

// Size: 0xF0
class /*alignas(16)*/ SCrowdMapData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdMapData& p_Other) const;
	bool operator!=(const SCrowdMapData& p_Other) const { return !(*this == p_Other); }

	uint32 m_nVersion; // 0x0
	SVector4 m_vCellConsts; // 0x4
	uint32 m_nGridSizeX; // 0x14
	uint32 m_nGridSizeY; // 0x18
	uint32 m_nCellSizeX; // 0x1C
	uint32 m_nCellSizeY; // 0x20
	uint8_t _pad24[4] {};
	TArray<ZCrowdGridPoint> m_GridMap; // 0x28
	float32 m_fGridMapHeightOffsetsScale; // 0x40
	float32 m_fGridMapHeightOffsetsBias; // 0x44
	TArray<SCrowdCells> m_CellFlags; // 0x48
	TArray<SCrowdCells> m_CellGroups; // 0x60
	int32 m_nGroupFlowStartChannel; // 0x78
	uint8_t _pad7C[4] {};
	TArray<SCrowdFlowChannel> m_aFlowChannels; // 0x80
	float32 m_nGridCellSize; // 0x98
	uint8_t _pad9C[4] {};
	SMatrix m_mObjectToWorld; // 0xA0
	SVector3 m_vGlobalSize; // 0xE0
	float32 m_nGridGeneratorOffset; // 0xEC
};

// Size: 0x14
class /*alignas(4)*/ SCrowdReactionSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdReactionSaveData& p_Other) const;
	bool operator!=(const SCrowdReactionSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_nNumPacify; // 0x0
	uint32 m_nNumShotsFired; // 0x4
	uint32 m_nNumDeaths; // 0x8
	uint32 m_nNumScared; // 0xC
	bool m_bWarzoneSpawned; // 0x10
	uint8_t _pad11[3] {};
};

// Size: 0x18
class /*alignas(8)*/ SCrowdServiceSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCrowdServiceSaveData& p_Other) const;
	bool operator!=(const SCrowdServiceSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SCrowdBodySaveData> m_aDeadBodies; // 0x0
};

// Size: 0x10
class /*alignas(8)*/ SCuriousEventSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCuriousEventSaveData& p_Other) const;
	bool operator!=(const SCuriousEventSaveData& p_Other) const { return !(*this == p_Other); }

	ZGameTime m_tExpiresAt; // 0x0
	int32 m_nKnowledgeIndex; // 0x8
	uint8_t _padC[4] {};
};

// Size: 0x18
class /*alignas(8)*/ SCuriousEventServiceSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCuriousEventServiceSaveData& p_Other) const;
	bool operator!=(const SCuriousEventServiceSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SCuriousEventSaveData> m_aCuriousEvents; // 0x0
};

// Size: 0x38
class /*alignas(8)*/ SCuriousInvestigateGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCuriousInvestigateGroupSaveData& p_Other) const;
	bool operator!=(const SCuriousInvestigateGroupSaveData& p_Other) const { return !(*this == p_Other); }

	int32 m_nInvestigationId; // 0x0
	EInvestigationType m_type; // 0x4
	uint32 m_target; // 0x8
	uint32 m_pLeader; // 0xC
	uint32 m_pTempLeader; // 0x10
	uint32 m_pSecondary; // 0x14
	EInvestigationState m_state; // 0x18
	uint8_t _pad1C[4] {};
	ZGameTime m_tStartTime; // 0x20
	ZGameTime m_tResolveStartTime; // 0x28
	bool m_bWarned; // 0x30
	uint8_t _pad31[3] {};
	EStandDownType m_eStandDownType; // 0x34
};

// Size: 0x40
class /*alignas(8)*/ SCuriousInvestigateSituationSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCuriousInvestigateSituationSaveData& p_Other) const;
	bool operator!=(const SCuriousInvestigateSituationSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<int32> m_aInvestigationGroupIDs; // 0x0
	TArray<int32> m_aVIPInvestigationGroupIDs; // 0x18
	int32 m_nInvestigationCount; // 0x30
	uint8_t _pad34[4] {};
	ZGameTime m_tLastStandDownOrder; // 0x38
};

// Size: 0x10
class /*alignas(8)*/ SCuriousSituationMemberSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCuriousSituationMemberSaveData& p_Other) const;
	bool operator!=(const SCuriousSituationMemberSaveData& p_Other) const { return !(*this == p_Other); }

	ZGameTime m_tLastDisturbance; // 0x0
	uint32 m_escalateTarget; // 0x8
	bool m_bWarned; // 0xC
	uint8_t _padD[3] {};
};

// Size: 0x14
class /*alignas(4)*/ SCutSequenceData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCutSequenceData& p_Other) const;
	bool operator!=(const SCutSequenceData& p_Other) const { return !(*this == p_Other); }

	TResourcePtr m_animResource; // 0x0
	float32 m_fAnimationTime; // 0x8
	float32 m_fCachedFrameWeight; // 0xC
	bool m_bEnableAnimationScaling; // 0x10
	uint8_t _pad11[3] {};
};

// Size: 0x1
class /*alignas(1)*/ SDangerousAreaSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDangerousAreaSaveData& p_Other) const;
	bool operator!=(const SDangerousAreaSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bDangerous; // 0x0
};

// Size: 0x40
class /*alignas(8)*/ SDeadBodyInfoSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDeadBodyInfoSaveData& p_Other) const;
	bool operator!=(const SDeadBodyInfoSaveData& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
	uint32 m_rGuard; // 0x4
	TArray<uint32> m_knownByActors; // 0x8
	ZGameTime m_tKnownSince; // 0x20
	ZGameTime m_tInvestigatedSince; // 0x28
	bool m_bPoolKnownOnly; // 0x30
	bool m_bPoolInvestigated; // 0x31
	bool m_bGuarded; // 0x32
	bool m_bBodyInvestigated; // 0x33
	bool m_bHidden; // 0x34
	bool m_bDeadByAccident; // 0x35
	bool m_bDeadByUnnoticed; // 0x36
	bool m_bHitmanSuspectedInCurrentOutfit; // 0x37
	bool m_bDeadByExplosion; // 0x38
	uint8_t _pad39[7] {};
};

// Size: 0x20
class /*alignas(8)*/ SDeadBodySensorSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDeadBodySensorSaveData& p_Other) const;
	bool operator!=(const SDeadBodySensorSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<SDeadBodyInfoSaveData> m_aBodies; // 0x0
	int32 m_nBodyIndex; // 0x18
	uint8_t _pad1C[4] {};
};

// Size: 0x8
class /*alignas(4)*/ SVector2{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SVector2& p_Other) const;
	bool operator!=(const SVector2& p_Other) const { return !(*this == p_Other); }

	float32 x; // 0x0
	float32 y; // 0x4
};

// Size: 0x80
class /*alignas(16)*/ SDecalSpawnSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDecalSpawnSaveData& p_Other) const;
	bool operator!=(const SDecalSpawnSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bWasSpawned; // 0x0
	uint8_t _pad1[15] {};
	float4 m_vPosition; // 0x10
	float4 m_vNormal; // 0x20
	float4 m_vDirection; // 0x30
	float4 m_vSize; // 0x40
	SColorRGB m_Color; // 0x50
	float32 m_fAlpha; // 0x5C
	float32 m_fAngle; // 0x60
	SVector2 m_vUVOffset; // 0x64
	SVector2 m_vTiling; // 0x6C
	uint32 m_rBlockingSpatialEntity; // 0x74
	uint8_t _pad78[8] {};
};

// Size: 0x28
class /*alignas(8)*/ SDetectedInPrivateGroupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDetectedInPrivateGroupSaveData& p_Other) const;
	bool operator!=(const SDetectedInPrivateGroupSaveData& p_Other) const { return !(*this == p_Other); }

	SFSMSaveData m_fsmState; // 0x0
	float32 m_fTimeWaiting; // 0x18
	uint32 m_rLead; // 0x1C
	bool m_bDisbanded; // 0x20
	bool m_bFirstWait; // 0x21
	uint8_t _pad22[2] {};
	int32 m_target; // 0x24
};

// Size: 0x1
class /*alignas(1)*/ SDisguiseZoneSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDisguiseZoneSaveData& p_Other) const;
	bool operator!=(const SDisguiseZoneSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bEnabled; // 0x0
};

// Size: 0x18
class /*alignas(8)*/ SDoorSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDoorSaveData& p_Other) const;
	bool operator!=(const SDoorSaveData& p_Other) const { return !(*this == p_Other); }

	int32 m_nDoorState; // 0x0
	float32 m_fAnimPercent; // 0x4
	float32 m_fTargetAnimPercent; // 0x8
	uint8_t _padC[4] {};
	ZGameTime m_tOpenTime; // 0x10
};

// Size: 0x1
class /*alignas(1)*/ SDoorSoundDefs{
public:
	// Size: 0x4
	enum class EDefinition : int32_t
	{
		DoorOpen = 0,
		DoorClose = 1,
		DoorSlam = 2,
		DoorOpenStop = 3,
	};


public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDoorSoundDefs& p_Other) const;
	bool operator!=(const SDoorSoundDefs& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[1] {};
};

// Size: 0x30
class /*alignas(8)*/ SDoorsSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDoorsSaveData& p_Other) const;
	bool operator!=(const SDoorsSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SDoorSaveData> m_aData; // 0x18
};

// Size: 0x38
class /*alignas(8)*/ SDramaActorSaveState{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDramaActorSaveState& p_Other) const;
	bool operator!=(const SDramaActorSaveState& p_Other) const { return !(*this == p_Other); }

	uint32 m_rActor; // 0x0
	uint32 m_rSequence; // 0x4
	uint32 m_rBehavior; // 0x8
	uint32 m_rCurrentSpeakEntity; // 0xC
	uint32 m_rScreenplay; // 0x10
	uint8_t _pad14[4] {};
	ZString m_sMatchName; // 0x18
	ZGameTime m_tActorSpeakEnd; // 0x28
	bool m_bIsDone; // 0x30
	bool m_bIsPaused; // 0x31
	bool m_bIsSpeaking; // 0x32
	uint8_t _pad33[5] {};
};

// Size: 0x30
class /*alignas(8)*/ SDramaActorCollectionSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDramaActorCollectionSaveData& p_Other) const;
	bool operator!=(const SDramaActorCollectionSaveData& p_Other) const { return !(*this == p_Other); }

	TArray<uint32> m_aEntities; // 0x0
	TArray<SDramaActorSaveState> m_aStates; // 0x18
};

class ZActorInstanceEntity
{
public:
	// Size: 0x4
	enum class EFFXMode : int32_t
	{
		eFFX_MODE_DISABLE = 0,
		eFFX_MODE_OVERWRITE = 1,
	};

};

class ZAudioEventBase
{
public:
	// Size: 0x1
	enum class CullingBehavior : int8_t
	{
		AutoSendStop = 0,
		AutoSendStopAfterTriggered = 1,
		NoAutoSendStop = 2,
		NoDistanceCulling = 3,
	};

};

// Size: 0x40
class /*alignas(0)*/ ZUIDataProvider{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZUIDataProvider& p_Other) const;
	bool operator!=(const ZUIDataProvider& p_Other) const { return !(*this == p_Other); }

	uint8_t _pad0[64] {};
};

class ZScreenplay
{
public:
	// Size: 0x4
	enum class EState : int32_t
	{
		State_Idle = 0,
		State_Running = 1,
		State_Paused = 2,
		State_Failed = 3,
		State_Done = 4,
	};

};

// Size: 0xC
class /*alignas(4)*/ SDramaSetupSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDramaSetupSaveData& p_Other) const;
	bool operator!=(const SDramaSetupSaveData& p_Other) const { return !(*this == p_Other); }

	bool m_bDoneTriggered; // 0x0
	uint8_t _pad1[3] {};
	ZScreenplay::EState m_eState; // 0x4
	uint32 m_rSituation; // 0x8
};

// Size: 0x30
class /*alignas(8)*/ SDramaSetupCollectionSaveData{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
