/*
 * WARNING: This file is automatically generated. DO NOT MODIFY unless you know what you're doing.
 *
 * If you wish to regenerate this file because of a game update use the ZHMTools CodeGen tool:
 * https://github.com/OrfeasZ/ZHMTools/releases
 */

#pragma once

#include <cstddef>
#include <ZHM/ZHMPrimitives.h>
#include <ZHM/ZHMTypeInfo.h>

class ZHMTypeInfo;

namespace AnimationEventDataTypes {
	// Size: 0x4
	class alignas(4) SBlend
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SBlend& p_Other) const;
		bool operator!=(const SBlend& p_Other) const { return !(*this == p_Other); }

		float32 m_fBlendTime; // 0x0
	};
	ZHM_OFFSET_CHECK(SBlend, m_fBlendTime, 0x0);
	static_assert(sizeof(SBlend) == 0x4, "Wrong size for SBlend");
	static_assert(alignof(SBlend) == 0x4, "Wrong alignment for SBlend");

	// Size: 0x4
	class alignas(4) SLegacy
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SLegacy& p_Other) const;
		bool operator!=(const SLegacy& p_Other) const { return !(*this == p_Other); }

		int32 m_nEventID; // 0x0
	};
	ZHM_OFFSET_CHECK(SLegacy, m_nEventID, 0x0);
	static_assert(sizeof(SLegacy) == 0x4, "Wrong size for SLegacy");
	static_assert(alignof(SLegacy) == 0x4, "Wrong alignment for SLegacy");

}

// Size: 0x8
class alignas(4) ZRuntimeResourceID
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZRuntimeResourceID& p_Other) const;
	bool operator!=(const ZRuntimeResourceID& p_Other) const { return !(*this == p_Other); }

	uint32 m_IDHigh; // 0x0
	uint32 m_IDLow; // 0x4
};
ZHM_OFFSET_CHECK(ZRuntimeResourceID, m_IDHigh, 0x0);
ZHM_OFFSET_CHECK(ZRuntimeResourceID, m_IDLow, 0x4);
static_assert(sizeof(ZRuntimeResourceID) == 0x8, "Wrong size for ZRuntimeResourceID");
static_assert(alignof(ZRuntimeResourceID) == 0x4, "Wrong alignment for ZRuntimeResourceID");

namespace AnimationTakeDataTypes {
	// Size: 0xC
	class alignas(4) SGeneric
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SGeneric& p_Other) const;
		bool operator!=(const SGeneric& p_Other) const { return !(*this == p_Other); }

		float32 m_fTest; // 0x0
		ZRuntimeResourceID m_fResourceTest; // 0x4
	};
	ZHM_OFFSET_CHECK(SGeneric, m_fTest, 0x0);
	ZHM_OFFSET_CHECK(SGeneric, m_fResourceTest, 0x4);
	static_assert(sizeof(SGeneric) == 0xC, "Wrong size for SGeneric");
	static_assert(alignof(SGeneric) == 0x4, "Wrong alignment for SGeneric");

}

// Size: 0x1
enum class AudioCurve : int8_t
{
	AudioCurve_Log3 = 0,
	AudioCurve_Sine = 1,
	AudioCurve_Log1 = 2,
	AudioCurve_InvSCurve = 3,
	AudioCurve_Linear = 4,
	AudioCurve_SCurve = 5,
	AudioCurve_Exp1 = 6,
	AudioCurve_SineRecip = 7,
	AudioCurve_Exp3 = 8,
	AudioCurve_LastFadeCurve = 9,
	AudioCurve_Constant = 10,
};

// Size: 0x1
enum class AudioEventCullingBehavior : int8_t
{
	AutoSendStop = 0,
	AutoSendStopAfterTriggered = 1,
	NoAutoSendStop = 2,
	NoDistanceCulling = 3,
};

class BodyPart
{
public:
	// Size: 0x4
	enum class Enum : int32_t
	{
		NONE = 0,
		TORSO = 1,
		HEAD = 2,
		FACE = 3,
		LEFT_HAND = 4,
		LEFT_LOWERARM = 5,
		LEFT_ARM = 6,
		LEFT_SHOULDER = 7,
		LEFT_FOOT = 8,
		LEFT_LEG = 9,
		LEFT_UPPERLEG = 10,
		RIGHT_HAND = 11,
		RIGHT_LOWERARM = 12,
		RIGHT_ARM = 13,
		RIGHT_SHOULDER = 14,
		RIGHT_FOOT = 15,
		RIGHT_LEG = 16,
		RIGHT_UPPERLEG = 17,
		BODYPART_LAST = 18,
	};

};

class BoneId
{
public:
	// Size: 0x4
	enum class Enum : int32_t
	{
		GROUND = 0,
		PELVIS = 1,
		SPINE = 2,
		SPINE_1 = 3,
		SPINE_2 = 4,
		SPINE_4 = 5,
		NECK = 6,
		NECK1 = 7,
		HEAD = 8,
		LEFT_THIGH = 9,
		LEFT_THIGH_TWIST = 10,
		LEFT_THIGH_TWIST1 = 11,
		LEFT_THIGH_TWIST2 = 12,
		LEFT_CALF = 13,
		LEFT_FOOT = 14,
		LEFT_TOE = 15,
		LEFT_TOENUB = 16,
		RIGHT_THIGH = 17,
		RIGHT_THIGH_TWIST = 18,
		RIGHT_THIGH_TWIST1 = 19,
		RIGHT_THIGH_TWIST2 = 20,
		RIGHT_CALF = 21,
		RIGHT_FOOT = 22,
		RIGHT_TOE = 23,
		RIGHT_TOENUB = 24,
		LEFT_CLAVICLE = 25,
		LEFT_UPPER_ARM = 26,
		LEFT_UPPER_ARM_TWIST = 27,
		LEFT_UPPER_ARM_TWIST1 = 28,
		LEFT_UPPER_ARM_TWIST2 = 29,
		LEFT_FOREARM = 30,
		LEFT_FORETWIST = 31,
		LEFT_FORETWIST1 = 32,
		LEFT_FORETWIST2 = 33,
		LEFT_HAND = 34,
		LEFT_FINGER_0 = 35,
		LEFT_FINGER_01 = 36,
		LEFT_FINGER_02 = 37,
		LEFT_FINGER_1 = 38,
		LEFT_FINGER_11 = 39,
		LEFT_FINGER_12 = 40,
		LEFT_FINGER_2 = 41,
		LEFT_FINGER_21 = 42,
		LEFT_FINGER_22 = 43,
		LEFT_FINGER_3 = 44,
		LEFT_FINGER_31 = 45,
		LEFT_FINGER_32 = 46,
		LEFT_FINGER_4 = 47,
		LEFT_FINGER_41 = 48,
		LEFT_FINGER_42 = 49,
		RIGHT_CLAVICLE = 50,
		RIGHT_UPPER_ARM = 51,
		RIGHT_UPPER_ARM_TWIST = 52,
		RIGHT_UPPER_ARM_TWIST1 = 53,
		RIGHT_UPPER_ARM_TWIST2 = 54,
		RIGHT_FOREARM = 55,
		RIGHT_FORETWIST = 56,
		RIGHT_FORETWIST1 = 57,
		RIGHT_FORETWIST2 = 58,
		RIGHT_HAND = 59,
		RIGHT_FINGER_0 = 60,
		RIGHT_FINGER_01 = 61,
		RIGHT_FINGER_02 = 62,
		RIGHT_FINGER_1 = 63,
		RIGHT_FINGER_11 = 64,
		RIGHT_FINGER_12 = 65,
		RIGHT_FINGER_2 = 66,
		RIGHT_FINGER_21 = 67,
		RIGHT_FINGER_22 = 68,
		RIGHT_FINGER_3 = 69,
		RIGHT_FINGER_31 = 70,
		RIGHT_FINGER_32 = 71,
		RIGHT_FINGER_4 = 72,
		RIGHT_FINGER_41 = 73,
		RIGHT_FINGER_42 = 74,
		XTRA_MUS_R_HIP = 75,
		XTRA_MUS_L_HIP = 76,
		RIGHT_HAND_ATTACHER = 77,
		LEFT_HAND_ATTACHER = 78,
		HIP_ATTACHER = 79,
		BACK_ATTACHER = 80,
		FREE_ATTACHER_01 = 81,
		FREE_ATTACHER_02 = 82,
		CAMERA_ATTACHER_01 = 83,
		CAMERA_ATTACHER_02 = 84,
		PROP_ATTACHER_01 = 85,
		PROP_ATTACHER_02 = 86,
		LEFT_EYE = 87,
		LEFT_EYE_LID = 88,
		RIGHT_EYE = 89,
		RIGHT_EYE_LID = 90,
		LOWER_LIP = 91,
		JAW = 92,
		LEFT_WRIST_EFFECTOR = 93,
		LEFT_FINGER_0_EFFECTOR = 94,
		LEFT_FINGER_1_EFFECTOR = 95,
		LEFT_FINGER_2_EFFECTOR = 96,
		LEFT_FINGER_3_EFFECTOR = 97,
		LEFT_FINGER_4_EFFECTOR = 98,
		RIGHT_WRIST_EFFECTOR = 99,
		RIGHT_FINGER_0_EFFECTOR = 100,
		RIGHT_FINGER_1_EFFECTOR = 101,
		RIGHT_FINGER_2_EFFECTOR = 102,
		RIGHT_FINGER_3_EFFECTOR = 103,
		RIGHT_FINGER_4_EFFECTOR = 104,
		XTRA_MUS_L_PEC = 105,
		XTRA_MUS_R_PEC = 106,
		XTRA_MUS_NECK = 107,
		XTRA_MUS_L_ELBOW = 108,
		XTRA_MUS_R_ELBOW = 109,
		XTRA_MUS_L_ASS = 110,
		XTRA_MUS_R_ASS = 111,
		XTRA_MUS_L_TOE = 112,
		XTRA_MUS_L_KNEE = 113,
		XTRA_MUS_L_FOOT = 114,
		XTRA_MUS_R_TOE = 115,
		XTRA_MUS_R_KNEE = 116,
		XTRA_MUS_R_FOOT = 117,
		XTRA_TARGET_R_FOOT = 118,
		XTRA_PIVOT_R_HEEL = 119,
		XTRA_TARGET_R_KNEE = 120,
		XTRA_ALIGN_R_KNEE = 121,
		XTRA_TARGET_L_FOOT = 122,
		XTRA_PIVOT_L_HEEL = 123,
		XTRA_TARGET_L_KNEE = 124,
		XTRA_ALIGN_L_KNEE = 125,
		XTRA_TARGET_R_ASS = 126,
		XTRA_TARGET_L_ASS = 127,
		XTRA_ALIGN_L_ASS = 128,
		XTRA_ALIGN_R_ASS = 129,
		XTRA_UP_THIGH = 130,
		XTRA_TARGET_R_PEC = 131,
		XTRA_ALIGN_R_ELBOW = 132,
		XTRA_TARGET_R_ELBOW = 133,
		XTRA_TARGET_L_PEC = 134,
		XTRA_ALIGN_L_ELBOW = 135,
		XTRA_TARGET_L_ELBOW = 136,
		XTRA_ALIGN_L_PEC = 137,
		XTRA_UP_PEC = 138,
		XTRA_ALIGN_R_PEC = 139,
		XTRA_ALIGN_NECK = 140,
		HEAD_ATTACHER = 141,
		RIFLE_HOLSTER_ATTACHER = 142,
		SPINE1_ATTACHER = 143,
		SADDLE = 144,
		LEFT_FRONT_FOOT = 145,
		LEFT_BACK_FOOT = 146,
		RIGHT_FRONT_FOOT = 147,
		RIGHT_BACK_FOOT = 148,
		BONEID_LAST = 149,
	};

};

// Size: 0x10
class alignas(8) ZGuid
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZGuid& p_Other) const;
	bool operator!=(const ZGuid& p_Other) const { return !(*this == p_Other); }

	uint32 _a; // 0x0
	uint16 _b; // 0x4
	uint16 _c; // 0x6
	uint8 _d; // 0x8
	uint8 _e; // 0x9
	uint8 _f; // 0xA
	uint8 _g; // 0xB
	uint8 _h; // 0xC
	uint8 _i; // 0xD
	uint8 _j; // 0xE
	uint8 _k; // 0xF
};
ZHM_OFFSET_CHECK(ZGuid, _a, 0x0);
ZHM_OFFSET_CHECK(ZGuid, _b, 0x4);
ZHM_OFFSET_CHECK(ZGuid, _c, 0x6);
ZHM_OFFSET_CHECK(ZGuid, _d, 0x8);
ZHM_OFFSET_CHECK(ZGuid, _e, 0x9);
ZHM_OFFSET_CHECK(ZGuid, _f, 0xA);
ZHM_OFFSET_CHECK(ZGuid, _g, 0xB);
ZHM_OFFSET_CHECK(ZGuid, _h, 0xC);
ZHM_OFFSET_CHECK(ZGuid, _i, 0xD);
ZHM_OFFSET_CHECK(ZGuid, _j, 0xE);
ZHM_OFFSET_CHECK(ZGuid, _k, 0xF);
static_assert(sizeof(ZGuid) == 0x10, "Wrong size for ZGuid");
static_assert(alignof(ZGuid) == 0x8, "Wrong alignment for ZGuid");

namespace ChallengesService {
	// Size: 0x4
	enum class EChallengeCompletionState : int32_t
	{
		Inactive = 0,
		Active = 1,
		Completed = 2,
	};

	// Size: 0x20
	class alignas(8) SChallengeState
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SChallengeState& p_Other) const;
		bool operator!=(const SChallengeState& p_Other) const { return !(*this == p_Other); }

		ZGuid m_id; // 0x0
		ChallengesService::EChallengeCompletionState m_completionState; // 0x10
		int32 m_progressCurrent; // 0x14
		int32 m_progressMax; // 0x18
	};
	ZHM_OFFSET_CHECK(SChallengeState, m_id, 0x0);
	ZHM_OFFSET_CHECK(SChallengeState, m_completionState, 0x10);
	ZHM_OFFSET_CHECK(SChallengeState, m_progressCurrent, 0x14);
	ZHM_OFFSET_CHECK(SChallengeState, m_progressMax, 0x18);
	static_assert(sizeof(SChallengeState) == 0x20, "Wrong size for SChallengeState");
	static_assert(alignof(SChallengeState) == 0x8, "Wrong alignment for SChallengeState");

	// Size: 0x30
	class alignas(8) SChallengeDefinition
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SChallengeDefinition& p_Other) const;
		bool operator!=(const SChallengeDefinition& p_Other) const { return !(*this == p_Other); }

		ZGuid m_id; // 0x0
		ZString m_name; // 0x10
		ZString m_description; // 0x20
	};
	ZHM_OFFSET_CHECK(SChallengeDefinition, m_id, 0x0);
	ZHM_OFFSET_CHECK(SChallengeDefinition, m_name, 0x10);
	ZHM_OFFSET_CHECK(SChallengeDefinition, m_description, 0x20);
	static_assert(sizeof(SChallengeDefinition) == 0x30, "Wrong size for SChallengeDefinition");
	static_assert(alignof(SChallengeDefinition) == 0x8, "Wrong alignment for SChallengeDefinition");

	// Size: 0x20
	class alignas(8) SChallengeStateChangedNotification
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SChallengeStateChangedNotification& p_Other) const;
		bool operator!=(const SChallengeStateChangedNotification& p_Other) const { return !(*this == p_Other); }

		ChallengesService::SChallengeState m_challengeState; // 0x0
	};
	ZHM_OFFSET_CHECK(SChallengeStateChangedNotification, m_challengeState, 0x0);
	static_assert(sizeof(SChallengeStateChangedNotification) == 0x20, "Wrong size for SChallengeStateChangedNotification");
	static_assert(alignof(SChallengeStateChangedNotification) == 0x8, "Wrong alignment for SChallengeStateChangedNotification");

}

namespace CrowdMapImpl {
	// Size: 0x4
	enum class CellFlags : int32_t
	{
		CELLFLAG_RESTRICTED_A = 1,
		CELLFLAG_RESTRICTED_B = 2,
		CELLFLAG_RESTRICTED_C = 4,
		CELLFLAG_WALKABLE = 8,
		CELLFLAG_TELEPORT_IN = 16,
		CELLFLAG_TELEPORT_OUT = 32,
		CELLFLAG_UNUSED = 64,
		CELLFLAG_PANIC_ONLY = 128,
	};

}

// Size: 0x4
enum class CrowdRegionType : int32_t
{
	CROWDSPHERE_NONE = 0,
	CROWDSPHERE_SAFE = 1,
	CROWDSPHERE_POI = 2,
	CROWDSPHERE_AVOID = 3,
	CROWDSPHERE_RELOCATE = 4,
	CROWDSPHERE_STOP = 5,
	CROWDSPHERE_ALERT = 6,
	CROWDSPHERE_SCARE = 7,
	CROWDSPHERE_GETDOWN = 8,
	CROWDSPHERE_DIE = 9,
};

namespace CrowdUtil {
	// Size: 0x4
	enum class ECrowdActorMood : int32_t
	{
		CM_AMBIENT = 0,
		CM_ALERTED = 1,
		CM_SCARED = 2,
		CM_PANICED = 3,
		CM_DEAD = 4,
		CM_DISABLED = 5,
		NUM_ACTOR_MOOD_TYPES = 6,
	};

	// Size: 0x4
	enum class ECrowdDirection : int32_t
	{
		NORTH = 0,
		EAST = 1,
		SOUTH = 2,
		WEST = 3,
	};

	// Size: 0x4
	enum class ECrowdFacing : int32_t
	{
		FRONT = 0,
		BACK = 1,
	};

	// Size: 0x4
	enum class ECrowdSide : int32_t
	{
		LEFT = 0,
		RIGHT = 1,
	};

	// Size: 0x4
	enum class ECrowdStandingPush : int32_t
	{
		PUSH_FRONT = 0,
		PUSH_FRONT_LEFT = 1,
		PUSH_LEFT = 2,
		PUSH_BACK_LEFT = 3,
		PUSH_BACK = 4,
		PUSH_BACK_RIGHT = 5,
		PUSH_RIGHT = 6,
		PUSH_FRONT_RIGHT = 7,
	};

	// Size: 0x4
	enum class EDefaultStateTypes : int32_t
	{
		STATE_IDLE = 0,
		STATE_WALK = 1,
		STATE_PENDINGWALK = 2,
		STATE_DEAD = 3,
		STATE_SCARED = 4,
		STATE_PENDINGSCARED = 5,
		STATE_POSSESSED = 6,
		STATE_ALERT = 7,
		STATE_PRONE = 8,
		STATE_RELOCATE = 9,
		STATE_PENDINGRELOCATE = 10,
		NUM_DEFAULT_STATES = 11,
	};

	// Size: 0x4
	enum class EGenderReq : int32_t
	{
		eGender_Any = 0,
		eGender_Male = 1,
		eGender_Female = 2,
	};

}

namespace CustomProfileData {
}

namespace DWN {
	// Size: 0x1C
	class alignas(4) SGameServerMatchPerformanceEvent
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SGameServerMatchPerformanceEvent& p_Other) const;
		bool operator!=(const SGameServerMatchPerformanceEvent& p_Other) const { return !(*this == p_Other); }

		float32 m_frameTimeMs; // 0x0
		float32 m_cPUUsagePercentage; // 0x4
		float32 m_memoryUsageMB; // 0x8
		float32 m_totalKilobitsSentLastSecond; // 0xC
		float32 m_totalKilobitsReceivedLastSecond; // 0x10
		uint16 m_numOfReplicasTotal; // 0x14
		uint16 m_numOfReplicasAuto; // 0x16
		uint16 m_numOfReplicasManual; // 0x18
		uint8 m_connectedPlayersCount; // 0x1A
	};
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_frameTimeMs, 0x0);
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_cPUUsagePercentage, 0x4);
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_memoryUsageMB, 0x8);
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_totalKilobitsSentLastSecond, 0xC);
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_totalKilobitsReceivedLastSecond, 0x10);
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_numOfReplicasTotal, 0x14);
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_numOfReplicasAuto, 0x16);
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_numOfReplicasManual, 0x18);
	ZHM_OFFSET_CHECK(SGameServerMatchPerformanceEvent, m_connectedPlayersCount, 0x1A);
	static_assert(sizeof(SGameServerMatchPerformanceEvent) == 0x1C, "Wrong size for SGameServerMatchPerformanceEvent");
	static_assert(alignof(SGameServerMatchPerformanceEvent) == 0x4, "Wrong alignment for SGameServerMatchPerformanceEvent");

}

// Size: 0x4
enum class EAchievementConditionOperator : int32_t
{
	Invalid = 0,
	GreaterOrEqual = 1,
	GreaterThan = 2,
	LessOrEqual = 3,
	LessThan = 4,
};

// Size: 0x4
enum class EAchievementGrade : int32_t
{
	Invalid = 0,
	Bronze = 1,
	Silver = 2,
	Gold = 3,
	Platinum = 4,
};

// Size: 0x4
enum class EActionInputSource : int32_t
{
	Invalid = 0,
	Unspecified = 1,
	Automated = 2,
	Controller = 3,
	Stick = 4,
	Keyboard = 5,
	Mouse = 6,
};

// Size: 0x4
enum class EActionMultiply : int32_t
{
	eNegative = 0,
	ePositive = 1,
};

// Size: 0x4
enum class EActionPromptState : int32_t
{
	eActionPromptState_Disabled = 0,
	eActionPromptState_Enabled = 1,
	eActionPromptState_Activated = 2,
	eActionPromptState_Held = 3,
};

// Size: 0x4
enum class EActionRadialArcIconType : int32_t
{
	EARAIT_NoIcon = 0,
	EARAIT_Locked = 1,
	EARAIT_NeedTool = 2,
	EARAIT_IsRunning = 3,
	EARAIT_Crowbar = 4,
	EARAIT_Wrench = 5,
	EARAIT_Card = 6,
	EARAIT_Lockpick = 7,
	EARAIT_Screwdriver = 8,
	EARAIT_AmmoBullet = 9,
	EARAIT_Flower = 10,
	EARAIT_ChemicalTube = 11,
	EARAIT_Golfball = 12,
	EARAIT_Keypad = 13,
	EARAIT_Key = 14,
	EARAIT_Coin = 15,
	EARAIT_Poison = 16,
	EARAIT_Exsplosive = 17,
};

// Size: 0x4
enum class EActivationPriority : int32_t
{
	eFIRST_TIMESPLIT_ACTIVATION_PRIORITY_BEGIN = 0,
	eActivatable_UI_FrameSplit = 0,
	eActivatable_DestructiblePhysics_FrameSplit = 1,
	eActivatable_Physics_FrameSplit = 2,
	eActivatable_Default_FrameSplit = 3,
	eFIRST_TIMESPLIT_ACTIVATION_PRORITY_END = 3,
	eActivatable_First = 4,
	eActivatable_PlayModeAddedPhysics = 5,
	eActivatable_PhysicsWind = 6,
	eActivatable_Physics = 7,
	eActivatable_PhysicsDone = 8,
	eActivatable_Online = 9,
	eActivatable_Keywords = 10,
	eActivatable_EventChannel = 11,
	eActivatable_Items = 12,
	eActivatable_AnimPlayer = 13,
	eActivatable_Sequence = 14,
	eActivatable_SpawnPoint = 15,
	eActivatable_Guide = 16,
	eActivatable_SequenceController = 17,
	eActivatable_KnownEntityAspects = 18,
	eActivatable_Crowds = 19,
	eActivatable_ChildNetworkAct = 20,
	eActivatable_Door = 21,
	eActivatable_UI_Setup = 22,
	eActivatable_NormalGameplay = 23,
	eActivatable_NormalGameplay_Condition = 24,
	eActivatable_NormalGameplay_Values = 25,
	eActivatable_NormalGameplay_State = 26,
	eActivatable_HeroSpawns = 27,
	eActivatable_UI = 28,
	eActivatable_AnimationActs = 29,
	eActivatable_Locomotion = 30,
	eActivatable_Timers = 31,
	eActivatable_AreaTriggers = 32,
	eActivatable_Default = 33,
	eActivatable_GameEventListener = 34,
	eActivatable_Last = 35,
	eLAST_TIMESPLIT_ACTIVATION_PRORITY_BEGIN = 36,
	eActivatable_PhysicsDone_FrameSplit = 36,
	eActivatable_GPW_FrameSplit = 37,
	eLAST_ACTIVATION_PRIORITY = 38,
	eLAST_TIMESPLIT_ACTIVATION_PRORITY_END = 38,
};

// Size: 0x4
enum class EActivityCategory : int32_t
{
	Progress = 0,
	OpenEnded = 1,
	Competitive = 2,
	Challenge = 3,
};

// Size: 0x4
enum class EAnimBlendMode : int32_t
{
	EAnimBlendMode_InterpAttInterpPos = 0,
	EAnimBlendMode_AddAttLeavePos = 2,
	EAnimBlendMode_AddAttAddPos = 3,
	EAnimBlendMode_OverrideAttOverridePos = 4,
};

// Size: 0x4
enum class EAnimationActLifetime : int32_t
{
	GameplayDriven = 0,
	AnimationDriven = 1,
};

// Size: 0x1
enum class EAttractDetractAreaType : int8_t
{
	Attract = 0,
	Detract = 1,
};

// Size: 0x4
enum class EAudioVolumetricMixingMode : int32_t
{
	AUDIO_VOLUMETRIC_MIXING_MAX = 0,
	AUDIO_VOLUMETRIC_MIXING_ADD = 1,
};

// Size: 0x4
enum class EAutoScanMode : int32_t
{
	ASM_GEOMETRY = 0,
	ASM_VOLUMEBOX = 1,
};

// Size: 0x4
enum class EAvoidanceChannels : int32_t
{
	ePFAC_NoChannel = 0,
	ePFAC_Default = 1,
	ePFAC_Wretch = 2,
	ePFAC_AllButWretch = -3,
	ePFAC_AllButDefault = -2,
	ePFAC_AllChannels = -1,
};

// Size: 0x4
enum class EBehindViewportLockMode : int32_t
{
	BVLM_None = 0,
	BVLM_Horizontal = 1,
	BVLM_Vertical = 2,
};

// Size: 0x1
enum class EBoatImplementationType : int8_t
{
	DefaultLegacy = 0,
	ArcadeSim = 1,
};

// Size: 0x1
enum class EBoatVoxelizationMode : int8_t
{
	BoundingBox = 0,
	ConvexMeshHull = 1,
};

// Size: 0x4
enum class EBoolCheckType : int32_t
{
	eBCT_IGNORE = 0,
	eBCT_TRUE = 1,
	eBCT_FALSE = 2,
};

// Size: 0x1
enum class ECCDUsage : int8_t
{
	ECCDUSAGE_DISABLED = 0,
	ECCDUSAGE_AGAINST_STATIC = 1,
	ECCDUSAGE_AGAINST_STATIC_DYNAMIC = 2,
};

// Size: 0x1
enum class ECOMUsage : int8_t
{
	ECOMUSAGE_AUTOCOMPUTE = 0,
	ECOMUSAGE_PIVOT = 1,
};

// Size: 0x1
enum class ECameraCollisionMode : int8_t
{
	ECAMERACOLLISIONMODE_COLLIDE_ALWAYS = 0,
	ECAMERACOLLISIONMODE_CAMERA_OBSTACLE = 1,
	ECAMERACOLLISIONMODE_COLLIDE_NEVER = 2,
	ECAMERACOLLISIONMODE_COLLIDE_DEFAULT = 3,
};

// Size: 0x1
enum class ECapsuleCollisionNonWalkableMode : int8_t
{
	ECCM_PreventClimbing = 0,
	ECCM_PreventClimbing_And_Slide = 1,
};

// Size: 0x1
enum class ECapsuleCollisionSourceType : int8_t
{
	Shape = 0,
	Controller = 1,
	Obstacle = 2,
	GroundSnapping = 3,
};

// Size: 0x1
enum class ECapsuleState : int8_t
{
	Supported = 0,
	Sliding = 1,
	Falling = 2,
};

// Size: 0x4
enum class ECharacterAnimEvent : int32_t
{
	ECAE_ActEnded = 16000,
};

// Size: 0x1
enum class ECharacterControllerFilterMode : int8_t
{
	Symmetric = 0,
	Asymmetric = 1,
};

// Size: 0x4
enum class ECharacterControllerType : int32_t
{
	CCT_Player = 0,
	CCT_NPC = 1,
	CCT_Sequence = 2,
};

// Size: 0x4
enum class ECharacterLocomotionGait : int32_t
{
	ECLG_IDLE = 0,
	ECLG_CROUCH = 1,
	ECLG_FASTCROUCH = 2,
	ECLG_WALK = 3,
	ECLG_FASTWALK = 4,
	ECLG_JOGG = 5,
	ECLG_SPRINT = 6,
};

// Size: 0x1
enum class ECheckpointReachedCauseEnum : int8_t
{
	EXIT = 0,
	RESTART = 1,
	MISSIONFAILED = 2,
	HEARTBEAT = 3,
	PROGRESS = 4,
	LOAD = 5,
};

// Size: 0x4
enum class ECloseCombatAttack : int32_t
{
	eCCA_Heavy = 0,
	eCCA_Light = 1,
	eCCA_Combo = 2,
};

// Size: 0x4
enum class ECloseCombatAttackPatternFilterFlag : int32_t
{
	BypassingAttackerTicketDueToEnemyTooClose = 0,
	EnemyWithFirearmUnholstered = 1,
	InfluencedByHenchman = 2,
	BehindEnemy = 3,
};

// Size: 0x1
enum class ECloseCombatImpactEffectDefinitionType : int8_t
{
	SuccessfulLightImpact = 0,
	SuccessfulHeavyImpact = 1,
	BlockedLightImpact = 2,
	BlockedHeavyImpact = 3,
	KOImpact = 4,
	SuccessfulRedirectStrikeImpact = 5,
	BlockedRedirectStrikeImpact = 6,
};

// Size: 0x4
enum class ECloseCombatReactionPatternFilterFlag : int32_t
{
	IncomingAttackConsecutive = 0,
	IncomingAttackNonConsecutive = 1,
	IncomingCombatRushAttack = 2,
	EnemyTryingToGrabMe = 3,
	NormalStance = 4,
	ParryStance = 5,
	BlockStance = 6,
	HeavyStagger = 7,
	ContextualAttackVictim = 8,
};

// Size: 0x1
enum class ECloseCombatStatsTriggerConditionEnum : int8_t
{
	SITUATIONCONTAINED = 0,
	MISSIONEND = 1,
	PLAYERDIED = 2,
};

// Size: 0x4
enum class EClothBendConstrainType : int32_t
{
	eClothBendConstrainType_Stick = 0,
	eClothBendConstrainType_Triangle = 1,
};

// Size: 0x4
enum class EClothColliderFilter : int32_t
{
	EClothColliderFilter_Environment = 0,
	EClothColliderFilter_Character = 1,
	EClothColliderFilter_Character_Environment = 2,
};

// Size: 0x4
enum class EClothStretchConstrainType : int32_t
{
	eClothBendConstrainType_Anchor = 0,
	eClothBendConstrainType_LRA = 1,
	eClothBendConstrainType_None = 2,
};

// Size: 0x4
enum class ECollidableLayer : int32_t
{
	eCollLayer_NONE = 0,
	eCollLayer_STATIC_COLLIDABLES_ONLY = 1,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY = 2,
	eCollLayer_STAIRS = 3,
	eCollLayer_SHOT_ONLY_COLLISION = 4,
	eCollLayer_KINEMATIC_COLLIDABLES_ONLY = 6,
	eCollLayer_STATIC_COLLIDABLES_ONLY_TRANSPARENT = 7,
	eCollLayer_DYNAMIC_COLLIDABLES_ONLY_TRANSPARENT = 8,
	eCollLayer_KINEMATIC_COLLIDABLES_ONLY_TRANSPARENT = 9,
	eCollLayer_STAIRS_STEPS = 10,
	eCollLayer_STAIRS_SLOPE = 11,
	eCollayer_COUNT = 12,
};

// Size: 0x4
enum class ECollidableShape : int32_t
{
	ECOLLIDABLESHAPE_SPHERE = 0,
	ECOLLIDABLESHAPE_CAPSULE = 1,
	ECOLLIDABLESHAPE_BOX = 2,
};

// Size: 0x1
enum class ECollidablesType : int8_t
{
	ECST_STATIC_AND_DYNAMIC = 0,
	ECST_STATIC_ONLY = 1,
	ECST_DYNAMIC_ONLY = 2,
};

// Size: 0x1
enum class ECollisionPriority : int8_t
{
	ECOLLISIONPRIORITY_LOW = 0,
	ECOLLISIONPRIORITY_NORMAL = 1,
	ECOLLISIONPRIORITY_HIGH = 2,
	ECOLLISIONPRIORITY_CRITICAL = 3,
};

// Size: 0x1
enum class ECollisionReportFlag : int8_t
{
	eCRF_REPORT_OVERLAPS = 0,
	eCRF_REPORT_IMPACTS = 1,
};

// Size: 0x1
enum class ECollisionResponse : int8_t
{
	REFLECT_VELOCITY = 0,
	SLIDE_ON = 1,
	STAY_AT_COLLISION_POINT = 2,
	CUSTOM = 3,
};

// Size: 0x4
enum class EColorPaletteMode : int32_t
{
	Default = 0,
	Deuteranopia = 1,
	Protanopia = 2,
	Tritanopia = 3,
	Custom = 4,
	COUNT = 5,
};

// Size: 0x4
enum class ECombinationMethod : int32_t
{
	eCM_DigitalAnd = 0,
	eCM_DigitalOr = 1,
	eCM_AnalogSum = 2,
	eCM_AnalogSumNegate = 3,
	eCM_Max = 4,
};

// Size: 0x4
enum class EConstraintType : int32_t
{
	ECONSTRAINTTYPE_UNKNOWN = 0,
	ECONSTRAINTTYPE_BALL_AND_SOCKET = 1,
	ECONSTRAINTTYPE_HINGE = 2,
	ECONSTRAINTTYPE_FIXED = 3,
	ECONSTRAINTTYPE_DISTANCE = 4,
	ECONSTRAINTTYPE_D6 = 5,
};

// Size: 0x1
enum class EContinuity : int8_t
{
	C0 = 0,
	C1 = 1,
	C2 = 2,
};

// Size: 0x4
enum class EConversationChoiceDisplayState : int32_t
{
	Default = 0,
	Disabled = 1,
	Unavailable = 2,
	Selectable = 3,
};

// Size: 0x4
enum class ECoordinateSpace : int32_t
{
	CSPACE_INVALID = 0,
	CSPACE_OBJECT_TO_WORLD = 1,
	CSPACE_OBJECT_TO_PARENT = 2,
	CSPACE_SEQUENCE_ORIGIN = 3,
	CSPACE_CHARACTER_RELATIVE = 4,
};

// Size: 0x4
enum class ECppTypeFlags : int32_t
{
	EDITOR_ONLY = 1,
	EDITOR_ONLY_CRITICAL = 2,
	RESETABLE = 4,
	RESETABLE_COND = 8,
	RESETABLE_STATIC = 16,
	THREADSAFE = 32,
	STREAMING_MAINTHREAD_METHODS = 64,
};

// Size: 0x4
enum class ECrowdFlowCandidates : int32_t
{
	NONE = 0,
	EVERYONE = 1,
	SPAWNED_ON_FLOW = 2,
};

// Size: 0x1
enum class ECurveInterpolationMode : int8_t
{
	CONSTANT = 0,
	LINEAR = 1,
	SPLINE = 2,
	EXPONENTIAL1 = 3,
	EXPONENTIAL2 = 4,
	EXPONENTIAL3 = 5,
	LOGARITHMIC1 = 6,
	LOGARITHMIC2 = 7,
	LOGARITHMIC3 = 8,
	SC = 9,
	SINE = 10,
	SQRT1 = 11,
	SQRT2 = 12,
	SQRT3 = 13,
};

// Size: 0x1
enum class ECurveVersion : int8_t
{
	CRV01 = 0,
	CRV02 = 1,
	CRV03 = 2,
};

// Size: 0x4
enum class ECustomIcons : int32_t
{
	Invalid = -1,
	Recruit = 0,
};

// Size: 0x4
enum class EDamageResponse : int32_t
{
	eDR_Fractured = 0,
	eDR_Detached = 1,
	eDR_Destroyed = 2,
	eDR_Collided = 3,
	eDR_Count = 4,
};

// Size: 0x4
enum class EDebugLocomotionTargetType : int32_t
{
	Move = 0,
	Face = 1,
	Aim = 2,
	Look = 3,
};

// Size: 0x4
enum class EDebugLocomotionWeaponStates : int32_t
{
	eDLMS_Holstered = 0,
	eDLMS_Unholstered = 1,
};

// Size: 0x1
enum class EDestructibleInteractionType : int8_t
{
	eDIT_SHOT = 0,
	eDIT_EXPLOSION = 1,
	eDIT_COLLISION = 2,
	eDIT_FRACTURE_AND_DETACH_ALL = 3,
	eDIT_OUT_OF_WORLD = 4,
	eDIT_COUNT = 5,
};

// Size: 0x4
enum class EDetectedNatType : int32_t
{
	NAT_UNSET = 0,
	NAT_1 = 1,
	NAT_2 = 2,
	NAT_3 = 3,
};

// Size: 0x4
enum class EDeviceCapability : int32_t
{
	eDC_Input = 1,
	eDC_Rumble = 2,
	eDC_XInput = 4,
	eDC_Durango = 8,
	eDC_Mouse = 16,
	eDC_Keyboard = 32,
	eDC_Gamepad = 64,
	eDC_Dualshock = 128,
	eDC_Debug = 256,
	eDC_DualSense = 512,
	eDC_GDK = 1024,
	eDC_AdaptiveTriggers = 2048,
	eDC_HapticRumble = 4096,
	eDC_SwitchPro = 8192,
	COUNT = 14,
};

// Size: 0x4
enum class EDeviceDeadzoneAxis : int32_t
{
	Invalid = 0,
	LeftThumbstickLow = 1,
	LeftThumbstickHigh = 2,
	RightThumbstickLow = 3,
	RightThumbstickHigh = 4,
	ThumbstickAction = 5,
	LeftTriggerLow = 6,
	LeftTriggerHigh = 7,
	RightTriggerLow = 8,
	RightTriggerHigh = 9,
};

// Size: 0x4
enum class EDeviceState : int32_t
{
	eDS_Unavailable = 0,
	eDS_Available = 1,
};

// Size: 0x4
enum class EDialogEventEndReason : int32_t
{
	EDialogEvent_Completed = 0,
	EDialogEvent_Stopped = 1,
};

// Size: 0x4
enum class EDialogEventItemType : int32_t
{
	eDEIT_WavFile = 1,
	eDEIT_RandomContainer = 2,
	eDEIT_SwitchContainer = 3,
	eDEIT_SequenceContainer = 4,
	eDEIT_Invalid = 15,
};

// Size: 0x1
enum class EDialogueConditionType : int8_t
{
	Playing = 0,
	Completed = 1,
};

// Size: 0x4
enum class EDifficultyLevel : int32_t
{
	eDL_NO_FLAGS = 0,
	eDL_EASY = 1,
	eDL_NORMAL = 2,
	eDL_HARD = 4,
	eDL_VERY_HARD = 8,
	eDL_ALL_FLAGS = 15,
};

// Size: 0x4
enum class EDifficultyParameter : int32_t
{
	EDP_Invalid = 0,
	EDP_AIAttentionGainMultiplier = 1,
	EDP_AIAudioPerceptionAlwaysEmitFootstepSoundEvents = 2,
	EDP_AICombat_ActiveCombatants_MinimumNumber = 3,
	EDP_AICombat_ActiveCombatants_MinimumNumberWhenAllVIPsAreDead = 4,
	EDP_AICombat_ActiveCombatants_MaximumNumber = 5,
	EDP_AICombat_ActiveCombatants_MinimumAmountForMedium = 6,
	EDP_AICombat_ActiveCombatants_MinimumAmountForMany = 7,
	EDP_AICombat_ShootingAccuracyResetPeriod_Minimum = 8,
	EDP_AICombat_ShootingAccuracyResetPeriod_Maximum_FewCombatants = 9,
	EDP_AICombat_ShootingAccuracyResetPeriod_Maximum_MediumCombatants = 10,
	EDP_AICombat_ShootingAccuracyResetPeriod_Maximum_ManyCombatants = 11,
	EDP_AICombat_Leaders_NumberOfActiveCombatantsNeededForOneLeader = 12,
	EDP_AICombat_Leaders_NumberOfActiveCombatantsNeededForTwoLeaders = 13,
	EDP_AICombat_MaximumInterestingCombatLifetime = 14,
	EDP_AICombat_MaximumInterestingTimeSinceLastCombat = 15,
	EDP_AICombat_ShootingAccuracyInitialBuildUp_MinimumDuration = 16,
	EDP_AICombat_ShootingAccuracyInitialBuildUp_MaximumDuration = 17,
	EDP_AICombat_ShootingAccuracy_MinimumDistance = 18,
	EDP_AICombat_FlashGrenadeThrow_GlobalCooldown = 19,
	EDP_AICombat_FlashGrenadeThrow_AggressionTriggerCooldown = 20,
	EDP_AICombat_FlashGrenadeThrow_TargetCampingTriggerCooldown = 21,
	EDP_AICombat_FlashGrenadeThrow_LargeRelocationTriggerCooldown = 22,
	EDP_AIDisguise_FollowWarningsDelay = 23,
	EDP_AIDisguise_BreakOnVeryCloseDistance = 24,
	EDP_AIEscortOut_MaxForbiddenMovement = 25,
	EDP_AIEscortOut_EscortEscalateDistance = 26,
	EDP_AIEscortOut_MaxTimeToHonorWarning = 27,
	EDP_AIEscortOut_EscortHardWarningDistance = 28,
	EDP_AIIllegalActionAttentionModifier = 29,
	EDP_AIInvestigateCautious_Disturbance_Radius = 30,
	EDP_AIInvestigateCautious_Search_ClearDisturbanceBackRadius = 31,
	EDP_AIInvestigateCautious_Search_ClearDisturbanceFrontRadius = 32,
	EDP_AIInvestigateCautious_Search_ClearDisturbanceRespectSoftReservationThreshold = 33,
	EDP_AIInvestigateCautiousAttentionToPersonEnabled = 34,
	EDP_AIInvestigateDisguiseMembersFollowDistance = 35,
	EDP_AILongTermMemory_DisableArrest = 36,
	EDP_AIRunningAttentionModifier = 37,
	EDP_AISentry_WarningDelay = 38,
	EDP_AISuspiciousMovementDisguiseAttentionModifier = 39,
	EDP_AISuspiciousMovementSensorEnabled = 40,
	EDP_AISuspiciousLostTargetTime = 41,
	EDP_ArrestEscalateIllegalWeapon = 42,
	EDP_ArrestEscalateMaximum = 43,
	EDP_ArrestEscalateMoving = 44,
	EDP_ArrestEscalateRunning = 45,
	EDP_ArrestTargetLostTime = 46,
	EDP_CloseCombatChainFailDamage = 47,
	EDP_CloseCombatChoiceWindowLength = 48,
	EDP_CloseCombatChokePressCount_Civilian = 49,
	EDP_CloseCombatChokePressCount_Elite = 50,
	EDP_CloseCombatChokePressCount_Guard = 51,
	EDP_CloseCombatCounterEndLength = 52,
	EDP_CloseCombatCounterFailDamage = 53,
	EDP_CloseCombatShowSnapNeckPressCount_Civilian = 54,
	EDP_CloseCombatShowSnapNeckPressCount_Elite = 55,
	EDP_CloseCombatShowSnapNeckPressCount_Guard = 56,
	EDP_DamageMultiplierHandgun = 57,
	EDP_DamageMultiplierSlowgun = 58,
	EDP_DamageMultiplierAssaultRifle = 59,
	EDP_DamageMultiplierSMG = 60,
	EDP_DamageMultiplierSniper = 61,
	EDP_DamageMultiplierRPG = 62,
	EDP_DamageMultiplierKnife = 63,
	EDP_DamageMultiplierShotgun = 64,
	EDP_DamageMultiplierSpotter = 65,
	EDP_DamageMultiplierHandgun_NPC = 66,
	EDP_DamageMultiplierSlowgun_NPC = 67,
	EDP_DamageMultiplierAssaultRifle_NPC = 68,
	EDP_DamageMultiplierSMG_NPC = 69,
	EDP_DamageMultiplierSniper_NPC = 70,
	EDP_DamageMultiplierRPG_NPC = 71,
	EDP_DamageMultiplierKnife_NPC = 72,
	EDP_DamageMultiplierShotgun_NPC = 73,
	EDP_DamageMultiplierSpotter_NPC = 74,
	EDP_DisguiseRuiningEnabled = 75,
	EDP_GameMissionSaveLimit = 76,
	EDP_GameOpportunitiesEnabled = 77,
	EDP_HearRangeBulletImpact = 78,
	EDP_HearRangeBulletImpactOnBody = 79,
	EDP_HearRangeCloseCombatBreakNeck = 80,
	EDP_HearRangeCloseCombatChoke = 81,
	EDP_HearRangeCloseCombatFiberWire = 82,
	EDP_HearRangeCloseCombatHitFromBehind = 83,
	EDP_HearRangeCloseCombatL1 = 84,
	EDP_HearRangeCloseCombatL2 = 85,
	EDP_HearRangeCloseCombatL3 = 86,
	EDP_HearRangeEventAccident = 87,
	EDP_HearRangeEventAlarm = 88,
	EDP_HearRangeEventExplosion = 89,
	EDP_HearRangeEventRadio = 90,
	EDP_HearRangeEventStrange = 91,
	EDP_HearRangeEventThrownItem = 92,
	EDP_HearRangeFootstepWalkSlow = 93,
	EDP_HearRangeFootstepWalk = 94,
	EDP_HearRangeFootstepRun = 95,
	EDP_HearRangeFootstepCrouchWalkSlow = 96,
	EDP_HearRangeFootstepCrouchWalk = 97,
	EDP_HearRangeFootstepCrouchRun = 98,
	EDP_HearRangeFootstepVegetationLVAWalkSlow = 99,
	EDP_HearRangeFootstepVegetationLVAWalk = 100,
	EDP_HearRangeFootstepVegetationLVARun = 101,
	EDP_HearRangeFootstepVegetationLVACrouchWalkSlow = 102,
	EDP_HearRangeFootstepVegetationLVACrouchWalk = 103,
	EDP_HearRangeFootstepVegetationLVACrouchRun = 104,
	EDP_HearRangeGunEmpty = 105,
	EDP_HearRangeGunShot = 106,
	EDP_HearRangeGunSilenced = 107,
	EDP_HearRangeGunSuperSilenced = 108,
	EDP_HearRangeSpeakAngry = 109,
	EDP_HearRangeSpeakHelp = 110,
	EDP_HearRangeSpeakHelpLoud = 111,
	EDP_HearRangeSpeakPain = 112,
	EDP_HearRangeSpeakPainLow = 113,
	EDP_HearRangeSpeakWarning = 114,
	EDP_HitmanDamageReceivedMultiplier = 115,
	EDP_ManhuntGroupMaxSearchTime = 116,
	EDP_ManhuntGroupSearchAreaHackMaxDistance = 117,
	EDP_ManhuntGroupSearchAreaRadius = 118,
	EDP_MaxCoverShootActorCountMultiplier = 119,
	EDP_MinAttentionToForceLookAt = 120,
	EDP_MinAttentionToForceLookAtIfIncreasing = 121,
	EDP_NPCDamageReceivedMultiplier = 122,
	EDP_PlayerDamagePerSecondDistance = 123,
	EDP_PlayerDamagePerSecondLimitFar = 124,
	EDP_PlayerDamagePerSecondLimitNear = 125,
	EDP_PlayerDamagePerSecondThreshold = 126,
	EDP_PlayerHitPointsMax = 127,
	EDP_PlayerHitPointsRegenerationDelay = 128,
	EDP_PlayerHitPointsRegenerationPerSecond = 129,
	EDP_SecurityCameras = 130,
	EDP_SightReactionMinAttention = 131,
	EDP_SightInvestigationMinAttention = 132,
	EDP_ShootSpreadMax = 133,
	EDP_ShootSpreadMin = 134,
	EDP_ShootSpreadRange = 135,
	EDP_SocialGreetingAngle = 136,
	EDP_SocialGreetingCooldown = 137,
	EDP_SocialGreetingCooldownAlertLevel = 138,
	EDP_SocialGreetingCooldownLastSpeak = 139,
	EDP_SocialGreetingCooldownPlayer = 140,
	EDP_SocialGreetingCooldownSequence = 141,
	EDP_SocialGreetingDistance = 142,
	EDP_SocialLookAtTimeMax = 143,
	EDP_SocialLookAtTimeMin = 144,
	EDP_SocialSillyCooldown = 145,
	EDP_SocialSillyDistance = 146,
	EDP_SocialSillyTriggerTime = 147,
	EDP_SocialStandingCooldown = 148,
	EDP_SocialStandingDistance = 149,
	EDP_SocialStandingDistanceImmediate = 150,
	EDP_SocialStandingTriggerTime = 151,
	EDP_SpotHitmanShootingDistance = 152,
	EDP_StrictItemRules = 153,
	EDP_COUNT = 154,
};

// Size: 0x1
enum class EDiffuseGIClipmapLevelCount : int8_t
{
	DIFFUSEGILEVELCOUNT_1 = 0,
	DIFFUSEGILEVELCOUNT_2 = 1,
	DIFFUSEGILEVELCOUNT_3 = 2,
	DIFFUSEGILEVELCOUNT_4 = 3,
	DIFFUSEGILEVELCOUNT_5 = 4,
	DIFFUSEGILEVELCOUNT_6 = 5,
};

// Size: 0x1
enum class EDiffuseGIProbeCountXY : int8_t
{
	DIFFUSEGIPROBECOUNTXY_LOW = 16,
	DIFFUSEGIPROBECOUNTXY_MEDIUM = 32,
	DIFFUSEGIPROBECOUNTXY_HIGH = 64,
	DIFFUSEGIPROBECOUNTXY_VERY_HIGH = -128,
};

// Size: 0x1
enum class EDiffuseGIProbeCountZ : int8_t
{
	DIFFUSEGIPROBECOUNTZ_LOW = 4,
	DIFFUSEGIPROBECOUNTZ_MEDIUM = 8,
	DIFFUSEGIPROBECOUNTZ_HIGH = 16,
	DIFFUSEGIPROBECOUNTZ_VERY_HIGH = 32,
};

// Size: 0x1
enum class EDiffuseGIUpdateBudget : int8_t
{
	DIFFUSEGIUPDATEBUDGET_LOW = 0,
	DIFFUSEGIUPDATEBUDGET_MEDIUM = 1,
	DIFFUSEGIUPDATEBUDGET_HIGH = 2,
	DIFFUSEGIUPDATEBUDGET_VERY_HIGH = 3,
};

// Size: 0x1
enum class EDisorientedRestLocationType : int8_t
{
	HighWall = 0,
	LowWall = 1,
	SittingChair = 2,
	Stand = 3,
};

// Size: 0x1
enum class EDrivableSurfaceTypes : int8_t
{
	SURFACE_TYPE_TARMAC = 0,
	SURFACE_TYPE_MUD = 1,
	SURFACE_TYPE_SNOW = 2,
	SURFACE_TYPE_GRASS = 3,
	SURFACE_TYPE_LOOSE_SAND = 4,
	SURFACE_TYPE_PACKED_SAND = 5,
	SURFACE_TYPE_ICE = 6,
	SURFACE_TYPE_DIRT = 7,
	SURFACE_TYPE_GRAVEL = 8,
	SURFACE_TYPE_COBBLESTONES = 9,
	SURFACE_TYPE_METAL = 10,
	SURFACE_TYPE_SHALLOWWATER = 11,
	SURFACE_TYPE_DEEPWATER = 12,
	SURFACE_TYPE_WETSAND = 13,
	SURFACE_TYPE_ROCK = 14,
	SURFACE_TYPE_CONCRETE = 15,
};

// Size: 0x4
enum class EDynamicBrickActivationState : int32_t
{
	Activated = 0,
	Deactivated = 1,
	Activating = 2,
	Deactivating = 3,
};

// Size: 0x4
enum class EDynamicBrickLoadState : int32_t
{
	Unloaded = 0,
	Loaded = 1,
	Loading = 2,
	Unloading = 3,
};

// Size: 0x4
enum class EEGestureType : int32_t
{
	eTAP = 0,
	eHOLD = 1,
	eCOMBO = 2,
	eAXIS = 3,
	eTRUE = 4,
	eFALSE = 5,
	eKEYPRESS = 6,
	eMULTITAP = 7,
	eREPEAT = 8,
	eSEQUENCE = 9,
	eTHRESHOLD = 10,
	eCOUNTEDTAP = 11,
	eTOGGLE = 12,
	eHOLDTAP = 13,
	eSMARTTOGGLE = 14,
	eUNKNOWN = 15,
};

// Size: 0x4
enum class EEInputDevice : int32_t
{
	eKEYBOARD = 1,
	eMOUSE = 2,
	eGAMECONTROLLER = 4,
	eUNKNOWN = 8,
};

// Size: 0x1
enum class EEavesdropInterruptionReason : int8_t
{
	None = 0,
	ParticipantsDead = 1,
	ParticipantsUnavailable = 2,
	TooFar = 3,
	CoreLogic = 4,
};

// Size: 0x1
enum class EEavesdropInterruptionResult : int8_t
{
	Reset = 0,
	Fail = 1,
};

// Size: 0x1
enum class EEavesdropState : int8_t
{
	Inactive = 0,
	Visible = 1,
	Activable = 2,
	Active = 3,
	Interrupted = 4,
	Completed = 5,
	Failed = 6,
};

// Size: 0x1
enum class EEmitterType : int8_t
{
	PET_Constant = 0,
	PET_VariableRate = 1,
	PET_Burst = 2,
	PET_Trail = 3,
	PET_Ribbon = 4,
	PET_RateOverDistance = 5,
};

// Size: 0x4
enum class EEngineFrameUpdatePriority : int32_t
{
	eFrameUpdatePriority_First = 0,
	eFrameUpdatePriority_HttpManager = 1,
	eFrameUpdatePriority_WebsocketManager = 2,
	eFrameUpdatePriority_OnlineEventManager = 3,
	eFrameUpdatePriority_OnlineManager = 4,
	eFrameUpdatePriority_EntitlementManager = 5,
	eFrameUpdatePriority_MetricsManager = 6,
	eFrameUpdatePriority_AsyncPhysicsSimulationApplyResults = 7,
	eFrameUpdatePriority_BeforeEntityManager = 8,
	eFrameUpdatePriority_EntityManager = 9,
	eFrameUpdatePriority_StreamingWaitPointActivation = 10,
	eFrameUpdatePriority_GameplayWorldDetermineEngineMode = 11,
	eFrameUpdatePriority_MultiplayerInitialisation = 12,
	eFrameUpdatePriority_Start = 13,
	eFUP_InputOverrideManager = 14,
	eFUP_InputActionManager = 15,
	eFUP_FloatingPlaneAspect = 16,
	eFrameUpdatePriority_Default = 17,
	eFrameUpdatePriority_AnimationStart = 18,
	eFUP_GameEntityManager = 19,
	eFrameUpdatePriority_GraphicsSettingsManager = 20,
	eFrameUpdatePriority_Timers = 21,
	eFrameUpdatePriority_PersistentEntityManager = 22,
	eFUP_SoundGateManager = 23,
	eFrameUpdatePriority_Door = 24,
	eFrameUpdatePriority_TextureStreamingCameraControlEntity = 25,
	eFrameUpdatePriority_RenderVideoPlayer = 26,
	eFrameUpdatePriority_WaveformGeneratorManager = 27,
	eFrameUpdatePriority_TriggerKick = 28,
	eFrameUpdatePriority_TerrainGeomManager = 29,
	eFrameUpdatePriority_TerrainEntity = 30,
	eFrameUpdatePriority_PCG_Spawners = 31,
	eFrameUpdatePriority_PCG = 32,
	eFrameUpdatePriority_UserProfileManager = 33,
	eFrameUpdatePriority_TextInputDialog = 34,
	eFrameUpdatePriority_SystemDialog = 35,
	eFrameUpdatePriority_TextToSpeech = 36,
	eFrameUpdatePriority_ChatManager = 37,
	eFrameUpdatePriority_RoomManagerMain = 38,
	eFUP_WindManager = 39,
	eFrameUpdatePriority_DebugConsole = 40,
	eFrameUpdatePriority_DebugCheckKey = 41,
	eFrameUpdatePriority_FreeCameraControlEntity = 42,
	eFrameUpdatePriority_PlayerCommunicationEarly = 43,
	eFrameUpdatePriority_ManipulatorGizmo = 44,
	eFrameUpdatePriority_PhysicsManipulator = 45,
	eFrameUpdatePriority_SendAudioEvents = 46,
	eFrameUpdatePriority_AudioManagerWwise = 47,
	eFrameUpdatePriority_ReferenceMovementPrePhysics = 48,
	eFrameUpdatePriority_CrowdSyncCrowdLogicUpdate = 49,
	eFrameUpdatePriority_CrowdDensityEntity = 50,
	eFUP_ProjectedCrowdRegion = 51,
	eFrameUpdatePriority_CrowdCulling = 52,
	eFrameUpdatePriority_CameraCoreLogic = 53,
	eFrameUpdatePriority_GadgetWatchScanCorelogicDispatcher = 54,
	eFrameUpdatePriority_CharacterTriggeringCoreLogicPinSignals = 55,
	eFrameUpdatePriority_KeywordSubscribed = 56,
	eFrameUpdatePriority_BeforeCoreLogic = 57,
	eFrameUpdatePriority_CoreLogic = 58,
	eFrameUpdatePriority_PostCoreLogic = 59,
	eFrameUpdatePriority_CinematicTransitionsApproach = 60,
	eFrameUpdatePriority_SequenceManager = 61,
	eFrameUpdatePriority_KntGameRulesUpdate = 62,
	eFrameUpdatePriority_KickParticleJobs = 63,
	eFrameUpdatePriority_GameplayWriteStateForAI = 64,
	eFrameUpdatePriority_GameplayWorldUpdate = 65,
	eFrameUpdatePriority_PostGameplayWorldUpdate = 66,
	eFrameUpdatePriority_SpatialEntityUpdateManagerEarly = 67,
	eFrameUpdatePriority_CharacterManagerSendAIActionRequests = 68,
	eFrameUpdatePriority_AutomaticCameraCutDetection = 69,
	eFrameUpdatePriority_CameraCutCrowdCulling = 70,
	eFrameUpdatePriority_CharacterReplicationDeserialization = 71,
	eFrameUpdatePriority_PlayerControllerPreUpdate = 72,
	eFrameUpdatePriority_CharacterManager = 73,
	eFrameUpdatePriority_AnimationPrePhysics = 74,
	eFrameUpdatePriority_AnimationPrePhysicsWait = 75,
	eFrameUpdatePriority_PhysicsSimulationBegin = 76,
	eFrameUpdatePriority_PhysicsSimulationEnd = 77,
	eFrameUpdatePriority_AnimationPostPhysics = 78,
	eFrameUpdatePriority_AnimationPostMove = 79,
	eFrameUpdateLinkedEntityManagerEarly = 80,
	eFrameUpdateLinkedEntity = 200,
	eFrameUpdateLinkedEntityManagerMainThread = 201,
	eFrameUpdatePriority_PlayerControllerManagerEndFrame = 202,
	eFrameUpdatePriority_PlayerLocomotionApproach = 203,
	eFUP_DestructionSystem = 204,
	eFUP_DestructionSystemPostTick = 205,
	eFrameUpdatePriority_DecalSpawnManager = 206,
	eFrameUpdatePriority_Scatter = 207,
	eFrameUpdatePriority_ClothCharacterEntity = 208,
	eFUP_ParticleHeirEmitting = 209,
	eFrameUpdatePriority_ParticleColliderEmission = 210,
	eFrameUpdatePriority_ParticleDecalSpawn = 211,
	eFrameUpdatePriority_AnimationTestPostMove = 212,
	eFrameUpdatePriority_PostFilter = 213,
	eFrameUpdatePriority_ClothManager = 214,
	eFUP_SoundCollisionManager = 215,
	eFrameUpdatePriority_Crowd = 216,
	eFrameUpdatePriority_SpatialEntityUpdateManager = 217,
	eFrameUpdatePriority_EditorServer = 218,
	eFrameUpdatePriority_ContractsManager = 219,
	eFrameUpdatePriority_ConditionalTimer = 220,
	eFrameUpdatePriority_KeywordDebug = 221,
	eFrameUpdatePriority_LocalizationManager = 222,
	eFrameUpdatePriority_SubtitleManager = 223,
	eFrameUpdatePriority_ContractsGameManager = 224,
	eFrameUpdatePriority_RenderManager = 225,
	eFrameUpdatePriority_AnimationDebugger = 226,
	eFrameUpdatePriority_DebugHandlers = 227,
	eFrameUpdatePriority_SendCameraPositions = 228,
	eFrameUpdatePriority_Camera = 229,
	eFrameUpdatePriority_VirtualCamera = 230,
	eFrameUpdatePriority_Dithering = 231,
	eFrameUpdatePriority_PushLensPostFilterData = 232,
	eFrameUpdatePriority_UpdateVisualEffects = 233,
	eFrameUpdatePriority_PlayerControllerPostCamera = 234,
	eFrameUpdatePriority_HUDDataProviders = 235,
	eFrameUpdatePriority_HUDGroupVisibilityReceivers = 236,
	eFrameUpdatePriority_EnvironmentMarkupEntity = 237,
	eFrameUpdatePriority_RayProbeEntity = 238,
	eFUP_syncDestructionEffects = 239,
	eFrameUpdatePriority_ActorStartNetworkUpdate = 240,
	eFrameUpdatePriority_TextureManager = 500,
	eFrameUpdatePriority_NotificationsController = 501,
	eFUP_Pathfinder = 502,
	eFrameUpdatePriority_LevelManager = 1000,
	eFrameUpdatePriority_NetworkTelemetry = 1001,
	eFrameUpdatePriority_AudioStartUpdate = 1002,
	eFrameUpdatePriority_UIUpdate = 1003,
	eFrameUpdatePriority_AudioFinishUpdate = 1004,
	eFrameUpdatePriority_SpatialEntityUpdateManagerLate = 1005,
	eFrameUpdatePriority_WaitParticleJobs = 1006,
	eFrameUpdatePriority_Last = 10000,
};

// Size: 0x4
enum class EExtendedPropertyType : int32_t
{
	TYPE_RESOURCEPTR = 0,
	TYPE_INT32 = 1,
	TYPE_UINT32 = 2,
	TYPE_FLOAT = 3,
	TYPE_STRING = 4,
	TYPE_BOOL = 5,
	TYPE_ENTITYREF = 6,
	TYPE_VARIANT = 7,
};

// Size: 0x4
enum class EFireMode : int32_t
{
	SemiAutomatic = 0,
	Automatic = 1,
	Burst = 2,
	Charge = 3,
};

// Size: 0x4
enum class EFirearmAnimationEvent : int32_t
{
	MagazineOut = 0,
	MagazineIn = 1,
	PullChamber = 2,
	Holster = 3,
	Unholster = 4,
	Pickup = 5,
	Aim = 6,
	Attach = 7,
	Detach = 8,
	Count = 9,
};

// Size: 0x4
enum class EFirearmChamberingType : int32_t
{
	Autoloading = 0,
	BoltAction = 1,
};

// Size: 0x4
enum class EFirearmClass : int32_t
{
	HandGun = 0,
	SubMachineGun = 1,
	AssaultRifle = 2,
	Taser = 3,
	TranquilizerDartGun = 4,
	Shotgun = 5,
	LongRifle = 6,
	HeavyHandGun = 7,
};

// Size: 0x4
enum class EFirearmDisarmSource : int32_t
{
	Unknown = 0,
	Input = 1,
	HitReaction = 2,
	Stagger = 3,
};

// Size: 0x4
enum class EFirearmDisarmType : int32_t
{
	EquippedOnly = 0,
	AllAttached = 1,
};

// Size: 0x4
enum class EFirearmProjectileEffectInstigator : int32_t
{
	Any = 0,
	Player = 1,
	NPC = 2,
};

// Size: 0x4
enum class EFirearmReloadType : int32_t
{
	Magazine = 0,
	SingleBullet = 1,
};

// Size: 0x4
enum class EFirearmSpecialReactionTriggerType : int32_t
{
	AnyShot = 0,
	FirstShot = 1,
	NoShot = 2,
};

// Size: 0x4
enum class EFontFlags : int32_t
{
	FV_Original = 16,
	FV_NoAutoFit = 32,
	FV_Normal = 0,
	FV_Italic = 1,
	FV_Bold = 2,
	FV_BoldItalic = 3,
	FV_FauxItalic = 4,
	FV_FauxBold = 8,
	FV_FauxBoldItalic = 12,
};

// Size: 0x1
enum class EGIMaterialUpdateFreq : int8_t
{
	GIMATERIALUPDATEFREQ_LOW = 0,
	GIMATERIALUPDATEFREQ_MEDIUM = 1,
	GIMATERIALUPDATEFREQ_HIGH = 2,
};

// Size: 0x1
enum class EGadgetWatchTriangulationState : int8_t
{
	Off = 0,
	DirectionFound = 1,
	SearchArea = 2,
	SignalLocked = 3,
	HackingProgress = 4,
	HackingOutOfRange = 5,
	HackingFailed = 6,
	HackingComplete = 7,
};

// Size: 0x4
enum class EGait : int32_t
{
	eGait_Normal = 0,
	eGait_Reposition = 1,
	eGait_Alert = 2,
	eGait_Scared = 3,
	eGait_Prone = 4,
	eGait_Dead = 5,
	eGait_Angry = 6,
	eGait_Applause = 7,
	eGait_BeatUp_000cm_01_Dual_A = 8,
	eGait_BeatUp_000cm_01_Dual_B = 9,
	eGait_BeatUp_000cm_02_Dual_A = 10,
	eGait_BeatUp_000cm_02_Dual_B = 11,
	eGait_BeatUp_Wall_Dual_A = 12,
	eGait_BeatUp_Wall_Dual_B = 13,
	eGait_Chatting = 14,
	eGait_Cheer = 15,
	eGait_Clap = 16,
	eGait_Climb_Up_Fall = 17,
	eGait_Concerned = 18,
	eGait_Couples_A = 19,
	eGait_Couples_B = 20,
	eGait_Couples_C = 21,
	eGait_Dance_Drunk = 22,
	eGait_Dance_Dual_A = 23,
	eGait_Dance_Dual_B = 24,
	eGait_Dance_Party = 25,
	eGait_Dance_Rave = 26,
	eGait_Excited = 27,
	eGait_Fanatic_Fans = 28,
	eGait_Freeze_A = 29,
	eGait_Freeze_B = 30,
	eGait_Freeze_C = 31,
	eGait_Freeze_Lean_Wall = 32,
	eGait_Haggle = 33,
	eGait_Interested = 34,
	eGait_Jeer = 35,
	eGait_Lean_Rail = 36,
	eGait_Lean_Wall = 37,
	eGait_Lie_WritheInPain = 38,
	eGait_LookAt_Race_A = 39,
	eGait_LookAt_Race_B = 40,
	eGait_LookUp_Excited = 41,
	eGait_Mingle = 42,
	eGait_Mingle_120cm = 43,
	eGait_Mingle_Drunk = 44,
	eGait_Mingle_Mumbai_A = 45,
	eGait_Mingle_Mumbai_B = 46,
	eGait_Mingle_Race = 47,
	eGait_Mingle_Race_Rail = 48,
	eGait_Mingle_Wall = 49,
	eGait_Pacing_Angry = 50,
	eGait_Party = 51,
	eGait_Protest = 52,
	eGait_Push_Gate = 53,
	eGait_Rally = 54,
	eGait_Reaction_TearGas = 55,
	eGait_Shocked = 56,
	eGait_Shop = 57,
	eGait_Sit_020cm = 58,
	eGait_Sit_040cm = 59,
	eGait_Sit_100cm = 60,
	eGait_Sit_ChairBasic = 61,
	eGait_Sit_ChairBasic_LeanForward = 62,
	eGait_Sit_Ground_Hungover = 63,
	eGait_Squat_Relaxed = 64,
	eGait_Squat_Sorting = 65,
	eGait_Throw_Rice = 66,
	eGait_Wait_Excited = 67,
	eGait_Wait_InLine = 68,
	eGait_WarmHands_100cm = 69,
	eGait_Wave_Mexican = 70,
	eGait_Yell_Up = 71,
	eGait_Custom0 = 72,
	eGait_Custom1 = 73,
	eGait_Custom2 = 74,
	eGait_Custom3 = 75,
	eGait_Custom4 = 76,
	eGait_Custom5 = 77,
	eGait_Custom6 = 78,
	eGait_Custom7 = 79,
	eGait_Custom8 = 80,
	eGait_Custom9 = 81,
	eGait_Knt_Pepper_GalaMingle = 82,
	eGait_Knt_Pepper_GalaSpeech = 83,
	eGait_Knt_Pepper_GalaApplause = 84,
	eGait_Knt_Pepper_GalaDance = 85,
	eGait_Knt_Dahlia_MarketMingle = 86,
	eGait_Knt_Dahlia_MarketShopping = 87,
	eGait_Knt_Dahlia_MarketBar = 88,
	eGait_Knt_Rose_TournamentSpectating = 89,
	eGait_Knt_Rose_GardenMingle = 90,
	eGait_Knt_Rose_BombVictims = 91,
	eGait_Jeer_Booing = 92,
	eGait_Tough = 93,
	eGait_Groove = 94,
	eGait_GrooveMingle = 95,
	eGait_GrooveSmoke = 96,
	eGait_GrooveDrink = 97,
	eGait_Dance_Rave_Mild = 98,
	eGait_Dance_Rave_Moderate = 99,
	eGait_Dance_Rave_Intense = 100,
	eGait_Dance_Rave_Extreme = 101,
	eGait_ArmsFront = 102,
	eGait_Armside = 103,
	eGait_Arm_On_Hip = 104,
	eGait_Arms_Crossed = 105,
	eGait_Mingle_Left = 106,
	eGait_Mingle_Right = 107,
	eGait_Talk = 108,
	eGait_Talk_Submissive = 109,
	eGait_Talk_Aggressive = 110,
	eGait_Talk_Arrogant = 111,
	eGait_Talk_ArmsFront = 112,
	eGait_Talk_Armside = 113,
	eGait_Talk_Arm_On_Hip = 114,
	eGait_Talk_Arms_Crossed = 115,
};

// Size: 0x4
enum class EGameCameraFramingOffsetModifyMethod : int32_t
{
	Overwrite = 0,
	Add = 1,
};

// Size: 0x4
enum class EGameCameraHumanoidTargetSource : int32_t
{
	Capsule = 0,
	Mesh = 1,
	MeleeCapsule = 2,
	VaultCapsule = 3,
	ScaleCapsule = 4,
};

// Size: 0x4
enum class EGameCameraLensFilterColorPropertyOverrideMethod : int32_t
{
	None = 0,
	Overwrite = 1,
};

// Size: 0x4
enum class EGameCameraLensFilterNumericalPropertyOverrideMethod : int32_t
{
	None = 0,
	Overwrite = 1,
	Add = 2,
	Multiply = 3,
};

// Size: 0x1
enum class EGameCameraShakeDirectionType : int8_t
{
	SourceToCameraDirection = 0,
	CameraDirection = 1,
	SourceDirection = 2,
};

// Size: 0x1
enum class EGameCameraShakeState : int8_t
{
	Init = 0,
	FadeIn = 1,
	FullPower = 2,
	FadeOut = 3,
};

// Size: 0x1
enum class EGameCameraSpringCoordinateSystemType : int8_t
{
	Cartesian = 0,
	Cylindrical = 1,
};

// Size: 0x4
enum class EGameCameraTransitionMotion : int32_t
{
	Linear = 0,
	Orbital = 1,
};

// Size: 0x4
enum class EGameCameraTransitionSourceOffsetBehaviour : int32_t
{
	Simulated = 0,
	LocalPlayerControlled = 1,
};

// Size: 0x4
enum class EGameCameraTransitionSourceTargetBehaviour : int32_t
{
	Simulated = 0,
	Preserved = 1,
};

// Size: 0x4
enum class EGameEventType : int32_t
{
	GET_GameplayStart = 0,
	GET_GameplayStop = 1,
	GET_IntroCutStart = 2,
	GET_IntroCutEnd = 3,
	GET_ProfilingStart = 4,
	GET_SavegameRestored = 5,
	GET_PlayingAfterLoad = 6,
	GET_MultiplayerGameplayStart = 7,
	GET_COUNT = 8,
};

// Size: 0x4
enum class EGameObjectiveUIDisplayType : int32_t
{
	Default = 0,
	Hint = 1,
	QuestItem = 2,
	Opportunity = 3,
	OpportunityStep = 4,
	MainObjective = 5,
	SubObjective = 6,
};

// Size: 0x4
enum class EGameServerLifeCycleState : int32_t
{
	INVALID = 0,
	eINACTIVE = 1,
	eSTARTED = 2,
	eREGISTERED = 3,
	eTERMINATING = 4,
	eTERMINATED = 5,
};

// Size: 0x4
enum class EGameStatDataType : int32_t
{
	Invalid = 0,
	Integer = 1,
	Float = 2,
};

// Size: 0x1
enum class EGameStateChangeEnum : int8_t
{
	EXIT = 0,
	MISSIONSTART = 1,
	MISSIONFAILED = 2,
	GAMEPLAYAREA = 3,
};

// Size: 0x4
enum class EGameUIOptionKey : int32_t
{
	GAME_UI_OPTION_START = 100000,
	GAME_UI_OPTION_GAME_OVERALL_DIFFICULTY = 100001,
	GAME_UI_OPTION_GAME_AIM_SENSITIVITY_HORZ = 100100,
	GAME_UI_OPTION_GAME_AIM_SENSITIVITY_VERT = 100101,
	GAME_UI_OPTION_GAME_AIM_RESPONSE_CURVE = 100110,
	GAME_UI_OPTION_GAME_DRIVING_STEERING_SENSITIVITY = 100150,
	GAME_UI_OPTION_GAME_AIM_SNAP = 100201,
	GAME_UI_OPTION_GAME_CAMERA_DEFAULT_SHOULDER_SIDE = 100210,
	GAME_UI_OPTION_GAME_CAMERA_AUTO_FOLLOW = 100211,
	GAME_UI_OPTION_GAME_AUTO_AGILITY = 100212,
	GAME_UI_OPTION_GAME_VIBRATION_STATE = 100220,
	GAME_UI_OPTION_GAME_SHOW_HOLSTERED_RETICLE = 100300,
	GAME_UI_OPTION_GAME_MELEE_WARNING_EFFECTS = 100301,
	GAME_UI_OPTION_GAME_AIMING_GLOW = 100302,
	GAME_UI_OPTION_GAME_SYSTEMREMINDER_CONTEXTUALHELP = 100400,
	GAME_UI_OPTION_GAME_SYSTEMREMINDER_TUTORIAL = 100410,
	GAME_UI_OPTION_ACCESSIBILITY_BREADCRUMBS_DIFFICULTY = 100500,
	GAME_UI_OPTION_ACCESSIBILITY_QTE_SKIP_ENABLED = 100501,
	GAME_UI_OPTION_ACCESSIBILITY_DESATURATE_EXPLOSIVES_ENABLED = 100600,
	GAME_UI_OPTION_GRAPHICS_REDUCE_LIGHT_EFFECTS = 110000,
	GAME_UI_OPTION_GRAPHICS_FLASHBANG_BLACK = 110001,
	GAME_UI_OPTION_END = 199999,
};

// Size: 0x4
enum class EGameplayInputOverridePresetHoldFlags : int32_t
{
	None = 0,
	Accelerate_DEPRECATED = 1,
	Aim = 2,
	GadgetView = 4,
	Interact = 8,
	SkipCinematic = 16,
};

// Size: 0x4
enum class EGestureHoldTapType : int32_t
{
	FireWhenPressed = 0,
	FireWhenReleased = 1,
	FireWhilePressed = 2,
};

// Size: 0x4
enum class EGestureTapType : int32_t
{
	OnReleased = 0,
	OnPressed = 1,
	DelayPressed = 2,
	DelayReleased = 3,
};

// Size: 0x1
enum class EGlowBlendMode : int8_t
{
	PREMULTIPLIED_ALPHA = 0,
	ADDITIVE_ALPHA = 1,
	ADDITIVE_RGB = 2,
};

// Size: 0x4
enum class EGuidanceType : int32_t
{
	Invalid = -1,
	Lead = 0,
	Follow = 1,
};

// Size: 0x4
enum class EHAPTICSEFFECT : int32_t
{
	HE_NONE = 0,
	HE_FIRESHOT = 1,
	HE_FIRESHOT_REVOLVER = 2,
	HE_FIRESHOT_PUMPGUN = 3,
	HE_PROJECTILEHIT_SMALL = 4,
	HE_PROJECTILEHIT_LARGE = 5,
	HE_EXPLOSION_SMALL = 6,
	HE_EXPLOSION_LARGE = 7,
	HE_CLOSECOMBATHIT = 8,
	HE_BUMP_EXTRASMALL = 9,
	HE_BUMP_SMALL = 10,
	HE_BUMP_MEDIUM = 11,
	HE_BUMP_LARGE = 12,
	HE_LAST = 13,
};

// Size: 0x4
enum class EHDRGlareType : int32_t
{
	eCamera = 0,
	eNatural = 1,
	eCheapLens = 2,
	eFilterCrossScreen = 3,
	eFilterCrossScreenSpectral = 4,
	eFilterSnowCross = 5,
	eFilterSnowCrossSpectral = 6,
	eFilterSunnyCross = 7,
	eFilterSunnyCrossSpectral = 8,
	eCinecamVerticalSlits = 9,
	eCinecamHorizontalSlits = 10,
	eCinematicAnamorphic = 11,
};

// Size: 0x4
enum class EHandgunType : int32_t
{
	HandGun = 0,
	Taser = 1,
	TranquilizerDartGun = 2,
};

// Size: 0x4
enum class EHumanoidSequenceStance : int32_t
{
	None = 0,
	Standing = 1,
	Crouched = 2,
	CloseCombat = 3,
	HighCoverRight = 4,
	HighCoverLeft = 5,
	LowCoverRight = 6,
	LowCoverLeft = 7,
};

// Size: 0x4
enum class EHumanoid_InputProcess : int32_t
{
	CustomActions = 0,
	GadgetInputs = 1,
	CloseCombatPairedActionsInput = 2,
	CoverTakedownInput = 3,
	CombatRushInputWithDirection = 4,
	EnterConfrontationInput = 5,
	LureInput = 6,
	BluffInput = 7,
	VaultInput = 8,
	AttackFromAbove = 9,
	GrabInput = 10,
	FirearmActivationDeactivationInput = 11,
	PickpocketInputWithDirection = 12,
	NewGrabInputWithDirection = 13,
	ContextualItemThrowInputWithDirection = 14,
	MeleeAttackInputWithDirection = 15,
	InteractionInputWithDirection = 16,
	DoorInputWithDirection = 17,
	CombatRushInput = 18,
	MeleeAttackInputWithTarget = 19,
	PickpocketInput = 20,
	InteractionInput = 21,
	DoorInput = 22,
	MeleeAttackInput = 23,
	GenericAnimDrivenActionInput = 24,
	ScaleInput = 25,
	AgilityActionInput = 26,
	ParryInputWithEnemy = 27,
	ContextualJumpInput = 28,
	DashInput = 29,
	CoverCornerTurnInput = 30,
	AgencyFocusInput = 31,
	FakeSurrenderInput = 32,
	ComplyingInput = 33,
	CrouchInput = 34,
	AccelerationInput = 35,
	ContextualItemThrowInput = 36,
	ItemSelectionInput = 37,
	NewGrabInput = 38,
	SidestepInput = 39,
	ReloadInput = 40,
	ParryInputNoEnemy = 41,
	ItemThrowInput = 42,
	CameraFocusInput = 43,
	LaddersInput = 44,
	AimInput = 45,
};

// Size: 0x1
enum class EIdentificationProgressRateType : int8_t
{
	Linear = 0,
	Curve = 1,
};

// Size: 0x4
enum class EImpactEffectsOptions : int32_t
{
	eIE_None = 0,
	eIE_BloodSplatter = 1,
	eIE_Decals = 2,
	eIE_MaterialImpactEffects = 4,
	eIE_AmmoImpactEffect = 8,
	eIE_All = 16,
};

// Size: 0x4
enum class EImpostorBakeResolution : int32_t
{
	eResolution32 = 0,
	eResolution64 = 1,
	eResolution128 = 2,
	eResolution256 = 3,
	eResolution512 = 4,
};

// Size: 0x4
enum class EImpostorBakeType : int32_t
{
	eFullSphere = 0,
	eHemisphere = 1,
};

// Size: 0x4
enum class EInputOverrideConflictResolutionType : int32_t
{
	Unhandled = 0,
	SwappedInput = 1,
	RemovedInput = 2,
	Failed = 3,
};

// Size: 0x4
enum class EInputOverridePresetFlags : int32_t
{
	None = 0,
	InvertControllerLookX = 1,
	InvertControllerLookY = 2,
	InvertControllerMoveX = 4,
	InvertControllerMoveY = 8,
	InvertMouseLookX = 16,
	InvertMouseLookY = 32,
	HoldsToToggles = 64,
};

// Size: 0x4
enum class EInputStateActiveInputFlags : int32_t
{
	IncludeGamepadDigital = 1,
	IncludeGamepadTriggers = 2,
	IncludeGamepadSticks = 4,
	IncludeKeyboardDigital = 8,
	IncludeMouseDigital = 16,
	IncludeMouseMovement = 32,
};

// Size: 0x4
enum class EInteractionDisplayType : int32_t
{
	Display2D = 0,
	Display3D = 1,
	Display2DCorner = 2,
};

// Size: 0x4
enum class EInteractionLegality : int32_t
{
	EIL_Legal = 0,
	EIL_Illegal = 1,
};

// Size: 0x4
enum class EInteractionPromptDataKnt_BlockedStatus : int32_t
{
	None = 0,
	Blocked = 1,
	CanBeUnblocked = 2,
};

// Size: 0x4
enum class EInventorySlotType : int32_t
{
	ThrowableItem = 0,
	FirearmOneHanded = 1,
	FirearmTwoHanded = 2,
	ServicePistol = 3,
	SpecialWeapon = 4,
	GadgetA = 5,
	GadgetB = 6,
	GadgetC = 7,
	GadgetD = 8,
	GadgetE = 9,
	Empty = 10,
};

// Size: 0x4
enum class EIoiSignupError : int32_t
{
	None = 0,
	InvalidEmail = 1,
	EmailAlreadyRegistered = 2,
	ServiceUnavailable = 3,
	InternalError = 4,
	UnknownError = 5,
};

// Size: 0x4
enum class EIsHumanoidInGroup : int32_t
{
	Confrontation = 0,
	Combat = 1,
	Manhunt = 2,
};

// Size: 0x4
enum class EItemAttachmentSlot : int32_t
{
	None = -1,
	RightHand = 0,
	LeftHand = 1,
	Back = 2,
	Head = 3,
	Neck = 4,
	RightWrist = 5,
	LeftWrist = 6,
	Chest = 7,
};

// Size: 0x4
enum class EItemPickupAnimationStyle : int32_t
{
	Default = 0,
	PickupFromGroundWhileStanding = 1,
};

// Size: 0x4
enum class EItemType : int32_t
{
	NoItem = 0,
	HandGun = 1,
	Taser = 2,
	DartGun = 3,
	SubMachineGun = 4,
	AssaultRifle = 5,
	Shotgun = 6,
	SmokePellets = 7,
	BlastDevice = 8,
	Brick = 9,
	Vase = 10,
	Bust = 11,
	Undefined = 12,
	LongRifle = 13,
	Cosmetic = 14,
};

// Size: 0x4
enum class EKeyPress : int32_t
{
	eKP_Hold = 0,
	eKP_JustPressed = 1,
	eKP_Released = 2,
	eKP_JustReleased = 3,
	eKP_PressAndHold = 4,
};

// Size: 0x4
enum class EKeywordEvaluationType : int32_t
{
	eKET_ALL = 0,
	eKET_NONE = 1,
	eKET_ANY = 2,
	eKET_ANY_TRUE_IF_NO_REQS = 3,
	eKET_COUNT_EQUAL = 4,
	eKET_COUNT_GREATER = 5,
	eKET_COUNT_LESS = 6,
};

// Size: 0x1
enum class EKnightFootState : int8_t
{
	eKFS_Planted = 0,
	eKFS_Airborne = 1,
};

// Size: 0x1
enum class EKnightGameMode : int8_t
{
	eKGM_TacticalEspionage = 0,
	eKGM_SocialEspionage = 1,
	eKGM_SoftTacticalEspionage = 2,
};

// Size: 0x1
enum class EKnightSocialContext : int8_t
{
	Default = 0,
	Gala = 1,
};

// Size: 0x4
enum class EKntCheckpointStateType : int32_t
{
	Inactive = 0,
	Active = 1,
	WaitingPlayerSpawn = 2,
	Ready = 3,
};

// Size: 0x4
enum class EKntCheckpointType : int32_t
{
	None = 0,
	Session = 1,
	Permanent = 2,
};

// Size: 0x1
enum class EKntIntelType : int8_t
{
	Hint = 0,
	Item = 1,
};

// Size: 0x4
enum class EKntIoiAccountLinkState : int32_t
{
	Missing = 0,
	Unconfirmed = 1,
	Confirmed = 2,
};

// Size: 0x4
enum class EKntMissionType : int32_t
{
	Operation = 0,
	Escalation = 1,
	Campaign = 2,
	Hub = 3,
};

// Size: 0x1
enum class EKntObjectiveState : int8_t
{
	Inactive = 0,
	Available = 1,
	Active = 2,
	Failed = 3,
	Completed = 4,
};

// Size: 0x4
enum class EKntObjectiveType : int32_t
{
	Individual = 0,
	Composite = 1,
	SubObjective = 2,
};

// Size: 0x1
enum class EKntOpportunityState : int8_t
{
	Inactive = 0,
	Unrevealed = 1,
	Revealed = 2,
	Failed = 3,
	Completed = 4,
};

// Size: 0x1
enum class EKntOpportunityStepState : int8_t
{
	Inactive = 0,
	Unrevealed = 1,
	Revealed = 2,
	Failed = 3,
	Completed = 4,
};

// Size: 0x4
enum class EKntPersistentDataStateType : int32_t
{
	Inactive = 0,
	Saved = 1,
};

// Size: 0x4
enum class EKntSessionStopReason : int32_t
{
	Success = 0,
	Unknown = 1,
};

// Size: 0x4
enum class EKntUgcObjectiveType : int32_t
{
	Kill = 0,
	Hack = 1,
};

// Size: 0x4
enum class ELayoutAlign : int32_t
{
	Stretch = 0,
	FlexStart = 1,
	Center = 2,
	FlexEnd = 3,
	Baseline = 4,
	SpaceBetween = 5,
	SpaceAround = 6,
	Auto = 7,
};

// Size: 0x4
enum class ELayoutDisplay : int32_t
{
	Default = 0,
	None = 1,
	Flex = 2,
};

// Size: 0x4
enum class ELayoutFlexDirection : int32_t
{
	Column = 0,
	ColumnReverse = 1,
	Row = 2,
	RowReverse = 3,
};

// Size: 0x4
enum class ELayoutFlexWrap : int32_t
{
	NoWrap = 0,
	Wrap = 1,
	WrapReverse = 2,
};

// Size: 0x4
enum class ELayoutJustify : int32_t
{
	FlexStart = 0,
	Center = 1,
	FlexEnd = 2,
	SpaceBetween = 3,
	SpaceAround = 4,
	SpaceEvenly = 5,
};

// Size: 0x4
enum class ELayoutPositionType : int32_t
{
	Relative = 0,
	Absolute = 1,
};

// Size: 0x4
enum class ELocale : int32_t
{
	Locale_En = 0,
	Locale_Fr = 1,
	Locale_It = 2,
	Locale_De = 3,
	Locale_Es = 4,
	Locale_Ru = 5,
	Locale_Mx = 6,
	Locale_Br = 7,
	Locale_Pl = 8,
	Locale_Cn = 9,
	Locale_Jp = 10,
	Locale_Tc = 11,
	Locale_Ko = 12,
	Locale_Tr = 13,
	Locale_Placeholder = 14,
};

// Size: 0x4
enum class EMapType : int32_t
{
	E_MAPTYPE_Minimap = 0,
	E_MAPTYPE_MainMap = 1,
	E_MAPTYPE_MenuMap = 2,
};

// Size: 0x4
enum class EMarkerClipAlgorithm : int32_t
{
	MCA_NONE = 0,
	MCA_SIMPLE = 1,
	MCA_ADVANCED = 2,
};

// Size: 0x4
enum class EMarkerInclusionMode : int32_t
{
	MIM_DEFAULT = 0,
	MIM_IF_FORCE_INCLUDED_ONLY = 1,
};

// Size: 0x1
enum class EMarketingCameraScheme : int8_t
{
	ToggleMarketingCamera = 0,
	PedestalDown = 1,
	PedestalUp = 2,
	MoveX = 3,
	MoveY = 4,
	SwitchMovementMode = 5,
	RotateX = 6,
	RotateY = 7,
	DecreaseSetting = 8,
	IncreaseSetting = 9,
	RollModifier = 10,
	RollSpeedModifier = 11,
	RollReset = 12,
	FOVModifier = 13,
	PedestalSensitivityModifier = 14,
	IncreaseMoveSensitivity = 15,
	DecreaseMoveSensitivity = 16,
	IncreaseRotateSensitivity = 17,
	DecreaseRotateSensitivity = 18,
	Count = 19,
};

// Size: 0x4
enum class EMassImpulseType : int32_t
{
	eMIT_None = 0,
	eMIT_Explosion = 1,
	eMIT_ShockWave = 2,
	eMIT_ShockWaveNoExplosion = 3,
};

// Size: 0x1
enum class EMaterialRegistrationState : int8_t
{
	eMRS_None = 0,
	eMRS_Pending = 1,
	eMRS_Success = 2,
	eMRS_Failed = 3,
};

// Size: 0x4
enum class EMenuElementCustomHudContainerHorizontalAlignment : int32_t
{
	Auto = 0,
	Left = 1,
	Right = 2,
};

// Size: 0x4
enum class EMenuElementCustomHudContainerVerticalAlignment : int32_t
{
	Auto = 0,
	Above = 1,
	Below = 2,
};

// Size: 0x4
enum class EMenuElementFindElementMode : int32_t
{
	OnlyActive = 0,
	All = 1,
};

// Size: 0x4
enum class EMenuElementWheelAlign : int32_t
{
	center = 0,
	outside = 1,
};

// Size: 0x1
enum class EMenuMouseMode : int8_t
{
	uninitialized = 0,
	disabled = 1,
	onover_select_onup_click = 2,
	onover_hover_onup_select = 3,
	onover_hover_onup_selectclick = 4,
};

// Size: 0x4
enum class EMotionType : int32_t
{
	MOTION_LOCKED = 0,
	MOTION_LIMITED = 1,
	MOTION_FREE = 2,
};

// Size: 0x4
enum class ENamedGameEvents : int32_t
{
	eSetModePlaying = 0,
	eEditorSyncDone = 1,
	eNumNamedGameEvents = 2,
};

// Size: 0x1
enum class ENetRole : int8_t
{
	None = 0,
	Server = 1,
	Client = 2,
};

// Size: 0x4
enum class ENpcHearingFootstepNoiseLevel : int32_t
{
	Quiet = 0,
	Medium = 1,
	Loud = 2,
};

// Size: 0x4
enum class ENpcHearingFootstepSuspicionLevel : int32_t
{
	BarelySuspicious = 0,
	HighlySuspicious = 1,
};

// Size: 0x1
enum class ENpcInterestInLocation : int8_t
{
	RestWhenDisoriented = 0,
	CivilianEscapeWay = 1,
	KickNearbySabotagedDoor = 2,
	SoftTrespassingExit = 3,
	PositionalContextAction = 4,
};

// Size: 0x4
enum class EObjectCollisionAttribute : int32_t
{
	eOCA_Transparent = 0,
	eOCA_IgnoredByCamera = 1,
	eOCA_KinematicContactNotification = 2,
	eOCA_SimulationFilterCallback = 3,
	eOCA_Destructible = 4,
	eOCA_StairsSlope = 5,
	eOCA_Player = 6,
	eOCA_OnlyBlockPlayer = 7,
	eOCA_Marker = 8,
	eOCA_IgnoreMarker = 9,
	eOCA_KinematicCharacterCapsule = 10,
	eOCA_AudioTransparent = 11,
	eOCA_ExcludedFromPhysicsTrigger = 12,
	eOCA_IgnoredByAgility = 13,
	eOCA_IgnoredByVehicleWheels = 14,
	eOCA_InvisibleWall = 15,
};

// Size: 0x4
enum class EObjectCollisionChannel : int32_t
{
	eOCC_Static = 0,
	eOCC_Dynamic = 1,
	eOCC_Character = 2,
	eOCC_GameObject = 3,
	eOCC_Vehicle = 4,
	eOCC_Weapon = 5,
	eOCC_Item = 6,
	eOCC_Projectile = 7,
	eOCC_Interaction = 8,
	eOCC_Camera = 9,
	eOCC_Structure = 10,
	eOCC_Cosmetic = 11,
	eOCC_Vision = 13,
	eOCC_Vision_LowAttention = 14,
	eOCC_BlastField = 15,
};

// Size: 0x4
enum class EOnlinTest : int32_t
{
	eHELLO = 0,
	eWORLD = 1,
};

// Size: 0x4
enum class EPFObstacleBehavior : int32_t
{
	ePFOB_Legacy = 0,
	ePFOB_Penalty = 1,
	ePFOB_Impassible = 2,
	ePFOB_ImpassibleOrPenalty = 3,
};

// Size: 0x4
enum class EPackage : int32_t
{
	Invalid = 0,
	Base = 1,
	Standard = 2,
	GadgetGleamingEarphones = 3,
	GadgetGleamingLighter = 4,
	GadgetGleamingPen = 5,
	GadgetGleamingPhone = 6,
	GadgetSkinRazer = 7,
	GadgetSkinAlienware = 8,
	CostumeDayOfTheDead = 9,
	CostumeDesertExplorer = 10,
	CostumeSilentAnchor = 11,
	CostumeGentlemanOperator = 12,
	CostumeObsidianSuit = 13,
	CostumeClassicTuxedo = 14,
	CostumeFirstClass = 15,
	CostumeForestOperator = 16,
	CostumeObservantSpy = 17,
	CostumeLeisureBeam = 18,
	CostumeOneMore = 19,
	CostumeCasinoSuit = 20,
	CostumeDiamondintheRough = 21,
	WeaponAgentsMark = 22,
	WeaponGoldenGun = 23,
	COUNT = 24,
};

// Size: 0x1
enum class EParticipantsState : int8_t
{
	ParticipantsPresent = 0,
	CastingParticipants = 1,
	ParticipantsMissing = 2,
	DoNotRefresh = 3,
};

// Size: 0x1
enum class EParticleColorUsage : int8_t
{
	REPLACE_PARTICLE_COLOR = 0,
	LEAVE_PARTICLE_COLOR = 1,
};

// Size: 0x4
enum class EParticleDecalSpawnEntity_Constraints : int32_t
{
	FACTOR_AND_RANDOMIZE = 0,
	SIZE_RANGE = 1,
};

// Size: 0x4
enum class EParticleModifierImpulseDirections : int32_t
{
	TARGET_ZAXIS_DIRECTION = 0,
	TOWARDS_TARGET_PIVOT = 1,
	AWAY_FROM_TARGET_PIVOT = 2,
};

// Size: 0x1
enum class EParticleSourceMeshSpawnMode : int8_t
{
	PARTICLE_MESH_SPAWNMODE_VERTEX = 0,
	PARTICLE_MESH_SPAWNMODE_TRIANGLE = 1,
};

// Size: 0x1
enum class EParticleSourceVolumeSpawnDir : int8_t
{
	PARTICLE_SPAWNDIR_ZAXIS = 0,
	PARTICLE_SPAWNDIR_FROM_CENTER = 1,
	PARTICLE_SPAWNDIR_SURFACE_NORMAL = 2,
};

// Size: 0x1
enum class EParticleSourceVolumeSpawnMode : int8_t
{
	PARTICLE_SPAWNMODE_BOX_INSIDE = 0,
	PARTICLE_SPAWNMODE_BOX_SURFACE = 1,
	PARTICLE_SPAWNMODE_ELLIPSOID_INSIDE = 2,
	PARTICLE_SPAWNMODE_ELLIPSOID_SURFACE = 3,
};

// Size: 0x1
enum class EParticleSpritePivotLocation : int8_t
{
	CENTER_PIVOT = 0,
	BOTTOM_PIVOT = 1,
	TOP_PIVOT = 2,
};

// Size: 0x1
enum class EParticleSystemType : int8_t
{
	PST_Particles = 0,
	PST_FluidCollision = 1,
	PST_FluidVortex = 2,
	PST_FluidDensity = 3,
};

// Size: 0x1
enum class EParticleSystemVolumeType : int8_t
{
	PARTICLESYSTEM_VOLUME_TYPE_BOX = 0,
	PARTICLESYSTEM_VOLUME_TYPE_SPHERE = 1,
	PARTICLESYSTEM_VOLUME_TYPE_HEMISPHERE = 2,
	PARTICLESYSTEM_VOLUME_TYPE_PLANE = 3,
};

// Size: 0x4
enum class EPathFinderBoxType : int32_t
{
	PFBT_INCLUDE_MESH_COLLISION = 0,
	PFBT_EXCLUDE_MESH_COLLISION = 1,
	PFBT_CREATE_MESH_COLLISION = 2,
	PFBT_REGION = 3,
	PFBT_INCLUDE_PORTALS = 4,
	PFBT_EXCLUDE_PORTALS = 5,
	PFBT_IGNORE = 6,
	PFBT_REGION_WITH_EROSION = 7,
	PFBT_EXCLUDE_PORTALS_WITH_EROSION = 8,
	PFBT_INCLUDE_LINKS = 9,
	PFBT_EXCLUDE_LINKS = 10,
};

// Size: 0x4
enum class EPerceptionSensitivityModifier : int32_t
{
	None = 0,
	Low = 1,
	Normal = 2,
	High = 3,
};

// Size: 0x4
enum class EPhysicsObjectType : int32_t
{
	EPHYSICSOBJECTTYPE_UNKNOWN = 0,
	EPHYSICSOBJECTTYPE_DYNAMIC = 1,
	EPHYSICSOBJECTTYPE_KINEMATIC = 2,
	EPHYSICSOBJECTTYPE_STATIC = 3,
};

// Size: 0x4
enum class EPlayMode : int32_t
{
	PLAYMODE_STOPPED = 1,
	PLAYMODE_PAUSED = 2,
	PLAYMODE_PLAYING = 3,
};

// Size: 0x4
enum class EPlayerLocomotionStateWhenProducingFootsteps : int32_t
{
	ConfidentSlow = 0,
	ConfidentFast = 1,
	VigilantSlow = 2,
	VigilantFast = 3,
	Accelerating = 4,
};

// Size: 0x4
enum class EPositionToScanType : int32_t
{
	ePTST_InheritWaitTimeFromRoutine = 0,
	ePTST_SpecifyWaitTime = 1,
};

// Size: 0x4
enum class EProjectileDrawingFilter : int32_t
{
	ePDF_OnlySelectedEmitters = 0,
	ePDF_AllProjectiles = 1,
};

// Size: 0x1
enum class ERagdollPart : int8_t
{
	ERAGDOLLPART_NONE = 0,
	ERAGDOLLPART_BODY = 1,
	ERAGDOLLPART_HEAD = 2,
	ERAGDOLLPART_HAND = 3,
	ERAGDOLLPART_FOOT = 4,
};

// Size: 0x1
enum class ERayDetailLevel : int8_t
{
	RAYDETAILS_NONE = 0,
	RAYDETAILS_BONES = 1,
	RAYDETAILS_MESH = 2,
};

// Size: 0x4
enum class ERayTraceQueryTypeMultiHit : int32_t
{
	eRQT_OVERLAPS_AND_FIRST_BLOCK = 0,
	eRQT_ALL_BLOCKS = 1,
};

// Size: 0x4
enum class ERayType : int32_t
{
	ERAY_CLOSESTHIT_SIMPLE = 0,
	ERAY_CLOSESTHIT_DETAILED = 1,
};

// Size: 0x4
enum class ERegionId : int32_t
{
	RegionId_Default = 0,
	RegionId_Japan = 1,
	RegionId_Asia = 2,
};

// Size: 0x4
enum class ERegionMask : int32_t
{
	eRM_None = 1,
	eRM_LowCover = 2,
	eRM_HighCover = 4,
	eRM_Stairs = 8,
	eRM_Separator = 16,
	eRM_StaticObstacle = 32,
	eRM_StaticObstacle1 = 64,
	eRM_StaticObstacle2 = 128,
	eRM_StaticObstacle3 = 256,
	eRM_StaticObstacle4 = 512,
	eRM_Destructible1 = 1024,
	eRM_Destructible2 = 2048,
	eRM_Destructible3 = 4096,
	eRM_Destructible4 = 8192,
	eRM_StaticPenaltyAddend1 = 268435456,
	eRM_StaticPenaltyAddend2 = 536870912,
	eRM_StaticPenaltyAddend3 = 1073741824,
	eRM_StaticPenaltyAddend4 = -2147483648,
};

// Size: 0x4
enum class ERegistrationState : int32_t
{
	eINITIAL = 0,
	eNOP = 1,
	eAWAITINGTICKET = 2,
	ePENDING = 3,
	eCANCELLED_REMOTELY = 4,
	eCANCELLED_LOCALLY = 5,
	eFOUNDMATCH = 6,
	eGRABBING = 7,
};

// Size: 0x4
enum class ERenderVRTrackingID : int32_t
{
	RENDER_VR_TRACK_HEAD = 16,
	RENDER_VR_TRACK_EYE_LEFT = 17,
	RENDER_VR_TRACK_EYE_RIGHT = 18,
	RENDER_VR_TRACK_HAND_LEFT = 19,
	RENDER_VR_TRACK_HAND_RIGHT = 20,
};

// Size: 0x1
enum class EReplicatedDestructibleInteractionType : int8_t
{
	eRDIT_REPLICATED_PIECE_FRACTURE = 0,
	eRDIT_REPLICATED_PIECE_DETACHMENT = 1,
	eRDIT_REPLICATED_PIECE_DESTRUCTION = 2,
	eRDIT_COUNT = 3,
};

// Size: 0x4
enum class ERequestState : int32_t
{
	eMM_ERROR = 0,
	eMM_IDLE = 1,
	eMM_DEREGISTER = 2,
	eMM_INVITED = 3,
	eMM_JOININGTICKET = 4,
	eMM_START = 5,
	eMM_CREATED = 6,
	eMM_REGISTERED = 7,
	eMM_POLLING = 8,
	eMM_WAITING = 9,
	eMM_FOUNDMATCH = 10,
	eMM_GATHERING_INFO = 11,
	eMM_RESOLVING_INFO = 12,
	eMM_WAITING_FOR_SERVER = 13,
	eMM_GOT_SERVER = 14,
	eMM_COMPLETE = 15,
};

// Size: 0x4
enum class ERequirementId : int32_t
{
	EREQUIREMENT_INVALID = 0,
	EREQUIREMENT_TOKEN_OUTFIT_LEGACY_HERO_REQUIEMSUIT = 1,
	EREQUIREMENT_FIREARMS_HERO_PISTOL_TACTICAL_015_SU_SKIN05 = 2,
	EREQUIREMENT_PROP_DEVICE_SONYPREORDER_WHITE_RUBBERDUCK_REMOTE_EXPLOSIVE = 3,
	EREQUIREMENT_GOTY_PATIENT_ZERO = 4,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_PARIS_CLOWN = 5,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_HOKKAIDO_COWBOY = 6,
	EREQUIREMENT_GOTY_TOKEN_OUTFIT_MARRAKESH_DARK_SNIPER = 7,
	EREQUIREMENT_ANNIVERSARY_OUTFITS = 8,
	EREQUIREMENT_LOCATION_NEWZEALAND = 9,
	EREQUIREMENT_S2_EXECUTIVE_PACK = 10,
	EREQUIREMENT_S2_COLLECTORS_PACK = 11,
	EREQUIREMENT_S2_EXPANSION_VANITY_ITEM1 = 12,
	EREQUIREMENT_S2_EXPANSION_VANITY_ITEM2 = 13,
	EREQUIREMENT_PROP_CONTAINER_SUITCASE_ICA_STA_STADIA = 14,
	EREQUIREMENT_PROP_DEVICE_ICA_RUBBERDUCK_REMOTE_EXPLOSIVE_STA_STADIA = 15,
	EREQUIREMENT_H1_LEGACY_STANDARD = 16,
	EREQUIREMENT_H1_LEGACY_EXPANSION = 17,
	EREQUIREMENT_H2_LEGACY_STANDARD = 18,
	EREQUIREMENT_H2_LEGACY_EXPANSION = 19,
	EREQUIREMENT_H3_EXPANSION = 20,
	EREQUIREMENT_LOCATION_GOLDEN = 21,
	EREQUIREMENT_LOCATION_ANCESTRAL = 22,
	EREQUIREMENT_LOCATION_EDGY = 23,
	EREQUIREMENT_LOCATION_WET = 24,
	EREQUIREMENT_LOCATION_ELEGANT = 25,
	EREQUIREMENT_LOCATION_TRAPPED = 26,
	EREQUIREMENT_PLATFORM_ORBIS = 27,
	EREQUIREMENT_PLATFORM_PS5 = 28,
	EREQUIREMENT_PLATFORM_GDK = 29,
	EREQUIREMENT_PLATFORM_EPIC = 30,
	EREQUIREMENT_PLATFORM_STEAM = 31,
	EREQUIREMENT_PLATFORM_GGP = 32,
	EREQUIREMENT_H3_PREORDER = 33,
	EREQUIREMENT_PLATFORM_IZUMO = 34,
	EREQUIREMENT_H3_DEADLYSINS_GREED = 35,
	EREQUIREMENT_H3_DEADLYSINS_PRIDE = 36,
	EREQUIREMENT_H3_DEADLYSINS_SLOTH = 37,
	EREQUIREMENT_H3_DEADLYSINS_LUST = 38,
	EREQUIREMENT_H3_DEADLYSINS_GLUTTONY = 39,
	EREQUIREMENT_H3_DEADLYSINS_WRATH = 40,
	EREQUIREMENT_H3_DEADLYSINS_ENVY = 41,
};

// Size: 0x1
enum class ERestitutionCombineMode : int8_t
{
	ERestitutionCombineMode_AVERAGE = 0,
	ERestitutionCombineMode_MIN = 1,
	ERestitutionCombineMode_MULTIPLY = 2,
	ERestitutionCombineMode_MAX = 3,
};

// Size: 0x4
enum class ERotationOrder : int32_t
{
	XYZ = 0,
	XZY = 1,
	YXZ = 2,
	YZX = 3,
	ZXY = 4,
	ZYX = 5,
};

// Size: 0x4
enum class ERuntimeMemoryAllocationState : int32_t
{
	eRMAS_NeverAllocated = 0,
	eRMAS_Allocated = 1,
	eRMAS_Released = 2,
};

// Size: 0x4
enum class ERuntimePlatform : int32_t
{
	RP_NONE = 0,
	RP_PC = 1,
	RP_PS5 = 2,
	RP_SCARLETT = 3,
	RP_OUNCE = 4,
};

// Size: 0x4
enum class ESaveLoadStatus : int32_t
{
	ESaveLoadStatus_OK = 0,
	ESaveLoadStatus_PROCESSING = 1,
	ESaveLoadStatus_MISSING = 2,
	ESaveLoadStatus_ERROR_NODISKSPACE = 3,
	ESaveLoadStatus_ERROR_DEVICEREMOVED = 4,
	ESaveLoadStatus_ERROR_CORRUPT = 5,
	ESaveLoadStatus_ERROR_VERSION = 6,
	ESaveLoadStatus_ERROR_TAMPERED = 7,
	ESaveLoadStatus_ERROR_SAVING = 8,
	ESaveLoadStatus_ERROR_FATAL = 9,
	ESaveLoadStatus_ERROR_ONLINE = 10,
	ESaveLoadStatus_ERROR_REQUIREMENTCHECK = 11,
	ESaveLoadStatus_ERROR_VRMODE = 12,
	ESaveLoadStatus_ERROR_INVALIDATED = 13,
};

// Size: 0x4
enum class ESaveType : int32_t
{
	ESaveType_AutoSave = 0,
	ESaveType_QuickSave = 1,
	ESaveType_SystemData = 2,
	ESaveType_LocalProfile = 3,
};

// Size: 0x4
enum class EScanSurroundingsType : int32_t
{
	eSST_SpecifyTotalWaitTime = 0,
	eSST_SpecifyDefaultWaitTimePerPoint = 1,
};

// Size: 0x4
enum class ESceneLoadingStage : int32_t
{
	eLoading_Start = 0,
	eLoading_SceneStopped = 1,
	eLoading_SceneDeleted = 2,
	eLoading_AssetsLoaded = 3,
	eLoading_SceneAllocated = 4,
	eLoading_SceneStarted = 5,
	eLoading_ScenePrecaching = 6,
	eLoading_SceneActivated = 7,
	eLoading_SceneStreaming = 8,
	eLoading_ScenePlaying = 9,
	eLoading_MAX = 10,
};

// Size: 0x1
enum class EScheme_DebugCamera : int8_t
{
	ES_MoveX = 0,
	ES_MoveY = 1,
	ES_LookJoystickX = 2,
	ES_LookJoystickY = 3,
	ES_LookMouseX = 4,
	ES_LookMouseY = 5,
	ES_OpenDebugCamera = 6,
	ES_CloseDebugCamera = 7,
	ES_SlowMovementModifier = 8,
	ES_FastMovementModifier = 9,
	ES_VerticalMovementModifier = 10,
	ES_SlowRotateModifier = 11,
	ES_TeleportToLookAtPosition = 12,
	ES_TeleportToNextPOI = 13,
	ES_TeleportToPreviousPOI = 14,
	ES_ToggleControlWindow = 15,
	ES_SelectEntity = 16,
	ES_TogglePause = 17,
	ES_Max = 18,
};

// Size: 0x4
enum class EScheme_GameUI : int32_t
{
	OpenJournal = 1001,
	TrackObjective = 1002,
	OpenNotification = 1003,
	SkipCinematic = 1004,
	InspectItemZoom = 1005,
	ItemRotateLeft = 1006,
	ItemRotateRight = 1007,
};

// Size: 0x4
enum class EScheme_Humanoid : int32_t
{
	ES_MoveLeft = 0,
	ES_MoveRight = 1,
	ES_MoveForward = 2,
	ES_MoveBackward = 3,
	ES_LookJoystickLeft = 4,
	ES_LookJoystickRight = 5,
	ES_LookJoystickUp = 6,
	ES_LookJoystickDown = 7,
	ES_LookMouseLeft = 8,
	ES_LookMouseRight = 9,
	ES_LookMouseUp = 10,
	ES_LookMouseDown = 11,
	ES_Accelerate = 12,
	ES_Crouch = 13,
	ES_VehicleMount = 14,
	ES_InteractHold = 15,
	ES_InteractTap = 16,
	ES_QuickMeleeAttack = 17,
	ES_ChargedMeleeAttack = 18,
	ES_CloseCombat_Sidestep = 19,
	ES_Grab = 20,
	ES_Parry = 21,
	ES_Shoot = 22,
	ES_Reload = 23,
	ES_SelectNextFirearm = 24,
	ES_Aim = 25,
	ES_SwapShoulder = 26,
	ES_GadgetView = 27,
	ES_GadgetQuickActivation = 28,
	ES_Agency = 29,
	ES_Bluff = 30,
	ES_BluffHold = 31,
	ES_Lure = 32,
	ES_Gadget1 = 33,
	ES_Gadget2 = 34,
	ES_Gadget3 = 35,
	ES_Gadget4 = 36,
	ES_NextGadget = 37,
	ES_PreviousGadget = 38,
	ES_SelectHintedGadget = 39,
	ES_GadgetWheelMenu = 40,
	ES_ActivateGadget = 41,
	ES_Agility = 42,
	ES_AgilityDescend = 43,
	ES_CloseCombat_Finisher = 44,
	ES_Dash = 45,
	ES_CombatRushView = 46,
	ES_CombatRushAttack = 47,
	ES_FakeSurrender = 48,
	ES_Pickpocket = 49,
	ES_ThrowAimed = 50,
	ES_ThrowUnaimed = 51,
	ES_ThrowQuick = 52,
	ES_TurnAtCoverCorner = 53,
	ES_Stance = 54,
	ES_CoverSwap = 55,
	ES_CoverEnterExit = 56,
	ES_DisengageCloseCombat = 57,
	ES_DecisionPrompt1 = 58,
	ES_DecisionPrompt2 = 59,
	ES_DecisionPrompt3 = 60,
	ES_DecisionPrompt4 = 61,
	ES_DoorUse = 62,
	ES_DoorKick = 63,
	ES_DoorSabotage = 64,
	ES_ActivateHintTarget = 65,
	ES_GrabRush = 66,
	ES_CameraFocus = 67,
	ES_SilentTakedown = 68,
	ES_SelectSpecialFirearm = 69,
	ES_CombatRushGrab = 70,
	ES_GrabThrow = 71,
	ES_SpecialFirearmAbility = 72,
};

// Size: 0x1
enum class EScheme_KntDebugMenu : int8_t
{
	ES_OpenCloseModifier = 0,
	ES_OpenClose = 1,
	ES_Confirm = 2,
	ES_Back = 3,
	ES_Down = 4,
	ES_Up = 5,
	ES_ToggleControls = 6,
	ES_ChangeScale = 7,
	ES_FlipOrder = 8,
	ES_Increment = 9,
	ES_Decrement = 10,
	ES_Favorite = 11,
	ES_Confluence = 12,
	ES_NextPage = 13,
	ES_PreviousPage = 14,
	ES_Count = 15,
};

// Size: 0x4
enum class EScheme_UI : int32_t
{
	Accept = 1,
	Cancel = 2,
	ActionX = 3,
	ActionY = 4,
	LeftStick = 5,
	RightStick = 6,
	NavigateUp = 7,
	NavigateDown = 8,
	NavigateLeft = 9,
	NavigateRight = 10,
	PagePrev = 11,
	PageNext = 12,
	SubPagePrev = 13,
	SubPageNext = 14,
	ScrollUp = 15,
	ScrollDown = 16,
	ScrollLeft = 17,
	ScrollRight = 18,
	MouseScrollPositive = 19,
	MouseScrollNegative = 20,
	PauseScreen = 21,
	ColorPickerHueIncrease = 22,
	ColorPickerHueDecrease = 23,
	ColorPickerSaturationIncrease = 24,
	ColorPickerSaturationDecrease = 25,
	ColorPickerLightnessIncrease = 26,
	ColorPickerLightnessDecrease = 27,
	TextToSpeechStateToggle = 28,
	TextToSpeechPreviousItem = 29,
	TextToSpeechNextItem = 30,
};

// Size: 0x4
enum class EScheme_Vehicle_Driving : int32_t
{
	ES_TurnLeft = 0,
	ES_TurnRight = 1,
	ES_VehicleCamLeft = 2,
	ES_VehicleCamRight = 3,
	ES_VehicleCamUp = 4,
	ES_VehicleCamDown = 5,
	ES_VehicleCamMouseLeft = 6,
	ES_VehicleCamMouseRight = 7,
	ES_VehicleCamMouseUp = 8,
	ES_VehicleCamMouseDown = 9,
	ES_VehicleCamReset = 10,
	ES_VehicleCamLookBehind = 11,
	ES_VehicleAccelerate = 12,
	ES_Brake = 13,
	ES_Flip = 14,
	ES_Handbrake = 15,
	ES_VehicleDecisionPrompt1 = 16,
	ES_VehicleDecisionPrompt2 = 17,
	ES_VehicleDecisionPrompt3 = 18,
	ES_VehicleDecisionPrompt4 = 19,
	ES_VehicleInteractHold = 20,
	ES_VehicleInteractTap = 21,
	ES_VehicleFireWeapon1 = 22,
	ES_VehicleFireWeapon2 = 23,
};

// Size: 0x1
enum class EScreenGIRayBudget : int8_t
{
	ESCREENGIRAYBUDGET_LOW = 0,
	ESCREENGIRAYBUDGET_MEDIUM = 1,
	ESCREENGIRAYBUDGET_HIGH = 2,
	ESCREENGIRAYBUDGET_ULTRA = 3,
};

// Size: 0x1
enum class ESeamFixMode : int8_t
{
	SEAMFIX_NONE = 0,
	SEAMFIX_X = 1,
	SEAMFIX_Y = 2,
	SEAMFIX_Z = 4,
	SEAMFIX_XZ = 5,
	SEAMFIX_XY = 3,
	SEAMFIX_XYZ = 7,
	SEAMFIX_YZ = 6,
};

// Size: 0x4
enum class ESendEventMode : int32_t
{
	LOCAL = 0,
	CLIENT_TO_SERVER = 1,
	SERVER_BROADCAST = 2,
	BOTH_WAYS = 3,
};

// Size: 0x4
enum class ESequenceAnimationBlendProfile : int32_t
{
	Linear = 0,
	Sine = 1,
};

// Size: 0x4
enum class ESequenceAnimationNetworkParameterType : int32_t
{
	Int = 0,
	Float = 1,
	Bool = 2,
};

// Size: 0x4
enum class ESequenceAnimationTrajectorySpace : int32_t
{
	Absolute = 0,
	Relative = 1,
};

// Size: 0x4
enum class ESequencePreviewState : int32_t
{
	PREVIEW_STOPPED = 0,
	PREVIEW_PLAYING = 1,
	PREVIEW_PAUSED = 2,
};

// Size: 0x1
enum class ESmolderDynamicVolumeSpawnMapMode : int8_t
{
	REPEAT = 0,
	BORDER = 1,
};

// Size: 0x1
enum class ESmolderVolumePlaybackMode : int8_t
{
	STATIC_FRAME = 0,
	LOOP = 1,
};

// Size: 0x4
enum class ESoundCollisionObjectType : int32_t
{
	StaticRigidBody = 0,
	DynamicRigidBody = 1,
	Ragdoll = 2,
};

// Size: 0x4
enum class ESoundCollisionType : int32_t
{
	Impact = 0,
	Rolling = 1,
	Sliding = 2,
};

// Size: 0x4
enum class ESoundGateType : int32_t
{
	SOUNDGATE_TYPE_ROUND = 0,
	SOUNDGATE_TYPE_SHARPCORNERS = 1,
};

// Size: 0x4
enum class ESoundVolumetricShape : int32_t
{
	SCT_Box = 0,
	SCT_Cylinder = 1,
	SCT_Sphere = 2,
	SCT_Volume = 3,
};

// Size: 0x1
enum class ESourceGridIdType : int8_t
{
	SGIT_EntireSpan = 0,
	SGIT_Center = 1,
	SGIT_LowerLeft = 2,
};

// Size: 0x4
enum class ESpeed : int32_t
{
	eSpeed_Idle = 0,
	eSpeed_Slow = 1,
	eSpeed_Normal = 2,
	eSpeed_Fast = 3,
	eSpeed_Sprint = 4,
};

// Size: 0x4
enum class ESplineTangentMode : int32_t
{
	Linked = 0,
	Unlinked = 1,
	Auto = 2,
};

// Size: 0x1
enum class EStorylineFeature : int8_t
{
	IgnoreCombatEscalation = 0,
	IgnoreDistractions = 1,
	IgnoreEscalationIfReceivingGunshot = 2,
	IgnoreDeadBodies = 3,
	IgnorePrivateSpace = 4,
	IgnoreEscalationIfReceivingMeleeAttack = 5,
	StayInPlacePrivateSpaceReactions = 6,
};

// Size: 0x1
enum class EStorylineFilterGroup : int8_t
{
	Critical = 0,
	Important = 1,
	Unimportant = 2,
	None = 3,
};

// Size: 0x1
enum class EStorylineLayer : int8_t
{
	None = 0,
	LowerBody = 1,
	UpperBody = 2,
	FullBody = 3,
	Dialogue = 4,
};

// Size: 0x1
enum class EStorylinePauseTimeoutType : int8_t
{
	None = 0,
	Stop = 1,
	Complete = 2,
};

// Size: 0x1
enum class EStorylineRoutineNewState : int8_t
{
	Stopped = 0,
	Preparing = 1,
	Moving = 2,
	Entering = 3,
	Playing = 4,
	Leaving = 5,
};

// Size: 0x1
enum class EStorylineSystemRoutineState : int8_t
{
	eSSRS_Inactive = 0,
	eSSRS_Paused = 1,
	eSSRS_Pending = 2,
	eSSRS_Active = 3,
	eSSRS_Complete = 4,
};

// Size: 0x1
enum class EStorylineSystemState : int8_t
{
	Stopped = 0,
	Playing = 1,
	Paused = 2,
	Resuming = 3,
	Stopping = 4,
	Completed = 5,
	CompletedAndOnCooldown = 6,
};

// Size: 0x1
enum class EStorylineType : int8_t
{
	Ambient = 0,
	Manhunt = 1,
	AmbientSearch = 2,
};

// Size: 0x4
enum class EStreamOperation : int32_t
{
	NONE = 0,
	BRICK_LOAD = 1,
	BRICK_UNLOAD = 2,
	BRICK_ACTIVATE = 3,
	BRICK_DEACTIVATE = 4,
	ENTITY_CREATE = 5,
	ENTITY_DELETE = 6,
	BRICK_LIST_LOADED = 7,
	BRICK_LIST_UNLOADED = 8,
	GENERIC = 9,
};

// Size: 0x4
enum class EStreamingSetLoadState : int32_t
{
	Unloaded = 0,
	Preloaded = 1,
	Loaded = 2,
	Unloading = 3,
	Loading = 4,
	Preloading = 5,
};

// Size: 0x4
enum class ESubtitleForceState : int32_t
{
	Default = 0,
	Enabled = 1,
	Disabled = 2,
	ForceAttenuation = 3,
};

// Size: 0x4
enum class ESubtitleItemType : int32_t
{
	Invalid = 0,
	Basic = 1,
	Timed = 2,
};

// Size: 0x4
enum class ESubtitleSourceDirectionType : int32_t
{
	Invalid = 0,
	UseTypeConfig = 1,
	Disabled = 2,
	OnlyShowWhenOffScreen = 3,
	AlwaysShow = 4,
};

// Size: 0x4
enum class ESubtitleSourceIconAlignment : int32_t
{
	Left = 0,
	Center = 1,
	Right = 2,
};

// Size: 0x4
enum class ESubtitleSourceViewportLockedSide : int32_t
{
	None = 0,
	Left = 1,
	Top = 2,
	Right = 3,
	Bottom = 4,
};

// Size: 0x4
enum class ESubtitleSpeakerNameType : int32_t
{
	Off = 0,
	CharacterColor = 1,
	CustomColor = 2,
};

// Size: 0x4
enum class ESweepQueryType : int32_t
{
	eSQT_OVERLAPS_AND_FIRST_BLOCK = 0,
	eSQT_CLOSEST_BLOCKING_COLLISION = 1,
	eSQT_ALL_BLOCKS = 2,
};

// Size: 0x4
enum class ETargetPrintDestination : int32_t
{
	eTPD_Screen = 0,
	eTPD_TraceViewer = 1,
};

// Size: 0x4
enum class ETestResult : int32_t
{
	ETR_NoResult = 0,
	ETR_Success = 1,
	ETR_Failure = 2,
	ETR_Timeout = 3,
	ETR_TestNotFound = 4,
	ETR_IncorrectSetup = 5,
};

// Size: 0x4
enum class ETextInputDialogStyle : int32_t
{
	eTEXTINPUTDIALOGSTYLE_DEFAULT = 0,
	eTEXTINPUTDIALOGSTYLE_NUMBER = 1,
	eTEXTINPUTDIALOGSTYLE_EMAIL = 2,
	eTEXTINPUTDIALOGSTYLE_URL = 3,
};

// Size: 0x4
enum class ETextToSpeechItemRepeatType : int32_t
{
	RepeatWhenAllFinished = 0,
	PlayOnlyDuringRepeat = 1,
	LoopItem = 2,
};

// Size: 0x4
enum class ETextToSpeechPageFlags : int32_t
{
	Invalid = 0,
	SpeakScreenName = 1,
	SpeakSelectedItem = 2,
	SpeakButtonPrompts = 4,
};

// Size: 0x4
enum class ETextToSpeechVoiceItemGender : int32_t
{
	Female = 0,
	Male = 1,
};

// Size: 0x4
enum class ETickMode : int32_t
{
	eTick_All = 0,
	eTick_ClientOnly = 1,
	eTick_HostOnly = 2,
};

// Size: 0x4
enum class ETimedSubtitleDisplayNameType : int32_t
{
	Default = 0,
	NumberedOn = 1,
	NumberedOff = 2,
};

// Size: 0x4
enum class ETimerEntityCommandType : int32_t
{
	ETECT_Add = 0,
	ETECT_Remove = 1,
	ETECT_Reset = 2,
};

// Size: 0x1
enum class ETireType : int8_t
{
	TIRE_TYPE_WETS = 0,
	TIRE_TYPE_SLICKS = 1,
	TIRE_TYPE_ICE = 2,
	TIRE_TYPE_MUD = 3,
	TIRE_TYPE_ALL_SEASON = 4,
	TIRE_TYPE_OFF_ROAD = 5,
	TIRE_TYPE_PERFORMANCE = 6,
	TIRE_TYPE_SAND = 7,
};

// Size: 0x4
enum class ETooltipHorizontalLayout : int32_t
{
	LeftOfElement = 0,
	RightOfElement = 1,
	MiddleOfElement = 2,
	Auto = 3,
};

// Size: 0x4
enum class ETooltipVerticalLayout : int32_t
{
	AlignedToTop = 0,
	AlignedToBottom = 1,
	MiddleOfElement = 2,
	Auto = 3,
};

// Size: 0x4
enum class ETraceMessageType : int32_t
{
	Message = 0,
	Warning = 1,
	Error = 2,
};

// Size: 0x1
enum class ETrailTaperType : int8_t
{
	TTT_Top = 0,
	TTT_Bottom = 1,
	TTT_Middle = 2,
};

// Size: 0x4
enum class EUIBusyOperationId : int32_t
{
	eOperationId_GameSave = 0,
	eOperationId_MenuTransition = 1,
	eOperationId_ManuallyTriggered = 2,
	eOperationId_TriggerBootFlow = 3,
	eOperationId_SaveContract = 4,
	eOperationId_StartContract = 5,
	eOperationId_SessionStart = 6,
	eOperationId_ReportContract = 7,
	eOperationId_ConnectionFlow = 8,
	eOperationId_LoadingTransitionDelayed = 9,
	eOperationId_SaveSuccess = 10,
	eOperationId_SaveFailed = 11,
	eOperationId_SessionReconnect = 12,
	eOperationId_NetSynchedMenuPause = 13,
	eOperationId_NetSynchedMenuRestart = 14,
	eOperationId_NetSynchedMenuReplan = 15,
	eOperationId_StartingMultiplayerSession = 16,
	eOperationId_HandlingMultiplayerRequest = 17,
	eOperationId_PoorConnectivity = 18,
	eOperationId_DefaultLoadout = 19,
	eOperationId_OpeningShop = 20,
	eOperationId_Max = 20,
	eOperationId_Custom_01 = 21,
	eOperationId_Custom_Begin = 21,
	eOperationId_Custom_02 = 22,
	eOperationId_Custom_03 = 23,
	eOperationId_Custom_04 = 24,
	eOperationId_Custom_05 = 25,
	eOperationId_Custom_06 = 26,
	eOperationId_Custom_07 = 27,
	eOperationId_Custom_08 = 28,
	eOperationId_Custom_09 = 29,
	eOperationId_Custom_10 = 30,
	eOperationId_Custom_11 = 31,
	eOperationId_Custom_12 = 32,
	eOperationId_Custom_13 = 33,
	eOperationId_Custom_14 = 34,
	eOperationId_Custom_15 = 35,
	eOperationId_Custom_16 = 36,
	eOperationId_Custom_17 = 37,
	eOperationId_Custom_18 = 38,
	eOperationId_Custom_19 = 39,
	eOperationId_Custom_20 = 40,
	eOperationId_Custom_21 = 41,
	eOperationId_Custom_22 = 42,
	eOperationId_Custom_23 = 43,
	eOperationId_Custom_24 = 44,
	eOperationId_Custom_25 = 45,
	eOperationId_Custom_End = 46,
	eOperationId_None = 47,
};

// Size: 0x4
enum class EUIBusyState : int32_t
{
	eBusyState_Saving = 0,
	eBusyState_Saving_Failed = 1,
	eBusyState_Saving_Success = 2,
	eBusyState_Online_Connecting = 3,
	eBusyState_Loading = 4,
	eBusyState_Fetching = 5,
	eBusyState_None = 6,
};

// Size: 0x4
enum class EUICircle3DAngleCalculationMode : int32_t
{
	ScreenSpaceAngle = 0,
	WorldSpacePlaneXYAngle = 1,
	MixedAngleMode = 2,
};

// Size: 0x4
enum class EUIGamepadButtonID : int32_t
{
	FaceButtonBottom = 1,
	FaceButtonTop = 2,
	FaceButtonLeft = 3,
	FaceButtonRight = 4,
	DpadUp = 5,
	DpadRight = 6,
	DpadDown = 7,
	DpadLeft = 8,
	ShoulderRight = 9,
	TriggerRight = 10,
	StickRight = 11,
	StickRightPress = 12,
	ShoulderLeft = 13,
	TriggerLeft = 14,
	StickLeft = 15,
	StickLeftPress = 16,
	ButtonStart = 17,
	ButtonSelect = 18,
	ButtonSelectAlt = 19,
	ButtonStartAlt = 20,
	DpadAll = 21,
	DpadUpDown = 22,
	DpadLeftRight = 23,
	TriggersLR = 24,
	ButtonCapture = 25,
	ButtonHome = 26,
	ButtonAssistant = 27,
};

// Size: 0x1
enum class EUINotificationPriority : int8_t
{
	Low = 0,
	Normal = 1,
	High = 2,
};

// Size: 0x1
enum class EUINotificationSource : int8_t
{
	Default = 0,
	GameSpecific = 1,
};

// Size: 0x4
enum class EUIOpenVRComponentArchetypeID : int32_t
{
	ButtonL = 1,
	ButtonR = 2,
	Button = 3,
	GripL = 4,
	GripR = 5,
	Joystick = 6,
	JoystickPressCenter = 7,
	JoystickPressDirections = 8,
	TrackpadRound = 9,
	TrackpadRoundPressCenter = 10,
	TrackpadRoundPressDirections = 11,
	TrackpadTall = 12,
	TrackpadTallPressCenter = 13,
	TrackpadTallPressDirections = 14,
	TriggerL = 15,
	TriggerR = 16,
	BumperL = 17,
	BumperR = 18,
};

// Size: 0x4
enum class EUIOpenVRPressDirection : int32_t
{
	North = 1,
	South = 2,
	East = 4,
	West = 8,
};

// Size: 0x4
enum class EUIOptionCategory : int32_t
{
	None = 0,
	Language = 1,
	Controller = 2,
	Mouse = 3,
	Audio = 4,
	AudioActiveProfile = 5,
	AudioAllProfiles = 6,
	Graphics = 7,
	VR = 8,
	Accessibility = 9,
	Game = 10,
	GameHud = 11,
	GameInteractions = 12,
	GameMinimap = 13,
	GameSpecificBeginMarker = 14,
};

// Size: 0x4
enum class EUITextToSpeechItemTypeEnabledType : int32_t
{
	Disabled = 0,
	Enabled = 1,
	EnabledOnce = 2,
	EnabledOnRepeatOnly = 3,
};

// Size: 0x4
enum class EUbitusRequest : int32_t
{
	EUR_DEVICE_LANGUAGE = 0,
	EUR_DEVICE_MODE = 16,
	EUR_NETWORK_SERVICE_ACCOUNT_ID = 48,
	EUR_ACCOUNT_AUTHORIZATION_CODE = 64,
	EUR_ACCOUNT_AUTHORIZATION_TOKEN = 80,
	EUR_NETWORK_SERVICE_ACCOUNT_TOKEN = 96,
	EUR_NICKNAME = 112,
	EUR_FRIEND_LIST = 128,
	EUR_BLOCKED_USER_LIST = 144,
	EUR_PROFILE_LIST = 160,
	EUR_ESHOP_INFO = 176,
	EUR_FREE_COMMUNICATION_AVAILABLE = 192,
	EUR_DLC_PURCHASE_STATUS = 208,
	EUR_PAUSE_GAME = 32800,
	EUR_RESUME_GAME = 32801,
	EUR_ESHOP_CLOSED = 1226,
};

// Size: 0x4
enum class EVRRenderDeviceType : int32_t
{
	RENDER_VR_DEVICE_TYPE_DUMMY = 0,
	RENDER_VR_DEVICE_TYPE_OCULUS = 1,
	RENDER_VR_DEVICE_TYPE_PSVR = 2,
	RENDER_VR_DEVICE_TYPE_OPENVR = 3,
	RENDER_VR_DEVICE_TYPE_COUNT = 4,
};

// Size: 0x4
enum class EVRRenderingMode : int32_t
{
	VR_RENDER_MODE_2D_SCREEN = 0,
	VR_RENDER_MODE_STEREO_3D = 1,
};

// Size: 0x1
enum class EValueUpdateStrategy : int8_t
{
	UPDATE_STRATEGY_REPLACE = 0,
	UPDATE_STRATEGY_ADD_TO = 1,
	UPDATE_STRATEGY_MULTIPLY = 2,
};

// Size: 0x1
enum class EVehicleAutoDriveConfigType : int8_t
{
	FullAutoLegacy = 0,
	FullAutoFollowSpline = 1,
	WhiskersAssistOnly = 2,
};

// Size: 0x1
enum class EVehicleAutoDriveDestinationSource : int8_t
{
	NotSet = 0,
	SpecificPosition = 1,
	FollowSpline = 2,
};

// Size: 0x1
enum class EVehicleAutoDriveInputOverrideType : int8_t
{
	FullAuto = 0,
	Acceleration = 1,
	Brake = 2,
	Handbrake = 3,
	Steering = 4,
	WhiskersLimitedSteering = 5,
	FullAutoSpeed = 6,
	Count = 7,
};

// Size: 0x1
enum class EVehicleAutoDriveMode : int8_t
{
	NotSet = 0,
	Driving = 1,
	ReverseToFaceDir = 2,
	BrakeAtDestination = 3,
	BrakingEasilyToReachDestination = 4,
};

// Size: 0x4
enum class EVehicleAutoDriveSplineDrivePointMode : int32_t
{
	NearestToLookAheadTangentPos = 0,
	SplinePointNear = 1,
	SplinePointMid = 2,
	SplinePointFar = 3,
	SplinePointsAuto1 = 4,
	SplinePointsAuto2 = 5,
};

// Size: 0x4
enum class EVehicleBoatAutodriveMode : int32_t
{
	Disabled = 0,
	FollowTargetSpatial = 1,
	FollowSpline = 2,
	ConstantInput = 3,
};

// Size: 0x4
enum class EVehicleBoatContactSurfaceType : int32_t
{
	Ice = 0,
	OnWater = 1,
	OnAir = 2,
};

// Size: 0x4
enum class EVehicleBoatEngineState : int32_t
{
	AtRest = 0,
	Rolling = 1,
	Accelerating = 2,
	Braking = 3,
	Reversing = 4,
};

// Size: 0x4
enum class EVehicleBoatFollowSplineStatetype : int32_t
{
	NotFollowingSpline = 0,
	ForwardFollowing = 1,
};

// Size: 0x4
enum class EVehicleBoatForceRequestTypeCategory : int32_t
{
	Gameplay = 0,
	CoreLogic = 1,
	Count = 2,
};

// Size: 0x4
enum class EVehicleBoatForceType : int32_t
{
	Force = 0,
	Torque = 1,
};

// Size: 0x1
enum class EVehicleBoatSimulationState : int8_t
{
	Paused = 0,
	Running = 1,
};

// Size: 0x4
enum class EVehicleBoatSteerMode : int32_t
{
	DirectTorque = 0,
	SpecificForceAppPoint = 1,
};

// Size: 0x4
enum class EVehicleCustomEngineAirboneDriveMode : int32_t
{
	RigidbodyDynamics = 0,
	RegularEngineDeceleration = 1,
	CustomEngineDeceleration = 2,
};

// Size: 0x4
enum class EVehicleCustomEngineDriveDifferential : int32_t
{
	AllWheelDrive = 0,
	FrontWheelDrive = 1,
	RearWheelDrive = 2,
};

// Size: 0x4
enum class EVehicleDifferentialType : int32_t
{
	eVDT_4WD_LimitedSlip = 0,
	eVDT_FrontWD_LimitedSlip = 1,
	eVDT_RearWD_LimitedSlip = 2,
	eVDT_4WD_Open = 3,
	eVDT_FrontWD_Open = 4,
	eVDT_RearWD_Open = 5,
};

// Size: 0x4
enum class EVehicleEngineDriveRuntimeState : int32_t
{
	AtRest = 0,
	Accelerating = 1,
	ReverseAccelerating = 2,
	Decelerating = 3,
};

// Size: 0x4
enum class EVehicleEngineDriveType : int32_t
{
	PhysX4w = 0,
	CustomEngineDrive = 1,
};

// Size: 0x4
enum class EVehicleMaxSpeedLimitState : int32_t
{
	NotActive = 0,
	DeceleratingToActivateLimit = 1,
	ApplyingLimit = 2,
};

// Size: 0x4
enum class EVehicleWheelConfigurationMode : int32_t
{
	SameForAllWheels = 0,
	SplitInFrontAndRearWheels = 1,
};

// Size: 0x4
enum class EVehicleWheelSuspensionMode : int32_t
{
	PhysxRaycast = 0,
	PhysxSweep = 1,
	CustomSweep = 2,
};

// Size: 0x4
enum class EVehicleWhiskerId : int32_t
{
	Centre = 0,
	Left = 1,
	Right = 2,
	RearCentre = 3,
	RearLeft = 4,
	RearRight = 5,
};

// Size: 0x4
enum class EViewportLock : int32_t
{
	VPL_None = 0,
	VPL_Rectangular = 1,
	VPL_Rectangular_AvoidMinimapOverlap = 2,
	VPL_Rectangular_Rounded = 3,
};

// Size: 0x4
enum class EVirtualCameraAxis : int32_t
{
	X = 0,
	Y = 1,
	Z = 2,
	Pitch = 3,
	Roll = 4,
	Yaw = 5,
};

// Size: 0x1
enum class EVirtualCameraFollowSetting : int8_t
{
	FollowX = 0,
	FollowY = 1,
	FollowZ = 2,
	FollowYaw = 3,
	FollowPitch = 4,
	FollowRoll = 5,
};

// Size: 0x4
enum class EVirtualCameraFramingOffsetMode : int32_t
{
	Fixed = 0,
	ScaleToDistance = 1,
	ScaleToDistanceWithCurves = 2,
};

// Size: 0x4
enum class EVirtualCameraLensProperty : int32_t
{
	FOV = 0,
	DOFAperture = 1,
	DOFFocalDistance = 2,
	DOFAnamorphic = 3,
	DOFSwirl = 4,
	BloomFalloffPower = 5,
	BloomStrength = 6,
	BloomStarStrength = 7,
	VignetteStrength = 8,
	VignetteMin = 9,
	VignetteMax = 10,
	VignetteColor = 11,
};

// Size: 0x4
enum class EVirtualCameraLensPropertyCombineMethod : int32_t
{
	Override = 0,
	Add = 1,
	Subtract = 2,
	Multiply = 3,
};

// Size: 0x4
enum class EVirtualCameraPriority : int32_t
{
	Lowest = 1,
	ExtremelyLow = 2,
	VeryLow = 3,
	Low = 4,
	Normal = 5,
	High = 6,
	VeryHigh = 7,
	ExtremelyHigh = 8,
	Highest = 9,
	Cinematic = 10,
	UI = 11,
	Marketing = 12,
};

// Size: 0x4
enum class EVirtualCameraShakeApplicationMode : int32_t
{
	Additive = 0,
	Strongest = 1,
	Closest = 2,
};

// Size: 0x4
enum class EVirtualCameraShakeType : int32_t
{
	Spatial = 0,
	Global = 1,
};

// Size: 0x4
enum class EVirtualCameraStabilizeApplicationMode : int32_t
{
	Transform = 0,
	Offset = 1,
};

// Size: 0x4
enum class EVirtualCameraTransitionType : int32_t
{
	AbsoluteDuration = 0,
	ScaledDuration = 1,
};

// Size: 0x4
enum class EVirtualPlatformID : int32_t
{
	DEFAULT = 0,
	PC = 256,
	PC_ENHANCED = 257,
	PC_GAMESERVER = 258,
	PC_STEAMDECK = 259,
	PC_ASUSROG = 260,
	PC_ASUSROGX = 261,
	PS5 = 1280,
	PS5_PRO = 1281,
	XBOX_SERIES = 1536,
	XBOX_SERIES_X = 1537,
	OUNCE = 1792,
	DARWIN = 2048,
	DARWIN_IOS = 2049,
	DARWIN_MACOS = 2050,
	VR = 65536,
	VR_PC = 65792,
	VR_PS5 = 66816,
	__SUB = 255,
	__BASE = 65280,
	__SYSTEM = 16711680,
};

// Size: 0x4
enum class EVisionConfigurationOverride : int32_t
{
	None = 0,
	StorylineOccupied = 1,
};

// Size: 0x4
enum class EVocalizationGroup : int32_t
{
	Always = 0,
	CloseCombat = 1,
	Damage = 2,
};

// Size: 0x1
enum class EVolumetricFogNoiseType : int8_t
{
	ADDITIVE = 1,
	SUBTRACTIVE = 2,
};

// Size: 0x1
enum class EWeaponStatTriggerConditionEnum : int8_t
{
	WEAPONDROPPED = 0,
	SITUATIONCONTAINED = 1,
	MISSIONEND = 2,
	PLAYERDIED = 3,
};

namespace Expression {
}

// Size: 0x8
class alignas(4) SVector2
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SVector2& p_Other) const;
	bool operator!=(const SVector2& p_Other) const { return !(*this == p_Other); }

	float32 x; // 0x0
	float32 y; // 0x4
};
ZHM_OFFSET_CHECK(SVector2, x, 0x0);
ZHM_OFFSET_CHECK(SVector2, y, 0x4);
static_assert(sizeof(SVector2) == 0x8, "Wrong size for SVector2");
static_assert(alignof(SVector2) == 0x4, "Wrong alignment for SVector2");

// Size: 0x1C
class alignas(4) SCurveKey
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SCurveKey& p_Other) const;
	bool operator!=(const SCurveKey& p_Other) const { return !(*this == p_Other); }

	float32 Time; // 0x0
	float32 Value; // 0x4
	SVector2 TangentIn; // 0x8
	SVector2 TangentOut; // 0x10
	ECurveInterpolationMode InterpolationMode; // 0x18
	EContinuity ContinuityKind; // 0x19
};
ZHM_OFFSET_CHECK(SCurveKey, Time, 0x0);
ZHM_OFFSET_CHECK(SCurveKey, Value, 0x4);
ZHM_OFFSET_CHECK(SCurveKey, TangentIn, 0x8);
ZHM_OFFSET_CHECK(SCurveKey, TangentOut, 0x10);
ZHM_OFFSET_CHECK(SCurveKey, InterpolationMode, 0x18);
ZHM_OFFSET_CHECK(SCurveKey, ContinuityKind, 0x19);
static_assert(sizeof(SCurveKey) == 0x1C, "Wrong size for SCurveKey");
static_assert(alignof(SCurveKey) == 0x4, "Wrong alignment for SCurveKey");

// Size: 0x48
class alignas(8) ZCurve
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZCurve& p_Other) const;
	bool operator!=(const ZCurve& p_Other) const { return !(*this == p_Other); }

	TArray<TFixedArray<float32, 8>> data; // 0x0
	TArray<SCurveKey> m_controlPoints; // 0x18
	ECurveVersion m_version; // 0x30
	ZString m_name; // 0x38
};
ZHM_OFFSET_CHECK(ZCurve, data, 0x0);
ZHM_OFFSET_CHECK(ZCurve, m_controlPoints, 0x18);
ZHM_OFFSET_CHECK(ZCurve, m_version, 0x30);
ZHM_OFFSET_CHECK(ZCurve, m_name, 0x38);
static_assert(sizeof(ZCurve) == 0x48, "Wrong size for ZCurve");
static_assert(alignof(ZCurve) == 0x8, "Wrong alignment for ZCurve");

// Size: 0x10
class alignas(16) float4
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const float4& p_Other) const;
	bool operator!=(const float4& p_Other) const { return !(*this == p_Other); }

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
	float32 w; // 0xC
};
ZHM_OFFSET_CHECK(float4, x, 0x0);
ZHM_OFFSET_CHECK(float4, y, 0x4);
ZHM_OFFSET_CHECK(float4, z, 0x8);
ZHM_OFFSET_CHECK(float4, w, 0xC);
static_assert(sizeof(float4) == 0x10, "Wrong size for float4");
static_assert(alignof(float4) == 0x10, "Wrong alignment for float4");

namespace TerrainTypes {
	// Size: 0x1
	enum class ECollisionStrategy : int8_t
	{
		CS_NO_COLLISION = 0,
		CS_STREAMED = 1,
		CS_PRELOADED = 2,
	};

	// Size: 0x1
	enum class EHoleType : int8_t
	{
		NonOccluding = 0,
		Occluding = 1,
	};

	// Size: 0x1
	enum class EQuadTreeType : int8_t
	{
		QT_GEOMETRY = 0,
		QT_COLLISION = 1,
	};

	// Size: 0x1
	enum class EStreamSeedPointType : int8_t
	{
		COLLISION = 0,
		VISUAL = 1,
		SCATTEROBJECTS = 2,
		ALL = 3,
	};

	// Size: 0x1
	enum class ETerrainChangeType : int8_t
	{
		SHAPE = 0,
		PAINTING = 1,
		DATALAYER = 2,
	};

	// Size: 0x1
	enum class ETerrainStampLayerType : int8_t
	{
		SL_LARGE = 0,
		SL_MEDIUM = 1,
		SL_SMALL = 2,
		SL_CUSTOM = 3,
	};

	// Size: 0x1
	enum class ETerrainTessellation : int8_t
	{
		QS_25CM = 0,
		QS_50CM = 1,
		QS_100CM = 2,
		QS_200CM = 3,
		QS_400CM = 4,
		QS_800CM = 5,
	};

	// Size: 0x2
	class alignas(1) QuadSurfaceIndices
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const QuadSurfaceIndices& p_Other) const;
		bool operator!=(const QuadSurfaceIndices& p_Other) const { return !(*this == p_Other); }

		uint8 t0SurfaceTypeIndex; // 0x0
		uint8 t1SurfaceTypeIndex; // 0x1
	};
	ZHM_OFFSET_CHECK(QuadSurfaceIndices, t0SurfaceTypeIndex, 0x0);
	ZHM_OFFSET_CHECK(QuadSurfaceIndices, t1SurfaceTypeIndex, 0x1);
	static_assert(sizeof(QuadSurfaceIndices) == 0x2, "Wrong size for QuadSurfaceIndices");
	static_assert(alignof(QuadSurfaceIndices) == 0x1, "Wrong alignment for QuadSurfaceIndices");

	// Size: 0x8
	class alignas(4) QuadSurfaceType
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const QuadSurfaceType& p_Other) const;
		bool operator!=(const QuadSurfaceType& p_Other) const { return !(*this == p_Other); }

		uint32 triangle0SurfaceHash; // 0x0
		uint32 triangle1SurfaceHash; // 0x4
	};
	ZHM_OFFSET_CHECK(QuadSurfaceType, triangle0SurfaceHash, 0x0);
	ZHM_OFFSET_CHECK(QuadSurfaceType, triangle1SurfaceHash, 0x4);
	static_assert(sizeof(QuadSurfaceType) == 0x8, "Wrong size for QuadSurfaceType");
	static_assert(alignof(QuadSurfaceType) == 0x4, "Wrong alignment for QuadSurfaceType");

	// Size: 0x30
	class alignas(8) SSectorInfo
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SSectorInfo& p_Other) const;
		bool operator!=(const SSectorInfo& p_Other) const { return !(*this == p_Other); }

		TArray<uint32> m_aGlobalSectorIndices; // 0x0
		uint32 m_nGlobalStartCoordX; // 0x18
		uint32 m_nGlobalStartCoordY; // 0x1C
		uint32 m_nGlobalEndCoordX; // 0x20
		uint32 m_nGlobalEndCoordY; // 0x24
		uint8 m_nLOD; // 0x28
	};
	ZHM_OFFSET_CHECK(SSectorInfo, m_aGlobalSectorIndices, 0x0);
	ZHM_OFFSET_CHECK(SSectorInfo, m_nGlobalStartCoordX, 0x18);
	ZHM_OFFSET_CHECK(SSectorInfo, m_nGlobalStartCoordY, 0x1C);
	ZHM_OFFSET_CHECK(SSectorInfo, m_nGlobalEndCoordX, 0x20);
	ZHM_OFFSET_CHECK(SSectorInfo, m_nGlobalEndCoordY, 0x24);
	ZHM_OFFSET_CHECK(SSectorInfo, m_nLOD, 0x28);
	static_assert(sizeof(SSectorInfo) == 0x30, "Wrong size for SSectorInfo");
	static_assert(alignof(SSectorInfo) == 0x8, "Wrong alignment for SSectorInfo");

}

// Size: 0x100
class alignas(8) SSurfaceTags
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SSurfaceTags& p_Other) const;
	bool operator!=(const SSurfaceTags& p_Other) const { return !(*this == p_Other); }

	ZString m_tarmacTag; // 0x0
	ZString m_mudTag; // 0x10
	ZString m_snowTag; // 0x20
	ZString m_grassTag; // 0x30
	ZString m_looseSandTag; // 0x40
	ZString m_packedSandTag; // 0x50
	ZString m_iceTag; // 0x60
	ZString m_dirtTag; // 0x70
	ZString m_gravelTag; // 0x80
	ZString m_cobblestonesTag; // 0x90
	ZString m_metalTag; // 0xA0
	ZString m_shallowWaterTag; // 0xB0
	ZString m_deepWaterTag; // 0xC0
	ZString m_wetSandTag; // 0xD0
	ZString m_rockTag; // 0xE0
	ZString m_concreteTag; // 0xF0
};
ZHM_OFFSET_CHECK(SSurfaceTags, m_tarmacTag, 0x0);
ZHM_OFFSET_CHECK(SSurfaceTags, m_mudTag, 0x10);
ZHM_OFFSET_CHECK(SSurfaceTags, m_snowTag, 0x20);
ZHM_OFFSET_CHECK(SSurfaceTags, m_grassTag, 0x30);
ZHM_OFFSET_CHECK(SSurfaceTags, m_looseSandTag, 0x40);
ZHM_OFFSET_CHECK(SSurfaceTags, m_packedSandTag, 0x50);
ZHM_OFFSET_CHECK(SSurfaceTags, m_iceTag, 0x60);
ZHM_OFFSET_CHECK(SSurfaceTags, m_dirtTag, 0x70);
ZHM_OFFSET_CHECK(SSurfaceTags, m_gravelTag, 0x80);
ZHM_OFFSET_CHECK(SSurfaceTags, m_cobblestonesTag, 0x90);
ZHM_OFFSET_CHECK(SSurfaceTags, m_metalTag, 0xA0);
ZHM_OFFSET_CHECK(SSurfaceTags, m_shallowWaterTag, 0xB0);
ZHM_OFFSET_CHECK(SSurfaceTags, m_deepWaterTag, 0xC0);
ZHM_OFFSET_CHECK(SSurfaceTags, m_wetSandTag, 0xD0);
ZHM_OFFSET_CHECK(SSurfaceTags, m_rockTag, 0xE0);
ZHM_OFFSET_CHECK(SSurfaceTags, m_concreteTag, 0xF0);
static_assert(sizeof(SSurfaceTags) == 0x100, "Wrong size for SSurfaceTags");
static_assert(alignof(SSurfaceTags) == 0x8, "Wrong alignment for SSurfaceTags");

// Size: 0xC
class alignas(4) SVector3
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SVector3& p_Other) const;
	bool operator!=(const SVector3& p_Other) const { return !(*this == p_Other); }

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
};
ZHM_OFFSET_CHECK(SVector3, x, 0x0);
ZHM_OFFSET_CHECK(SVector3, y, 0x4);
ZHM_OFFSET_CHECK(SVector3, z, 0x8);
static_assert(sizeof(SVector3) == 0xC, "Wrong size for SVector3");
static_assert(alignof(SVector3) == 0x4, "Wrong alignment for SVector3");

// Size: 0x30
class alignas(4) SMatrix43
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SMatrix43& p_Other) const;
	bool operator!=(const SMatrix43& p_Other) const { return !(*this == p_Other); }

	SVector3 XAxis; // 0x0
	SVector3 YAxis; // 0xC
	SVector3 ZAxis; // 0x18
	SVector3 Trans; // 0x24
};
ZHM_OFFSET_CHECK(SMatrix43, XAxis, 0x0);
ZHM_OFFSET_CHECK(SMatrix43, YAxis, 0xC);
ZHM_OFFSET_CHECK(SMatrix43, ZAxis, 0x18);
ZHM_OFFSET_CHECK(SMatrix43, Trans, 0x24);
static_assert(sizeof(SMatrix43) == 0x30, "Wrong size for SMatrix43");
static_assert(alignof(SMatrix43) == 0x4, "Wrong alignment for SMatrix43");

class ZSpatialEntity
{
public:
	// Size: 0x4
	enum class ERoomBehaviour : int32_t
	{
		ROOM_STATIC = 0,
		ROOM_DYNAMIC = 1,
		ROOM_STATIC_OUTSIDE_CLIENT = 2,
	};

};

namespace PCGTypes {
	// Size: 0x1
	enum class EGridSize : int8_t
	{
		GRID_OFF = 0,
		GRID_256M = 1,
		GRID_128M = 2,
		GRID_64M = 3,
		GRID_32M = 4,
		GRID_16M = 5,
	};

	// Size: 0xC
	class alignas(4) SGridHeader
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SGridHeader& p_Other) const;
		bool operator!=(const SGridHeader& p_Other) const { return !(*this == p_Other); }

		uint32 m_nBeginIndex; // 0x0
		uint32 m_nNumPointsInCell; // 0x4
		uint32 m_nGridIndex; // 0x8
	};
	ZHM_OFFSET_CHECK(SGridHeader, m_nBeginIndex, 0x0);
	ZHM_OFFSET_CHECK(SGridHeader, m_nNumPointsInCell, 0x4);
	ZHM_OFFSET_CHECK(SGridHeader, m_nGridIndex, 0x8);
	static_assert(sizeof(SGridHeader) == 0xC, "Wrong size for SGridHeader");
	static_assert(alignof(SGridHeader) == 0x4, "Wrong alignment for SGridHeader");

}

namespace G2PCG {
	class ZPointcloudTransformBase
	{
	public:
		// Size: 0x1
		enum class ETransformationSpace : int8_t
		{
			TS_LOCAL = 0,
			TS_WORLD = 1,
		};

	};

	class ZPointcloudFilterTagEntity
	{
	public:
		// Size: 0x1
		enum class ETagCombineOperationType : int8_t
		{
			OP_AND = 0,
			OP_OR = 1,
		};

		// Size: 0x1
		enum class EOperationType : int8_t
		{
			OP_GREATER = 0,
			OP_GREATER_EQUAL = 1,
			OP_EQUAL = 2,
			OP_LESS = 3,
			OP_LESS_EQUAL = 4,
		};

	};

	class ZSplineSampler
	{
	public:
		// Size: 0x1
		enum class ESplineOrientationType : int8_t
		{
			O_NONE = 0,
			O_TANGENT = 1,
			O_TOWARDS_CENTER = 2,
			O_TOWARDS_NEXT = 3,
		};

	};

}

// Size: 0x1
enum class GameTimeMultiplierType : int8_t
{
	Game = 0,
	Debug = 1,
	Combined = 2,
};

// Size: 0xC
class alignas(4) SColorRGB
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SColorRGB& p_Other) const;
	bool operator!=(const SColorRGB& p_Other) const { return !(*this == p_Other); }

	float32 r; // 0x0
	float32 g; // 0x4
	float32 b; // 0x8
};
ZHM_OFFSET_CHECK(SColorRGB, r, 0x0);
ZHM_OFFSET_CHECK(SColorRGB, g, 0x4);
ZHM_OFFSET_CHECK(SColorRGB, b, 0x8);
static_assert(sizeof(SColorRGB) == 0xC, "Wrong size for SColorRGB");
static_assert(alignof(SColorRGB) == 0x4, "Wrong alignment for SColorRGB");

// Size: 0x10
class alignas(4) SVector4
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SVector4& p_Other) const;
	bool operator!=(const SVector4& p_Other) const { return !(*this == p_Other); }

	float32 x; // 0x0
	float32 y; // 0x4
	float32 z; // 0x8
	float32 w; // 0xC
};
ZHM_OFFSET_CHECK(SVector4, x, 0x0);
ZHM_OFFSET_CHECK(SVector4, y, 0x4);
ZHM_OFFSET_CHECK(SVector4, z, 0x8);
ZHM_OFFSET_CHECK(SVector4, w, 0xC);
static_assert(sizeof(SVector4) == 0x10, "Wrong size for SVector4");
static_assert(alignof(SVector4) == 0x4, "Wrong alignment for SVector4");

// Size: 0x8
class alignas(8) ZGameTime
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZGameTime& p_Other) const;
	bool operator!=(const ZGameTime& p_Other) const { return !(*this == p_Other); }

	int64 m_nTicks; // 0x0
};
ZHM_OFFSET_CHECK(ZGameTime, m_nTicks, 0x0);
static_assert(sizeof(ZGameTime) == 0x8, "Wrong size for ZGameTime");
static_assert(alignof(ZGameTime) == 0x8, "Wrong alignment for ZGameTime");

class ZCLValueManager
{
public:
};

namespace Gameplay {
	// Size: 0x4
	enum class EDashCoverSwapFacingMode : int32_t
	{
		KeepDashFacing = 0,
		SwapFacingToTargetCorner = 1,
		InputDrivenDynamicFacing = 2,
	};

	// Size: 0x1
	enum class EAgilityActionAttributeSearchType : int8_t
	{
		LowestValue = 0,
		HighestValue = 1,
	};

	// Size: 0x1
	enum class EAgilityActionLaunchVelocityClampBehavior : int8_t
	{
		None = 0,
		Signed = 1,
		Unsigned = 2,
	};

	// Size: 0x1
	enum class EAgilityActionReferencePointStepOperation : int8_t
	{
		CapsuleTransform = 0,
		BoneTransform = 1,
		CameraTransform = 2,
		MoveInputOrientation = 3,
		VelocityOrientation = 4,
		VelocityTranslation = 5,
		SourceMarkupWorldNormalized = 6,
		SourceMarkupLocalNormalized = 7,
		SourceMarkupClosestPoint = 8,
		SourceMarkupConnectionLink = 9,
		SourceMarkupPlaneIntersection = 10,
		TargetMarkupWorldNormalized = 11,
		TargetMarkupLocalNormalized = 12,
		TargetMarkupClosestPoint = 13,
		TargetMarkupConnectionLink = 14,
		TargetMarkupPlaneIntersection = 15,
		WorldTranslation = 16,
		LocalTranslation = 17,
		Rotation = 18,
		AffineInverse = 19,
		TranslationDirectionToRotation = 20,
		RotationToTranslationDirection = 21,
		PlanarizedRotation = 22,
		RayTrace = 23,
		SafeCapsuleTransformTowardsLocalRight = 24,
	};

	// Size: 0x18
	class alignas(4) SAgilityActionReferencePointStepDebug
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SAgilityActionReferencePointStepDebug& p_Other) const;
		bool operator!=(const SAgilityActionReferencePointStepDebug& p_Other) const { return !(*this == p_Other); }

		bool m_drawEnabled; // 0x0
		float32 m_drawSize; // 0x4
		float32 m_drawTime; // 0x8
		SColorRGB m_drawColor; // 0xC
	};
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStepDebug, m_drawEnabled, 0x0);
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStepDebug, m_drawSize, 0x4);
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStepDebug, m_drawTime, 0x8);
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStepDebug, m_drawColor, 0xC);
	static_assert(sizeof(SAgilityActionReferencePointStepDebug) == 0x18, "Wrong size for SAgilityActionReferencePointStepDebug");
	static_assert(alignof(SAgilityActionReferencePointStepDebug) == 0x4, "Wrong alignment for SAgilityActionReferencePointStepDebug");

	// Size: 0x1
	enum class EAgilityActionReferencePointStepMethod : int8_t
	{
		Set = 0,
		Apply = 1,
		Offset = 2,
		Scale = 3,
	};

	// Size: 0x4
	enum class EHumanoidBoneType : int32_t
	{
		Hip = 0,
		Torso = 1,
		Head = 2,
		RightKnee = 3,
		LeftKnee = 4,
		RightClavicle = 5,
		LeftClavicle = 6,
		RightElbow = 7,
		LeftElbow = 8,
		BackAttacher = 9,
		RightHandAttacher = 10,
		RightIKHandAttacher = 11,
		LeftHandAttacher = 12,
		LeftIKHandAttacher = 13,
		RightFoot = 14,
		LeftFoot = 15,
		FreeAttacher_Ground = 16,
		HeadEnd = 17,
		Ground = 18,
		NpcVisionEffector = 19,
		RightWrist = 20,
		LeftWrist = 21,
		RightShoulder = 22,
		LeftShoulder = 23,
		RightFemur = 24,
		LeftFemur = 25,
		PropAttacher = 26,
		Spine03 = 27,
		Nose = 28,
	};

	// Size: 0xC
	class alignas(4) SVehicleCameraRollConfiguration
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleCameraRollConfiguration& p_Other) const;
		bool operator!=(const SVehicleCameraRollConfiguration& p_Other) const { return !(*this == p_Other); }

		bool m_enabled; // 0x0
		float32 m_maxRoll; // 0x4
		float32 m_rollSpringTime; // 0x8
	};
	ZHM_OFFSET_CHECK(SVehicleCameraRollConfiguration, m_enabled, 0x0);
	ZHM_OFFSET_CHECK(SVehicleCameraRollConfiguration, m_maxRoll, 0x4);
	ZHM_OFFSET_CHECK(SVehicleCameraRollConfiguration, m_rollSpringTime, 0x8);
	static_assert(sizeof(SVehicleCameraRollConfiguration) == 0xC, "Wrong size for SVehicleCameraRollConfiguration");
	static_assert(alignof(SVehicleCameraRollConfiguration) == 0x4, "Wrong alignment for SVehicleCameraRollConfiguration");

	// Size: 0x4
	enum class ECloseCombatReaction : int32_t
	{
		eCCR_Block = 0,
		eCCR_BlockAndCounter = 1,
		eCCR_SideStep = 2,
		eCCR_SideStepAndCounter = 3,
		eCCR_Wait = 4,
		eCCR_Parry = 5,
	};

	// Size: 0x20
	class alignas(4) STWIStopsConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const STWIStopsConfig& p_Other) const;
		bool operator!=(const STWIStopsConfig& p_Other) const { return !(*this == p_Other); }

		TResourcePtr m_queryPreset; // 0x0
		float32 m_stopsAnticipationProbeDistance; // 0x8
		float32 m_stopsAbortDistance; // 0xC
		float32 m_stopsMinLowObstacleHeight; // 0x10
		float32 m_stopsMaxLowObstacleHeight; // 0x14
		float32 m_obstacleDetectionDepthSize; // 0x18
		float32 m_leaveContextDuration; // 0x1C
	};
	ZHM_OFFSET_CHECK(STWIStopsConfig, m_queryPreset, 0x0);
	ZHM_OFFSET_CHECK(STWIStopsConfig, m_stopsAnticipationProbeDistance, 0x8);
	ZHM_OFFSET_CHECK(STWIStopsConfig, m_stopsAbortDistance, 0xC);
	ZHM_OFFSET_CHECK(STWIStopsConfig, m_stopsMinLowObstacleHeight, 0x10);
	ZHM_OFFSET_CHECK(STWIStopsConfig, m_stopsMaxLowObstacleHeight, 0x14);
	ZHM_OFFSET_CHECK(STWIStopsConfig, m_obstacleDetectionDepthSize, 0x18);
	ZHM_OFFSET_CHECK(STWIStopsConfig, m_leaveContextDuration, 0x1C);
	static_assert(sizeof(STWIStopsConfig) == 0x20, "Wrong size for STWIStopsConfig");
	static_assert(alignof(STWIStopsConfig) == 0x4, "Wrong alignment for STWIStopsConfig");

	// Size: 0x1
	enum class EVehicleDriftingDeactivationConditionType : int8_t
	{
		ForwardSpeed = 0,
		LateralSpeed = 1,
		AngularSpeed = 2,
		SteeringValue = 3,
		LateralSpeedUp = 4,
		AngularSpeedUp = 5,
		CounterSteering = 6,
		HandbrakeOff = 7,
		BrakesOff = 8,
	};

	// Size: 0x18
	class alignas(8) SVehicleDriftingDeactivationCondition
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleDriftingDeactivationCondition& p_Other) const;
		bool operator!=(const SVehicleDriftingDeactivationCondition& p_Other) const { return !(*this == p_Other); }

		Gameplay::EVehicleDriftingDeactivationConditionType m_conditionType; // 0x0
		float32 m_thresholdValue; // 0x4
		float32 m_time; // 0x8
		ZGameTime m_timestampOfStartSatisfyingCondition; // 0x10
	};
	ZHM_OFFSET_CHECK(SVehicleDriftingDeactivationCondition, m_conditionType, 0x0);
	ZHM_OFFSET_CHECK(SVehicleDriftingDeactivationCondition, m_thresholdValue, 0x4);
	ZHM_OFFSET_CHECK(SVehicleDriftingDeactivationCondition, m_time, 0x8);
	ZHM_OFFSET_CHECK(SVehicleDriftingDeactivationCondition, m_timestampOfStartSatisfyingCondition, 0x10);
	static_assert(sizeof(SVehicleDriftingDeactivationCondition) == 0x18, "Wrong size for SVehicleDriftingDeactivationCondition");
	static_assert(alignof(SVehicleDriftingDeactivationCondition) == 0x8, "Wrong alignment for SVehicleDriftingDeactivationCondition");

	// Size: 0x14
	class alignas(4) SVehicleCameraControlsConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleCameraControlsConfig& p_Other) const;
		bool operator!=(const SVehicleCameraControlsConfig& p_Other) const { return !(*this == p_Other); }

		bool m_invertHorizontalOrbit; // 0x0
		bool m_invertVerticalOrbit; // 0x1
		SVector2 m_maxInputAngles; // 0x4
		SVector2 m_maxInputAnglesSpringTimes; // 0xC
	};
	ZHM_OFFSET_CHECK(SVehicleCameraControlsConfig, m_invertHorizontalOrbit, 0x0);
	ZHM_OFFSET_CHECK(SVehicleCameraControlsConfig, m_invertVerticalOrbit, 0x1);
	ZHM_OFFSET_CHECK(SVehicleCameraControlsConfig, m_maxInputAngles, 0x4);
	ZHM_OFFSET_CHECK(SVehicleCameraControlsConfig, m_maxInputAnglesSpringTimes, 0xC);
	static_assert(sizeof(SVehicleCameraControlsConfig) == 0x14, "Wrong size for SVehicleCameraControlsConfig");
	static_assert(alignof(SVehicleCameraControlsConfig) == 0x4, "Wrong alignment for SVehicleCameraControlsConfig");

	// Size: 0x28
	class alignas(4) STWIAnticipationConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const STWIAnticipationConfig& p_Other) const;
		bool operator!=(const STWIAnticipationConfig& p_Other) const { return !(*this == p_Other); }

		TResourcePtr m_queryPreset; // 0x0
		SVector2 m_forwardLimits; // 0x8
		SVector2 m_rightSideLimits; // 0x10
		SVector2 m_heightLimits; // 0x18
		SVector2 m_crouchHeightLimits; // 0x20
	};
	ZHM_OFFSET_CHECK(STWIAnticipationConfig, m_queryPreset, 0x0);
	ZHM_OFFSET_CHECK(STWIAnticipationConfig, m_forwardLimits, 0x8);
	ZHM_OFFSET_CHECK(STWIAnticipationConfig, m_rightSideLimits, 0x10);
	ZHM_OFFSET_CHECK(STWIAnticipationConfig, m_heightLimits, 0x18);
	ZHM_OFFSET_CHECK(STWIAnticipationConfig, m_crouchHeightLimits, 0x20);
	static_assert(sizeof(STWIAnticipationConfig) == 0x28, "Wrong size for STWIAnticipationConfig");
	static_assert(alignof(STWIAnticipationConfig) == 0x4, "Wrong alignment for STWIAnticipationConfig");

	// Size: 0x20
	class alignas(4) SVehicleFollowConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleFollowConfig& p_Other) const;
		bool operator!=(const SVehicleFollowConfig& p_Other) const { return !(*this == p_Other); }

		SVector4 m_equilibriumPoint_Yaw_Pitch_Radius_FOV; // 0x0
		SVector4 m_equilibriumPoint_Yaw_Pitch_Radius_FOV_SpringTimes; // 0x10
	};
	ZHM_OFFSET_CHECK(SVehicleFollowConfig, m_equilibriumPoint_Yaw_Pitch_Radius_FOV, 0x0);
	ZHM_OFFSET_CHECK(SVehicleFollowConfig, m_equilibriumPoint_Yaw_Pitch_Radius_FOV_SpringTimes, 0x10);
	static_assert(sizeof(SVehicleFollowConfig) == 0x20, "Wrong size for SVehicleFollowConfig");
	static_assert(alignof(SVehicleFollowConfig) == 0x4, "Wrong alignment for SVehicleFollowConfig");

	// Size: 0x18
	class alignas(4) SVehicleLookAtOffsetConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleLookAtOffsetConfig& p_Other) const;
		bool operator!=(const SVehicleLookAtOffsetConfig& p_Other) const { return !(*this == p_Other); }

		SVector3 m_lookAtOffsetXYZ; // 0x0
		SVector3 m_lookAtOffsetXYZSpringTimes; // 0xC
	};
	ZHM_OFFSET_CHECK(SVehicleLookAtOffsetConfig, m_lookAtOffsetXYZ, 0x0);
	ZHM_OFFSET_CHECK(SVehicleLookAtOffsetConfig, m_lookAtOffsetXYZSpringTimes, 0xC);
	static_assert(sizeof(SVehicleLookAtOffsetConfig) == 0x18, "Wrong size for SVehicleLookAtOffsetConfig");
	static_assert(alignof(SVehicleLookAtOffsetConfig) == 0x4, "Wrong alignment for SVehicleLookAtOffsetConfig");

	// Size: 0x38
	class alignas(4) SVehicleCameraStateConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleCameraStateConfig& p_Other) const;
		bool operator!=(const SVehicleCameraStateConfig& p_Other) const { return !(*this == p_Other); }

		Gameplay::SVehicleFollowConfig m_followConfig; // 0x0
		Gameplay::SVehicleLookAtOffsetConfig m_lookAtOffsetConfig; // 0x20
	};
	ZHM_OFFSET_CHECK(SVehicleCameraStateConfig, m_followConfig, 0x0);
	ZHM_OFFSET_CHECK(SVehicleCameraStateConfig, m_lookAtOffsetConfig, 0x20);
	static_assert(sizeof(SVehicleCameraStateConfig) == 0x38, "Wrong size for SVehicleCameraStateConfig");
	static_assert(alignof(SVehicleCameraStateConfig) == 0x4, "Wrong alignment for SVehicleCameraStateConfig");

	// Size: 0x11C
	class alignas(4) SVehicleCameraStatesData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleCameraStatesData& p_Other) const;
		bool operator!=(const SVehicleCameraStatesData& p_Other) const { return !(*this == p_Other); }

		Gameplay::SVehicleCameraStateConfig m_atRestStateConfig; // 0x0
		Gameplay::SVehicleCameraStateConfig m_rollingStateConfig; // 0x38
		Gameplay::SVehicleCameraStateConfig m_brakingStateConfig; // 0x70
		Gameplay::SVehicleCameraStateConfig m_acceleratingStateConfig; // 0xA8
		Gameplay::SVehicleCameraStateConfig m_acceleratingHighSpeedStateConfig; // 0xE0
		float32 m_highSpeedThreshold; // 0x118
	};
	ZHM_OFFSET_CHECK(SVehicleCameraStatesData, m_atRestStateConfig, 0x0);
	ZHM_OFFSET_CHECK(SVehicleCameraStatesData, m_rollingStateConfig, 0x38);
	ZHM_OFFSET_CHECK(SVehicleCameraStatesData, m_brakingStateConfig, 0x70);
	ZHM_OFFSET_CHECK(SVehicleCameraStatesData, m_acceleratingStateConfig, 0xA8);
	ZHM_OFFSET_CHECK(SVehicleCameraStatesData, m_acceleratingHighSpeedStateConfig, 0xE0);
	ZHM_OFFSET_CHECK(SVehicleCameraStatesData, m_highSpeedThreshold, 0x118);
	static_assert(sizeof(SVehicleCameraStatesData) == 0x11C, "Wrong size for SVehicleCameraStatesData");
	static_assert(alignof(SVehicleCameraStatesData) == 0x4, "Wrong alignment for SVehicleCameraStatesData");

	// Size: 0x20
	class alignas(4) STWITouchConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const STWITouchConfig& p_Other) const;
		bool operator!=(const STWITouchConfig& p_Other) const { return !(*this == p_Other); }

		TResourcePtr m_queryPreset; // 0x0
		float32 m_castDistance; // 0x8
		float32 m_castSphereRadius; // 0xC
		float32 m_castAngle; // 0x10
		float32 m_minimumContactDuration; // 0x14
		float32 m_maximumContactDuration; // 0x18
		float32 m_interactionCooldown; // 0x1C
	};
	ZHM_OFFSET_CHECK(STWITouchConfig, m_queryPreset, 0x0);
	ZHM_OFFSET_CHECK(STWITouchConfig, m_castDistance, 0x8);
	ZHM_OFFSET_CHECK(STWITouchConfig, m_castSphereRadius, 0xC);
	ZHM_OFFSET_CHECK(STWITouchConfig, m_castAngle, 0x10);
	ZHM_OFFSET_CHECK(STWITouchConfig, m_minimumContactDuration, 0x14);
	ZHM_OFFSET_CHECK(STWITouchConfig, m_maximumContactDuration, 0x18);
	ZHM_OFFSET_CHECK(STWITouchConfig, m_interactionCooldown, 0x1C);
	static_assert(sizeof(STWITouchConfig) == 0x20, "Wrong size for STWITouchConfig");
	static_assert(alignof(STWITouchConfig) == 0x4, "Wrong alignment for STWITouchConfig");

	// Size: 0x4
	enum class EDashTargetingBehaviour : int32_t
	{
		Default = 0,
		ClosestTargetToPlayer = 1,
		FurthestTargetToPlayer = 2,
	};

	// Size: 0x4
	enum class EDashStancePolicy : int32_t
	{
		TryKeepStance = 0,
		ChangeAccordingToCoverType = 1,
	};

	// Size: 0x1
	enum class EAnimationLocomotionClimbingType : int8_t
	{
		None = 0,
		Ladder = 1,
		Drainpipe = 2,
	};

	// Size: 0x1
	enum class EClimbingTransitionSide : int8_t
	{
		Bottom = 0,
		Top = 1,
		Left = 2,
		Right = 3,
	};

	// Size: 0x4
	enum class EAIFlightRecordChannel : int32_t
	{
		General = 0,
		Plan_Primary = 1,
		Plan_Secondary = 2,
		Plan_Tertiary = 3,
		HTN = 4,
		HTNPinned = 5,
		Roles = 6,
		Senses = 7,
		PerceptionModifiers = 8,
		TagAdd = 9,
		TagRemove = 10,
		CooldownAdd = 11,
		CooldownRemove = 12,
		Investigation = 13,
		Storyline = 14,
		Locomotion = 15,
		Pathfinding = 16,
		LookAt = 17,
		StateCommunication = 18,
		AnimationAct = 19,
		Dialogue = 20,
		Communication = 21,
		StateIcon = 22,
		TacticalEspionageArea = 23,
		Count = 24,
	};

	// Size: 0x4
	enum class EAIFlightRecorderEntryType : int32_t
	{
		Message = 0,
		Headline = 1,
		Warning = 2,
		Error = 3,
		Count = 4,
	};

	// Size: 0x1
	enum class EActionDirection : int8_t
	{
		None = 0,
		Forward = 1,
		Back = 2,
		Left = 3,
		Right = 4,
		Any = 5,
	};

	// Size: 0x1
	enum class EActionKeywordsType : int8_t
	{
		Parry = 0,
		CombatRush = 1,
		Grab = 2,
		Agility = 3,
		Locomotion = 4,
		LocomotionApproach = 5,
		EquipItem = 6,
		MeleeAttack = 7,
		GadgetView = 8,
		ContextualItemThrow = 9,
		CloseCombatPairedAction = 10,
		FakeSurrender = 11,
		Sidestep = 12,
		CoverTakedown = 13,
		JumpAway = 14,
		CoverTransition = 15,
		EnterLadderClimb = 16,
		LeaveLadderClimb = 17,
		Crouch = 18,
		Uncrouch = 19,
		Interact = 20,
		ThrowItem = 21,
		Pickpocket = 22,
		BlendingIn = 23,
		UseDoor = 24,
		PickUpItem = 25,
		ActivateGadget = 26,
		DropDown = 27,
		StartStrafing = 28,
		StopStrafing = 29,
		StartAccelerating = 30,
		StopAccelerating = 31,
		Stagger = 32,
		TrespassingStanceChange = 33,
		AnimationAct = 34,
		AimFirearm = 35,
		ShootFirearm = 36,
		GrabAttack = 37,
		GrabRush = 38,
		ReloadFirearm = 39,
		Block = 40,
		Dash = 41,
	};

	// Size: 0x1
	enum class EAdjacentCoverType : int8_t
	{
		Regular = 0,
		Corner = 1,
		InnerCorner = 2,
	};

	// Size: 0x4
	enum class EAgilityActionAllowance : int32_t
	{
		AllowWhileUsingGadget = 1,
		AllowWhileFalling = 2,
		AllowWhileAiming = 4,
		AllowWhileInConfrontation = 8,
		AllowWhileGrounded = 16,
		AllowWhilePerformingSelf = 32,
	};

	// Size: 0x1
	enum class EAgilityActionApproachingMovementDisplacementErrorCorrectionType : int8_t
	{
		None = 0,
		BlendByRemainingDistance = 1,
		BlendByTraveledDistance = 2,
		BlendByRemainingRatio = 3,
		BlendByTraveledRatio = 4,
	};

	// Size: 0x1
	enum class EAgilityActionApproachingMovementProjectionType : int8_t
	{
		None = 0,
		SourceMarkupPath = 1,
		TargetMarkupPath = 2,
	};

	// Size: 0x1
	enum class EAgilityActionApproachingMovementType : int8_t
	{
		Stationary = 0,
		Moving = 1,
		Dynamic = 2,
	};

	// Size: 0x1
	enum class EAgilityActionAttributeOperatorType : int8_t
	{
		Distance2D = 0,
		Distance3D = 1,
		DistanceLocalX = 2,
		DistanceLocalY = 3,
		DistanceLocalZ = 4,
		AbsOrientationYawDelta = 5,
		InputDirectionMatch = 6,
		LastNonZeroInputDirectionMatch = 7,
	};

	// Size: 0x1
	enum class EAgilityActionAttributeSelectionInfluence : int8_t
	{
		None = 0,
		LowerValuePriority = 1,
		HigherValuePriority = 2,
	};

	// Size: 0x1
	enum class EAgilityActionCollectionEvaluationType : int8_t
	{
		All = 0,
		Any = 1,
	};

	// Size: 0x1
	enum class EAgilityActionConditionConstraintType : int8_t
	{
		DistanceLower = 0,
		DistanceGreater = 1,
		DistanceXYLower = 2,
		DistanceXYGreater = 3,
		DistanceZLower = 4,
		DistanceZGreater = 5,
		RelativeLower = 6,
		RelativeGreater = 7,
		OrientationLower = 8,
		OrientationGreater = 9,
		AbsOrientationLower = 10,
		AbsOrientationGreater = 11,
		FacingSignLower = 12,
		FacingSignGreater = 13,
		InsideSlice = 14,
		BehindOfForwardPlane = 15,
		FrontOfForwardPlane = 16,
		InputMagnitudeLower = 17,
		InputMagnitudeGreater = 18,
		InputDirectionMatch = 19,
		InputDirectionDeltaGreater = 20,
		InputDirectionDeltaLower = 21,
		LastNonZeroInputDirectionMatch = 22,
		VelocityMagnitudeLower = 23,
		VelocityMagnitudeGreater = 24,
		VelocityDirectionMatch = 25,
		HasAngularVelocity = 26,
		PerformingAgilityActionWithContentHint = 27,
		HasOverlappingHumanoidInBox = 28,
		HasOverlappingCollisionInBox = 29,
		OuterConditionsOr = 30,
		OuterConditionsAnd = 31,
		LiteralTrue = 32,
		LiteralFalse = 33,
	};

	// Size: 0x1
	enum class EAgilityActionConnectionDebugDrawType : int8_t
	{
		None = 0,
		Line = 1,
		DottedLine = 2,
		Sphere = 3,
		Box = 4,
	};

	// Size: 0x4
	enum class EAgilityActionConnectionNavLinkFlag : int32_t
	{
		ContextualJump = 1,
	};

	// Size: 0x1
	enum class EAgilityActionConnectionTargetType : int8_t
	{
		Self = 0,
		Other = 1,
	};

	// Size: 0x1
	enum class EAgilityActionEnvironmentContextTarget : int8_t
	{
		SourceEnvironmentContext = 0,
		TargetEnvironmentContext = 1,
	};

	// Size: 0x1
	enum class EAgilityActionHumanoidState : int8_t
	{
		None = 0,
		Hang = 1,
		Sidle = 2,
		Ladder = 3,
		Drainpipe = 4,
		ZipLine = 5,
	};

	// Size: 0x4
	enum class EAgilityActionNativeHint : int32_t
	{
		ReorientCamera = 1,
		Illegal = 2,
		UnequipItem = 4,
		CreateObstacleWhenRestricted = 8,
		UseDefaultBoneCollisions = 16,
		ImmuneToStagger = 32,
		UnequipItemInstant = 64,
		AnimatedCamera = 128,
		InterestingCamera = 256,
	};

	// Size: 0x4
	enum class EAgilityActionPerformance : int32_t
	{
		AbortWhenOpportunityLost = 1,
		AbortWhenInputLost = 2,
		DismountWhenAborted = 4,
	};

	// Size: 0x4
	enum class EAgilityActionReferencePointStepFlag : int32_t
	{
		IgnoreRotation = 1,
		IgnoreTranslation = 2,
		IgnoreRotationIfIdentity = 4,
		IgnoreTranslationIfZero = 8,
		IgnoreTranslationsOnPositiveAxes = 16,
		IgnoreTranslationsOnNegativeAxes = 32,
		IgnoreTranslationIfConditionTrue = 64,
		IgnoreRotationIfConditionTrue = 128,
		IgnoreTranslationIfConditionFalse = 256,
		IgnoreRotationIfConditionFalse = 512,
	};

	// Size: 0x4
	enum class EAgilityActionRequirement : int32_t
	{
		RequireBeingGrounded = 1,
	};

	// Size: 0x4
	enum class EAgilityActionRestriction : int32_t
	{
		CombatNearby = 1,
		ReloadPrioritizedWhenCombatNearby = 2,
		CoreLogic = 4,
	};

	// Size: 0x1
	enum class EAgilityActionState : int8_t
	{
		NotAvailable = 0,
		OpportunityAvailable = 1,
		Performing = 2,
	};

	// Size: 0x1
	enum class EAgilityActionTransitionType : int8_t
	{
		Instant = 0,
		Timed = 1,
		AnimationDriven = 2,
		ApproachingMovement = 3,
		Launch = 4,
	};

	// Size: 0x1
	enum class EAgilityGoalIssuePolicy : int8_t
	{
		Input = 0,
		Automatic = 1,
		InputOrAutomatic = 2,
	};

	// Size: 0x4
	enum class EAgilityStartingStance : int32_t
	{
		Crouch_Idle = 0,
		Crouch_Walking = 1,
		Standing_Idle = 2,
		Standing_Walking = 3,
		Standing_Sprinting = 4,
	};

	// Size: 0x4
	enum class EAligningMovementIssuer : int32_t
	{
		Unknown = 0,
		Block = 1,
		MeleeAttack = 2,
		ItemThrow = 3,
		Grab = 4,
		CombatRush = 5,
		Sidestep = 6,
		Parry = 7,
		Doors = 8,
		CloseCombatPairedAction = 9,
		AttackFromAbove = 10,
		Pickpocket = 11,
		PrivateSpaceReaction = 12,
		Stumble = 13,
		VaultAttack = 14,
		FakeSurrender = 15,
	};

	// Size: 0x1
	enum class EAnimationActAbortCause : int8_t
	{
		Default = 0,
		ConcreteBag = 1,
		ActiveBluff = 2,
		PhoneDart = 3,
		Blinded = 4,
		Combat = 5,
	};

	// Size: 0x1
	enum class EAnimationActAbortReason : int8_t
	{
		None = 0,
		Urgent = 1,
		NonUrgent = 2,
		Snap = 3,
	};

	// Size: 0x1
	enum class EAnimationActLoopStance : int8_t
	{
		Standing = 0,
		Crouched = 1,
	};

	// Size: 0x1
	enum class EAnimationAttackFromAboveType : int8_t
	{
		Falling = 0,
		Edge = 1,
		Railing = 2,
		Hang = 3,
		Sidle = 4,
	};

	// Size: 0x1
	enum class EAnimationCombatState : int8_t
	{
		None = 0,
		InCombat = 1,
	};

	// Size: 0x1
	enum class EAnimationDashState : int8_t
	{
		NoDash = 0,
		Dashing_StandToCrouch = 1,
		Dashing_StandToStand = 2,
		Dashing_CrouchToCrouch = 3,
		Dashing_CrouchToStand = 4,
		Dashing_Combat = 5,
	};

	// Size: 0x1
	enum class EAnimationDazeType : int8_t
	{
		Smoke = 0,
		Electric = 1,
		Vision = 2,
		Physical = 3,
		Auditory = 4,
		TrapSetpiece = 5,
		BodyPartWeakPoint = 6,
		Glue = 7,
		Oil = 8,
	};

	// Size: 0x1
	enum class EAnimationEnvironmentalLockState : int8_t
	{
		Unlocked = 0,
		Sit_100cm = 1,
		Sit_020cm = 2,
		Sit_000cm = 3,
		Sit_Stool_080cm = 4,
		Sit_Chair = 5,
		Sit_Couch = 6,
		Lean_120cm = 7,
		Lean_100cm = 8,
		Lean_075cm = 9,
		Lean_Wall = 10,
		Stand = 11,
	};

	// Size: 0x1
	enum class EAnimationFirearmArmorHitState : int8_t
	{
		NoArmor = 0,
		ArmorHit = 1,
		ArmorDestroyed = 2,
	};

	// Size: 0x1
	enum class EAnimationFirearmDisarmSource : int8_t
	{
		CoreLogic = 0,
		HitReaction = 1,
		Stagger = 2,
	};

	// Size: 0x1
	enum class EAnimationFirearmPosture : int8_t
	{
		None = 0,
		Lowered = 1,
		Primed = 2,
		Raised = 3,
		AboveHead = 4,
		BlindFiringLeft = 5,
		BlindFiringRight = 6,
		LeaningLeft = 7,
		LeaningRight = 8,
	};

	// Size: 0x1
	enum class EAnimationGrabBreakFreeType : int8_t
	{
		None = 0,
		RegularGrab = 1,
		GrabRush = 2,
	};

	// Size: 0x1
	enum class EAnimationGrabStep : int8_t
	{
		ThrowingFromAttack = 0,
		RedirectThrow = 1,
		PreparingGrab = 2,
		Grabbing = 3,
		FailingGrab = 4,
		BreakingFree = 5,
		Throwing = 6,
		Attacking = 7,
		Rushing = 8,
		RushingImpact = 9,
		Taunting = 10,
	};

	// Size: 0x1
	enum class EAnimationGrabbedStep : int8_t
	{
		BeingThrownFromAttack = 0,
		PreparingGrab = 1,
		Grabbing = 2,
		Throwing = 3,
		BreakingFree = 4,
		BeingRedirectThrown = 5,
		BeingRushed = 6,
		GettingHit = 7,
		Unused_2 = 8,
		GettingShot = 9,
	};

	// Size: 0x1
	enum class EAnimationHitReactionSource : int8_t
	{
		FireArm = 0,
		MeleeImpact = 1,
		Throwable = 2,
		Explosion = 3,
	};

	// Size: 0x1
	enum class EAnimationHumanoidHitStrength : int8_t
	{
		Light = 0,
		Heavy = 1,
	};

	// Size: 0x1
	enum class EAnimationItemState : int8_t
	{
		Unequipped = 0,
		Equipped = 1,
		Equipping = 2,
		Unequipping = 3,
		Reloading = 4,
		Chambering = 5,
		Unused2 = 6,
		PickingUp = 7,
		Dropping = 8,
	};

	// Size: 0x1
	enum class EAnimationLocomotionAgility : int8_t
	{
		None = 0,
		WallLedgeHang = 1,
		OpenLedgeHang = 2,
		LedgeSidle = 3,
		Ladder = 4,
		Drainpipe = 5,
		ZipLine = 6,
	};

	// Size: 0x1
	enum class EAnimationLocomotionApproach : int8_t
	{
		None = 0,
		Approaching = 1,
	};

	// Size: 0x1
	enum class EAnimationLocomotionContext : int8_t
	{
		Formal = 0,
		Casual = 1,
		Combat = 2,
	};

	// Size: 0x1
	enum class EAnimationLocomotionCover : int8_t
	{
		None = 0,
		RegularCover = 1,
		MovableCover = 2,
	};

	// Size: 0x1
	enum class EAnimationLocomotionDash : int8_t
	{
		None = 0,
		Dashing = 1,
	};

	// Size: 0x1
	enum class EAnimationLocomotionDisoriented : int8_t
	{
		None = 0,
		Disoriented = 1,
	};

	// Size: 0x1
	enum class EAnimationLocomotionEquippedItem : int8_t
	{
		None = 0,
		Firearm = 1,
		Throwable = 2,
	};

	// Size: 0x1
	enum class EAnimationLocomotionFacing : int8_t
	{
		TrajectoryForward = 0,
		Strafing = 1,
	};

	// Size: 0x1
	enum class EAnimationLocomotionGameplayArea : int8_t
	{
		Social = 0,
		SoftTrespassing = 1,
		Trespassing = 2,
		LicenseToKill = 3,
	};

	// Size: 0x1
	enum class EAnimationLocomotionSpeed : int8_t
	{
		Slow = 0,
		Medium = 1,
		Fast = 2,
	};

	// Size: 0x1
	enum class EAnimationLocomotionStance : int8_t
	{
		Standing = 0,
		Crouching = 1,
	};

	// Size: 0x1
	enum class EAnimationLocomotionStateType : int8_t
	{
		Speed = 0,
		Style = 1,
		Stance = 2,
		Facing = 3,
		EquippedItem = 4,
		Cover = 5,
		Dash = 6,
		Approach = 7,
		Agility = 8,
		GameplayArea = 9,
		PlayerStyle = 10,
		Combat = 11,
		Disoriented = 12,
	};

	// Size: 0x1
	enum class EAnimationLocomotionStyle : int8_t
	{
		Casual = 0,
		Tense = 1,
		CloseCombat = 2,
		AmbientSearch_NPC = 3,
		RangedCombat = 4,
		Panic = 5,
	};

	// Size: 0x1
	enum class EAnimationParryStep : int8_t
	{
		None = 0,
		Attacking = 1,
		Impacting = 2,
		Failing = 3,
		Staggered = 4,
	};

	// Size: 0x4
	enum class EAnimationPayloadEvent : int32_t
	{
		OnFirearmHitReaction = 0,
		OnItemEquip = 1,
	};

	// Size: 0x1
	enum class EAnimationStumbleImpactStrength : int8_t
	{
		Light = 0,
		Heavy = 1,
	};

	// Size: 0x1
	enum class EApproachMovementFinishPolicy : int8_t
	{
		OnlyOwnSource = 0,
		AnySource = 1,
	};

	// Size: 0x1
	enum class EApproachPathFailReason : int8_t
	{
		None = 0,
		StartLocationNoNavmesh = 1,
		EndLocationNoNavmesh = 2,
		PathNotFound = 3,
		PathTooShort = 4,
	};

	// Size: 0x1
	enum class EArchetypeRoleAvailabilityType : int8_t
	{
		Default = 0,
		Always = 1,
		Never = 2,
	};

	// Size: 0x4
	enum class EAttackFromAboveState : int32_t
	{
		None = 0,
		Jump = 1,
		Impact = 2,
	};

	// Size: 0x4
	enum class EAttackFromAboveType : int32_t
	{
		Invalid = -1,
		Falling = 0,
		Edge = 1,
		Railing = 2,
		Hang = 3,
		Sidle = 4,
		Zipline = 5,
	};

	// Size: 0x1
	enum class EBasCharacterSourceType : int8_t
	{
		Self = 0,
		TargetEnemy = 1,
		AnotherNPC = 2,
		None = 3,
	};

	// Size: 0x1
	enum class EBasValueComparisonOperationType : int8_t
	{
		Equal = 0,
		NotEqual = 1,
		Greater = 2,
		GreaterOrEqual = 3,
		Less = 4,
		LessOrEqual = 5,
	};

	// Size: 0x1
	enum class EBlastFieldComponentType : int8_t
	{
		WakeUpAndKinematic = 0,
		PhysicsImpulse = 1,
		Destruction = 2,
		ClothImpulse = 3,
		GameplayEvent = 4,
	};

	// Size: 0x1
	enum class EBlastFieldDestructionType : int8_t
	{
		Impact = 0,
		Explosion = 1,
	};

	// Size: 0x1
	enum class EBlastFieldForceDirectionType : int8_t
	{
		BlastFieldTransform = 0,
		CustomValue = 1,
	};

	// Size: 0x1
	enum class EBlastFieldImpulseForceApplicationType : int8_t
	{
		CenterOfMass = 0,
		BoundingBoxCenter = 1,
		ProjectionToBoundingBox = 2,
	};

	// Size: 0x1
	enum class EBlastFieldSensorShapeType : int8_t
	{
		Sphere = 0,
		Box = 1,
	};

	// Size: 0x1
	enum class EBlastFieldSourceType : int8_t
	{
		Unknown = 0,
		CoreLogic = 1,
		Projectiles = 2,
		Stumbles = 3,
		PairedActions = 4,
		MeleeAttacks = 5,
	};

	// Size: 0x4
	enum class EBossEncounterPhase : int32_t
	{
		PhaseOne = 0,
		PhaseTwo = 1,
		PhaseThree = 2,
		PhaseFour = 3,
	};

	// Size: 0x1
	enum class EBossType : int8_t
	{
		Assassin = 0,
		Jaws = 1,
		Damien = 2,
		ExoDamien = 3,
	};

	// Size: 0x4
	enum class ECameraMeleeTargetType : int32_t
	{
		CurrentTarget = 0,
		FinisherTarget = 1,
		CurrentTargetMidpoint = 2,
	};

	// Size: 0x4
	enum class ECharacterProviderCharacterType : int32_t
	{
		NPC = 0,
		Player = 1,
		VoiceOver = 2,
	};

	// Size: 0x1
	enum class ECinematicTransitionApproachTargetType : int8_t
	{
		AnimationTrack = 0,
		TrajectoryTrack = 1,
	};

	// Size: 0x4
	enum class ECinematicsDebugSequenceTargetEntityType : int32_t
	{
		HumanoidSequenceController = 0,
		VehicleSequenceController = 1,
		Others = 2,
	};

	// Size: 0x4
	enum class ECinematicsDebugSequenceTrackType : int32_t
	{
		AnimationClip = 0,
		AnimationNetworkClip = 1,
		AnimationNetworkParameter = 2,
		AudioSequence = 3,
		CameraLensPreset = 4,
		CameraSequenceClip = 5,
		EntityProperty = 6,
		HumanoidControl = 7,
		VehicleControl = 8,
		InjectedAnimationNetwork = 9,
		Trajectory = 10,
		Undefined = 11,
	};

	// Size: 0x1
	enum class EClimbAction : int8_t
	{
		None = -1,
		LedgeHangMount = 0,
		LedgeHangDismount = 1,
		LedgeHangToLedgeHang = 2,
		LedgeHangToLedgeHangSharpTurnOut = 3,
		LedgeHangToLedgeHangSharpTurnIn = 4,
		LedgeHangToLedgeHangSoftTurn = 5,
		LedgeHangToSidle = 6,
		LedgeHangToLadder = 7,
		LedgeHangToDrainpipe = 8,
		LedgeHangToRailing = 9,
		LedgeHangToWindow = 10,
		SidleMount = 11,
		SidleDismount = 12,
		SidleToLedgeHang = 13,
		SidleToSidle = 14,
		SidleToSidleSwap = 15,
		SidleToSidleSharpTurnOut = 16,
		SidleToSidleSharpTurnIn = 17,
		SidleToSidleSoftTurn = 18,
		SidleToLadder = 19,
		SidleToDrainpipe = 20,
		SidleToRailingPerpendicular = 21,
		SidleToRailingCollinear = 22,
		SidleToWindowPerpendicular = 23,
		SidleToWindowCollinear = 24,
		LadderMount = 25,
		LadderDismount = 26,
		LadderToLedgeHang = 27,
		LadderToSidle = 28,
		LadderToLadder = 29,
		LadderToDrainpipe = 30,
		DrainpipeMount = 31,
		DrainpipeDismount = 32,
		DrainpipeToLedgeHang = 33,
		DrainpipeToSidle = 34,
		DrainpipeToLadder = 35,
		DrainpipeToDrainpipe = 36,
		RailingToLedgeHang = 37,
		RailingToSidle = 38,
		WindowToLedgeHang = 39,
		WindowToSidle = 40,
		EdgeStepback = 41,
	};

	// Size: 0x1
	enum class EClimbDirection : int8_t
	{
		None = -1,
		Up = 0,
		Down = 1,
		Right = 2,
		Left = 3,
	};

	// Size: 0x1
	enum class EClimbObstacleSide : int8_t
	{
		None = 0,
		Right = 1,
		Left = 2,
	};

	// Size: 0x1
	enum class EClimbingState : int8_t
	{
		NotClimbing = 0,
		CurrentlyClimbing = 1,
		EnteringClimbFromBelow = 2,
		EnteringClimbFromAbove = 3,
		EnteringClimbFromLeft = 4,
		EnteringClimbFromRight = 5,
		LeavingClimbToBelow = 6,
		LeavingClimbToAbove = 7,
		LeavingClimbToLeft = 8,
		LeavingClimbToRight = 9,
	};

	// Size: 0x4
	enum class ECloseCombatEventType : int32_t
	{
		LightAttack = 0,
		HeavyAttack = 1,
		Parry = 2,
		Grab = 3,
		PairedAction = 4,
		Throw = 5,
		Sidestep = 6,
		VaultAttack = 7,
		Block = 8,
		Invalid = -1,
	};

	// Size: 0x4
	enum class ECloseCombatPairedActionAvailability : int32_t
	{
		Always = 0,
		Mandatory = 1,
		Forbidden = 2,
	};

	// Size: 0x1
	enum class ECloseCombatPairedActionBlastFieldTriggerEvent : int8_t
	{
		AttackImpact = 0,
		DamageVictim = 1,
	};

	// Size: 0x1
	enum class ECloseCombatPairedActionBlastFieldTriggerOrientation : int8_t
	{
		CharacterForward = 0,
		BoneVelocity = 1,
		BoneOrientation = 2,
		ContextualTarget = 3,
	};

	// Size: 0x4
	enum class ECloseCombatPairedActionCheckResult : int32_t
	{
		NotEvaluated = 0,
		Rejected_InstigatorIsCombatRushingAndActionIsNotAvailable = 1,
		Rejected_InstigatorIsNotCombatRushingAndActionIsNotAvailable = 2,
		Rejected_VictimIsFurtherThanMaxDistance = 3,
		Rejected_RequiredContextualTargetWasNotFound = 4,
		Rejected_ContextualTargetIsFurtherAwayThanBestOne = 5,
		Rejected_NoClearPathFromInstigatorToSafeArea = 6,
		Rejected_NoClearPathFromVictimToSafeArea = 7,
		Rejected_InstigatorDoesntHonorRequiredDirectionToVictim = 8,
		Rejected_VictimIsNotOnFloor = 9,
		Rejected_VictimOnFloor = 10,
		Rejected_VictimIsNotStaggerStunned = 11,
		Rejected_VictimIsStaggerStunned = 12,
		Rejected_VictimIsNotParryStunned = 13,
		Rejected_VictimIsParryStunned = 14,
		Rejected_InstigatorIsNotOnStairs = 15,
		Rejected_InstigatorIsOnStairs = 16,
		Rejected_VictimIsNotOnStairs = 17,
		Rejected_VictimIsOnStairs = 18,
		Rejected_InstigatorKeywordRequirementsNotHonored = 19,
		Accepted_ValidCandidate = 20,
		Selected = 21,
	};

	// Size: 0x1
	enum class ECloseCombatPairedActionContextualTargetCheckResult : int8_t
	{
		NotEvaluated = 0,
		Rejected_InstigatorIsNotPlayer = 1,
		Rejected_MissingVictimsCache = 2,
		Rejected_InvalidContextualTargetType = 3,
		Rejected_MissingSelectedItemData = 4,
		Rejected_NotInStairs = 5,
		Rejected_NotInSlopeStairs = 6,
		Rejected_InvalidConfigVictimDirectionToTarget = 7,
		Rejected_ExpectedTargetNotFound = 8,
		Rejected_WallIsInvalid = 9,
		Rejected_WallIsLowCover = 10,
		Rejected_WallIsHighWall = 11,
		Rejected_WallWidthIsTooLow = 12,
		Rejected_BullrusheableWallIgnored = 13,
		Rejected_InstigatorTooCloseToVictim = 14,
		Rejected_VictimTooFarFromTarget = 15,
		Rejected_VictimTooFarFromTargetOnLateralDisplacement = 16,
		Rejected_AngleBetweenInstigatorForwardAndDirectionToTarget = 17,
		Rejected_AngleBetweenVictimForwardAndDirectionToTarget = 18,
		Rejected_AngleBetweenInstigatorVictimVectorAndTargetOrientation = 19,
		Rejected_TargetOutsideSearchDirection = 20,
		Accepted_ValidTarget = 21,
		Accepted_BestTarget = 22,
	};

	// Size: 0x4
	enum class ECloseCombatPairedActionContextualTargetPriority : int32_t
	{
		CloserToVictimByDistance = 0,
		CloserToSearchDirectionByAngle = 1,
	};

	// Size: 0x4
	enum class ECloseCombatPairedActionContextualTargetRestriction : int32_t
	{
		PreferCurrentTargetIfSet = 0,
		TryUseOnlyCurrentTargetIfSet = 1,
		IgnoreCurrentTarget = 2,
	};

	// Size: 0x4
	enum class ECloseCombatPairedActionContextualTargetType : int32_t
	{
		None = 0,
		Wall = 1,
		LowCover = 2,
		Item = 3,
		Guide = 4,
		OffmetricObstacle = 5,
		Stairs = 6,
	};

	// Size: 0x4
	enum class ECloseCombatPairedActionPhase : int32_t
	{
		Preparing = 0,
		Executing = 1,
		Count = 2,
	};

	// Size: 0x4
	enum class ECloseCombatPairedActionType : int32_t
	{
		Finisher_Melee = 0,
		SilentTakedown = 1,
		Finisher_Armed = 2,
		Finisher_TaserTakedown = 3,
		ContextualFinisher_LowCover = 4,
		ContextualFinisher_Wall = 5,
		ContextualFinisher_Item = 6,
		Finisher_Disarm = 7,
		UnusedType_1 = 8,
		Finisher_Custom = 9,
		Contextual_MeleeAttack = 10,
		FakeSurrender = 11,
		DisarmAttack = 12,
		GrabRushOffTheLedge = 13,
		ContextualTargetFinisher = 14,
		Contextual_ThrowAttack = 15,
		BrutalAttack = 16,
	};

	// Size: 0x4
	enum class ECloseCombatReactionCounterType : int32_t
	{
		MeleeCounter = 0,
		Grab = 1,
		MeleeCombo = 2,
	};

	// Size: 0x1
	enum class ECloseCombatStance : int8_t
	{
		Default = 0,
		Parry = 1,
		Aggressive = 2,
		NotInCloseCombat = 3,
		Relaxed = 4,
	};

	// Size: 0x4
	enum class ECombatRushTargetCriteria : int32_t
	{
		NoValidTarget = 0,
		NoMeleeTargetsAvailable = 1,
		OngoingCombatRushTarget = 2,
		InputWinner = 3,
		ConfrontationTarget = 4,
		OnScreen = 5,
		InRange = 6,
		ClosestTarget = 7,
		TargetIsImmune = 8,
		TargetUnreachable = 9,
	};

	// Size: 0x2
	enum class ECombatRushType : int16_t
	{
		Strike = 0,
		SilentTakedown = 1,
		RushAndDisarm = 2,
		Finisher = 3,
		ContextualAttack = 4,
		DisarmAttack = 5,
		Grab = 6,
		RushToAttackFromAbove = 7,
	};

	// Size: 0x1
	enum class EConfrontationEndReason : int8_t
	{
		Failed = 0,
		FakeSurrender = 1,
		Gadget = 2,
		Bluff = 3,
	};

	// Size: 0x1
	enum class EConfrontationUpperbodyAnimCategoryType : int8_t
	{
		None = -1,
		Apologetic = 0,
		Confident = 1,
		Nonchalant = 2,
	};

	// Size: 0x1
	enum class EConfrontationUpperbodyAnimType : int8_t
	{
		None = 0,
		ActiveBluffEnabled = 1,
		ActiveBluffDone = 2,
		ConfrontationBluffEnabled = 3,
		ConfrontationBluffDone = 4,
	};

	// Size: 0x1
	enum class EContextualJumpLandingSurfaceType : int8_t
	{
		OverWall = 0,
		LedgeOverhang = 1,
		OnLedgeHang = 2,
	};

	// Size: 0x1
	enum class EContextualJumpLandingType : int8_t
	{
		Regular = 0,
		Sketchy = 1,
	};

	// Size: 0x1
	enum class EContextualJumpType : int8_t
	{
		None = 0,
		Jump = 1,
		JumpDown = 2,
		JumpUpAndClimb = 3,
	};

	// Size: 0x4
	enum class EContextualWallType : int32_t
	{
		Wall = 0,
		LowCover = 1,
		Invalid = 2,
	};

	// Size: 0x4
	enum class EConversationChoiceResult : int32_t
	{
		Option1 = 0,
		Option2 = 1,
		Option3 = 2,
		Option4 = 3,
		TimedOut = 4,
		Invalid = 5,
	};

	// Size: 0x4
	enum class EConversationChoiceType : int32_t
	{
		Flavor = 0,
		Progression = 1,
		Leave = 2,
	};

	// Size: 0x4
	enum class ECornerType : int32_t
	{
		Concave = 0,
		Convex = 1,
		None = 2,
	};

	// Size: 0x1
	enum class ECoverCorner : int8_t
	{
		LeftCorner = 0,
		RightCorner = 1,
		NoCorner = 2,
	};

	// Size: 0x1
	enum class ECoverCornerTurnAnimState : int8_t
	{
		NoTurning = 0,
		Turning = 1,
	};

	// Size: 0x1
	enum class ECoverEnterSource : int8_t
	{
		None = 0,
		WalkIn = 1,
		TransitionToNewAdjacentCover = 2,
		TransitionToUpdatedCover = 3,
		Dash = 4,
		CoverCornerTurn = 5,
		Cinematics = 6,
		AimTransition = 7,
		CoverCornerTransition = 8,
	};

	// Size: 0x1
	enum class ECoverExitSource : int8_t
	{
		None = 0,
		WalkOut = 1,
		DashEndedOutFarFromCover = 2,
		StandupInLowCover = 3,
		Agility = 4,
		Confrontation = 5,
		MarkupChangedAndCoverNotAllowed = 6,
		Acceleration = 7,
		AimTransition = 8,
		CombatRush = 9,
		CoverSystemDisabled = 10,
		SplineInvalidPoint = 11,
		SplineWalkOut = 12,
		CoverCorner = 13,
		UntaggedCoverCorner = 14,
		Interaction = 15,
		FreeDash = 16,
		Staggered = 17,
		CloseCombatAction = 18,
		CloseCombatHitReaction = 19,
		AlignmentMovement = 20,
		DestroyedMarkup = 21,
	};

	// Size: 0x1
	enum class ECoverFacingDir : int8_t
	{
		Left = 0,
		Right = 1,
	};

	// Size: 0x1
	enum class ECoverHeight : int8_t
	{
		None = 0,
		LowCover = 1,
		HighCover = 2,
	};

	// Size: 0x1
	enum class ECoverLeanAimingTransitionType : int8_t
	{
		None = 0,
		ToOutOfCover = 1,
		ToCover = 2,
	};

	// Size: 0x1
	enum class ECoverState : int8_t
	{
		None = 0,
		GoingOutOfCover = 1,
		GoingIntoCover = 2,
		BehindCover = 3,
		OutsideCover = 4,
	};

	// Size: 0x1
	enum class ECoverStayInLineCornerConstraint : int8_t
	{
		NoCornerConstraints = 0,
		StopAtTaggedCorners = 1,
	};

	// Size: 0x1
	enum class ECoverStayInLineInputConstraint : int8_t
	{
		NoInputConstraints = 0,
		OnlyInputToRightEnd = 1,
		OnlyInputToLeftEnd = 2,
	};

	// Size: 0x4
	enum class ECrouchingSubsate : int32_t
	{
		eCS_NotCrouching = 0,
		eCS_Idle = 1,
		eCS_Aiming = 2,
		eCS_Moving = 3,
		eCS_MovingAndAiming = 4,
	};

	// Size: 0x1
	enum class EDamageType : int8_t
	{
		Projectile = 1,
		CloseCombat = 2,
		Fall = 3,
		Script = 4,
		Stumble = 5,
		ThrownItem = 6,
		CoverTakedown = 7,
		AttackFromAbove = 8,
		VaultDisarm = 9,
		VaultFinisher = 10,
		Explosion = 11,
		CrushedByObject = 12,
		Vehicle = 13,
		Electric = 14,
		Stealth = 15,
		Environmental = 16,
		RailingDeath = 17,
		OverTheLedge = 18,
		FlashMine = 19,
	};

	// Size: 0x4
	enum class EDangerAwarenessType : int32_t
	{
		Hazard = 0,
		PotentialThreat = 1,
		NonLethalCombat = 2,
		LethalCombat = 3,
	};

	// Size: 0x4
	enum class EDangerLevel : int32_t
	{
		EnemiesUnaware = 0,
		EnemiesSearching = 1,
		InCombat = 2,
	};

	// Size: 0x4
	enum class EDashDataSource : int32_t
	{
		Player = 0,
		GpwInput = 1,
	};

	// Size: 0x4
	enum class EDashSearchBoxValidationResult : int32_t
	{
		Outside = 0,
		InsideFrontBox = 1,
		InsideBackBox = 2,
	};

	// Size: 0x4
	enum class EDashTargetCornerType : int32_t
	{
		None = 0,
		Left = 1,
		Right = 2,
	};

	// Size: 0x4
	enum class EDashTargetType : int32_t
	{
		None = 0,
		LowCover = 1,
		Wall = 2,
	};

	// Size: 0x4
	enum class EDashTargetingSearchConfigType : int32_t
	{
		Default = 0,
		ParallelCoverSwap = 1,
		NoInput = 2,
	};

	// Size: 0x4
	enum class EDashType : int32_t
	{
		None = 0,
		ToCover = 1,
		CoverSwap = 2,
		Free = 3,
	};

	// Size: 0x4
	enum class EDashingType : int32_t
	{
		None = 0,
		DashToCover = 1,
		DashToCoverSlide = 2,
		Free = 3,
	};

	// Size: 0x1
	enum class EDeathVariationType : int8_t
	{
		Default = 0,
		StumbleDeath_WallImpact = 1,
		StumbleDeath_LowcoverImpact = 2,
		StumbleDeath_Railing = 3,
		StumbleDeath_LowCoverRoll = 4,
	};

	// Size: 0x1
	enum class EDebugAgilityActionOpportunityFailReason : int8_t
	{
		None = 0,
		HumanoidStateRequirement = 1,
		Allowance = 2,
		Requirements = 3,
		AllowedOnCandidates = 4,
		ConnectionRequirements = 5,
		OpportunityConditions = 6,
		Count = 7,
	};

	// Size: 0x1
	enum class EDebugAgilityActionOpportunityPendingReason : int8_t
	{
		None = 0,
		TriggerConditions = 1,
		Interruption = 2,
		GadgetView = 3,
		Count = 4,
	};

	// Size: 0x1
	enum class EDebugAgilityActionOpportunityState : int8_t
	{
		None = 0,
		Failed = 1,
		Restricted = 2,
		Pending = 3,
		Performable = 4,
		Performing = 5,
		Count = 6,
	};

	// Size: 0x4
	enum class EDebugNpcBehaviorType : int32_t
	{
		None = 0,
		FightFromCover = 1,
		FightFromCurrentPosition = 2,
		ThrowGrenade = 3,
	};

	// Size: 0x4
	enum class EDebugNpcCombatLocomotionType : int32_t
	{
		Default = 0,
		Run = 1,
		StrafeWalk = 2,
	};

	// Size: 0x1
	enum class EDefenseAction : int8_t
	{
		None = 0,
		Activate = 1,
		Deactivate = 2,
	};

	// Size: 0x4
	enum class EDefenseType : int32_t
	{
		MeleeAttack = 0,
		Grab = 1,
		RedirectThrow = 2,
		StumbleHumanoidImpact = 3,
		Explosion = 4,
	};

	// Size: 0x1
	enum class EDetainState : int8_t
	{
		None = 0,
		Starting = 1,
		Idle = 2,
		Struggle = 3,
		Attack = 4,
		HitReaction = 5,
		BreakingFree = 6,
		Failed = 7,
	};

	// Size: 0x1
	enum class EDialogueActivityLevel : int8_t
	{
		PlayEssential = 0,
		CombatGameplay = 1,
		CombatAmbient = 2,
		TensionGameplay = 3,
		TensionAmbient = 4,
		CalmGameplay = 5,
		CalmAmbient = 6,
		Vocalization = -6,
		Ignore = -1,
	};

	// Size: 0x2
	enum class EDialogueFactOp : int16_t
	{
		Add = 0,
		Subtract = 1,
		Set = 2,
	};

	// Size: 0x1
	enum class EDisorientationSourceType : int8_t
	{
		PoisonDart = 0,
		GasLeak = 1,
		MigraineDevice = 2,
		Blinded = 3,
	};

	// Size: 0x4
	enum class EDistractionSource : int32_t
	{
		Default = 0,
		Whistle = 1,
		DartGun = 2,
		SilentTakedown = 3,
		Laptop = 4,
		Radio = 5,
		AC = 6,
		DoorKick = 7,
		Footsteps = 8,
		GardenHose = 9,
		Gadget_Smoke = 10,
		Gadget_FlashMine = 11,
		Gadget_FlashMineHumanTarget = 12,
		ElectrifiedHuman = 13,
		DisorientedGeneric = 14,
		PoisonDart = 15,
		Blinded = 16,
		Shockwave = 17,
		IncapacitatedBody = 18,
		Explosions = 27,
		BullectImpact = 28,
		Touch = 29,
		SecurityCamera = 30,
		Fixable = 31,
		SpotDisoriented = 32,
	};

	// Size: 0x4
	enum class EDoorInitialState : int32_t
	{
		Closed = 0,
		OpenForward = 1,
		OpenBack = 2,
		Locked = 3,
		Sabotaged = 4,
	};

	// Size: 0x1
	enum class EEarlyOutCapabilityIssuer : int8_t
	{
		Unknown = 0,
		Dash = 1,
		MeleeAttack = 2,
		FakeSurrender = 3,
		ContextualJump = 4,
		Landing = 5,
		Vaulting = 6,
		Scaling = 7,
		AgilityAction = 8,
		GenericAnimDrivenAction = 9,
		TurningAtCoverCorner = 10,
		UseDoor = 11,
		PairedActionInstigator = 12,
		PairedActionVictim = 13,
		PickUp = 14,
		EnterLadder = 15,
		LeaveLadder = 16,
		Pickpocket = 17,
		Grab = 18,
		Parry = 19,
		ItemThrow = 20,
		GadgetActivation = 21,
		CombatRush = 22,
		FirearmReload = 23,
		Stagger = 24,
		Sidestep = 25,
		Block = 26,
		CoverTakedown = 27,
		AttackFromAbove = 28,
	};

	// Size: 0x1
	enum class EEavesdropUpperbodyAnimType : int8_t
	{
		None = 0,
		PlayerStillStarted = 1,
		PlayerStillEnded = 2,
	};

	// Size: 0x4
	enum class EEnableDisableNPCAbilityType : int32_t
	{
		Vision = 0,
		Hearing = 1,
		Agility = 2,
		DistractionReaction = 3,
		PrivateSpace = 4,
		Crouch = 5,
	};

	// Size: 0x1
	enum class EEntryLocationType : int8_t
	{
		Default = 0,
		Archway = 1,
		StairsUp = 2,
		StairsDown = 3,
	};

	// Size: 0x4
	enum class EEnvironmentMarkupAgilityType : int32_t
	{
		None = 0,
		Vaultable = 1,
		Scalable = 2,
		Jump = 3,
		GenericAnimationDrivenAction = 4,
	};

	// Size: 0x4
	enum class EEnvironmentMarkupCoverType : int32_t
	{
		None = 0,
		Low = 1,
		High = 2,
	};

	// Size: 0x4
	enum class EEnvironmentMarkupLevelDesignBool : int32_t
	{
		eEMLDB_Automatic = 0,
		eEMLDB_True = 1,
		eEMLDB_False = 2,
	};

	// Size: 0x4
	enum class EEnvironmentalLockState : int32_t
	{
		Unlocked = 0,
		Sit_100cm = 1,
		Sit_020cm = 2,
		Sit_000cm = 3,
		Sit_Stool_080cm = 4,
		Sit_Chair = 5,
		Sit_Couch = 6,
		Lean_120cm = 7,
		Lean_100cm = 8,
		Lean_075cm = 9,
		Lean_Wall = 10,
		Stand = 11,
	};

	// Size: 0x1
	enum class EEvaluatorMode : int8_t
	{
		Add = 0,
		Multiply = 1,
		Multiply_SingleEval = 2,
	};

	// Size: 0x1
	enum class EFirearmDamageMultiplierFilter : int8_t
	{
		Always = 0,
		BodyPartWeakpoint = 1,
	};

	// Size: 0x1
	enum class EFirearmHumanoidHitState : int8_t
	{
		NoFlinch = 0,
		Flinch = 1,
		Stumble = 2,
		HeavyHit = 3,
		Stagger = 4,
		AnimationFullBody = 5,
	};

	// Size: 0x4
	enum class EFirearmPosture : int32_t
	{
		Lowered = 0,
		Primed = 1,
		Raised = 2,
		AboveHead = 3,
		BlindFiringLeft = 4,
		BlindFiringRight = 5,
		LeaningLeft = 6,
		LeaningRight = 7,
	};

	// Size: 0x4
	enum class EFootstepEventType : int32_t
	{
		Automatic = 0,
		Normal = 1,
		Stair = 2,
		Jump = 3,
		Land = 4,
		Slide = 5,
		Start = 6,
		Stop = 7,
		Turn = 8,
		Count = 9,
	};

	// Size: 0x1
	enum class EFootstepType : int8_t
	{
		Left = 0,
		Right = 1,
		Any = 2,
	};

	// Size: 0x4
	enum class EGadgetActivationSlot : int32_t
	{
		Slot1 = 0,
		Slot2 = 1,
		Slot3 = 2,
		Slot4 = 3,
	};

	// Size: 0x1
	enum class EGadgetDisabledFlag : int8_t
	{
		GadgetNotAssigned = 0,
		PlayerCantUseGadgets = 1,
		InCooldown = 2,
		CantBeUsedInArea = 3,
		UnusedEntry_0 = 4,
		NotEnoughResources = 5,
		InvalidTarget = 6,
		TargetOutOfRange = 7,
		Count = 8,
	};

	// Size: 0x1
	enum class EGadgetState : int8_t
	{
		None = 0,
		TapActivate = 1,
		HoldActivate = 2,
	};

	// Size: 0x1
	enum class EGadgetTargetInteractionType : int8_t
	{
		Tap = 0,
		Hold = 1,
		TapAndHold = 2,
	};

	// Size: 0x4
	enum class EGameplayAreaLocomotionContext : int32_t
	{
		Formal = 0,
		Casual = 1,
		Combat = 2,
	};

	// Size: 0x4
	enum class EGameplayAreaType : int32_t
	{
		Social = 0,
		SoftTrespassing = 1,
		Trespassing = 2,
		LicenseToKill = 3,
	};

	// Size: 0x4
	enum class EGoalPriorities : int32_t
	{
		HIGHEST = 0,
		STAGGER = 1,
		CONFRONTATION_OPT_IN = 2,
		LURE = 3,
		BLUFF = 4,
		ATTACK_FROM_ABOVE = 5,
		VAULT = 6,
		CONTEXTUAL_JUMP = 7,
		TURN_AT_COVER_CORNER = 8,
		AGILITY_ACTION = 9,
		SCALE = 10,
		DASH = 11,
		GENERIC_ANIM_DRIVEN_ACTION = 12,
		USE_DOOR = 13,
		GROUND_PATH_LOCOMOTION = 14,
		COMPLYING = 15,
		DROP_DOWN = 16,
		COMBATRUSH = 17,
		PROJECTILE_SIDESTEP = 18,
		ACTIVATE_GADGET = 19,
		MELEE_FINISHER = 20,
		PARRY = 21,
		PICKPOCKET = 22,
		GRAB = 23,
		BLOCK = 24,
		SIDESTEP = 25,
		COVER_TAKEDOWN = 26,
		CONTEXTUAL_ITEM_THROW = 27,
		ITEM_THROW = 28,
		JUMPING_AWAY_HAZARD = 29,
		MELEE_ATTACK = 30,
		COVER_TRANSITION = 31,
		ENTER_LADDER_CLIMB = 32,
		LEAVE_LADDER_CLIMB = 33,
		CROUCH = 34,
		UNCROUCH = 35,
		SET_FIREARM_POSTURE = 36,
		SET_THROWABLE_POSTURE = 37,
		CHANGE_CLOSECOMBAT_STANCE = 38,
		SET_AIM_TARGET = 39,
		START_STRAFING = 40,
		STOP_STRAFING = 41,
		START_ACCELERATING = 42,
		STOP_ACCELERATING = 43,
		GADGET_VIEW = 44,
		PICKUP_ITEM = 45,
		INTERACT = 46,
		ANIMATION_ACT = 47,
		LOOK_AT = 48,
		UNEQUIP_ITEM = 49,
		EQUIP_ITEM = 50,
		RELOAD_FIREARM = 51,
		FAKE_SURRENDER = 52,
		WHISTLE = 53,
		CAMERA_FOCUS = 54,
		PRIVATE_SPACE_INVADED_REACTION = 55,
		AGENCY_FOCUS = 56,
		LOWEST = 57,
		COUNT = 58,
	};

	// Size: 0x4
	enum class EGrabRushOffTheLedgeGroundPositionResult : int32_t
	{
		Invalid_NoGround = 0,
		Invalid_OutOfReach = 1,
		Invalid_NoNavMeshPoint = 2,
		Valid = 3,
	};

	// Size: 0x4
	enum class EGrabRushOffTheLedgeType : int32_t
	{
		Throw = 0,
		Jump = 1,
		Count = 2,
	};

	// Size: 0x4
	enum class EGrabStepFlags : int32_t
	{
		Taunting = 1,
		FailingGrab = 2,
		PreparingGrab = 4,
		Attacking = 8,
		Throwing = 16,
		PostThrowing = 32,
		BreakingFree = 64,
		Rushing = 128,
	};

	// Size: 0x4
	enum class EGrabThrowType : int32_t
	{
		None = 0,
		BasicThrow = 1,
		ThrowFromAttack = 2,
	};

	// Size: 0x4
	enum class EGrabVictimStatus : int32_t
	{
		Invalid = 0,
		Valid_PendingSuccessCheck = 1,
		Valid_FailedGrab = 2,
		Valid_SuccessfulGrab = 3,
	};

	// Size: 0x4
	enum class EGrabbingStep : int32_t
	{
		Taunting = 0,
		FailingGrab = 1,
		PreparingGrab = 2,
		Attacking = 3,
		Throwing = 4,
		PostThrowing = 5,
		BreakingFree = 6,
		Rushing = 7,
	};

	// Size: 0x4
	enum class EGuidanceLocomotionThresholdReachedHandlingType : int32_t
	{
		Disabled = 0,
		Systemic = 1,
	};

	// Size: 0x1
	enum class EGuideTakedownType : int8_t
	{
		None = 0,
		OpenLedgeHang = 1,
		OpenLedgeHangWithRailing = 2,
		WallLedgeHang = 3,
		WallLedgeHangWithRailing = 4,
		SidleWithRailingRight = 5,
		SidleWithRailingLeft = 6,
	};

	// Size: 0x4
	enum class EHazardSource : int32_t
	{
		Default = 0,
		Grenade = 1,
		Chandelier = 2,
		Spotlight = 3,
		Lift = 4,
		Pipe = 5,
		AirConditioner = 6,
		ConcreteBag = 7,
		SmokeBomb = 8,
	};

	// Size: 0x4
	enum class EHealingSource : int32_t
	{
		HealthRegen = 0,
		CoreLogic = 1,
	};

	// Size: 0x1
	enum class EHitReactionDefenseAction : int8_t
	{
		Ignore = 0,
		Enabled = 1,
		Disabled = 2,
	};

	// Size: 0x1
	enum class EHitReactionDisabledSkill : int8_t
	{
		Aim = 0,
		Shoot = 1,
		Sprint = 2,
		MeleeAttack = 3,
		Count = 4,
	};

	// Size: 0x1
	enum class EHitReactionSource : int8_t
	{
		FireArm = 0,
		MeleeImpact = 1,
		Throwable = 2,
		Explosion = 3,
	};

	// Size: 0x4
	enum class EHumanMovementCategory : int32_t
	{
		eHMCa_Ambient = 0,
		eHMCa_TacticalSearch = 1,
		eHMCa_CloseCombat = 2,
		eHMCa_RangedCombat = 3,
		eHMCa_AmbientSearch = 4,
	};

	// Size: 0x4
	enum class EHumanMovementContext : int32_t
	{
		eHMC_Walk = 0,
		eHMC_Run = 1,
		eHMC_Sprint = 2,
	};

	// Size: 0x4
	enum class EHumanoidAudioLocomotionContext : int32_t
	{
		Social = 0,
		Trespassing = 1,
		SoftTrespassing = 2,
		CloseCombat = 3,
		Aiming = 4,
	};

	// Size: 0x4
	enum class EHumanoidBodyPart : int32_t
	{
		None = 0,
		Torso = 1,
		Head = 2,
		LeftHand = 3,
		LeftLowerArm = 4,
		LeftUpperArm = 5,
		LeftShoulder = 6,
		LeftFoot = 7,
		LeftLowerLeg = 8,
		LeftUpperLeg = 9,
		RightHand = 10,
		RightLowerArm = 11,
		RightUpperArm = 12,
		RightShoulder = 13,
		RightFoot = 14,
		RightLowerLeg = 15,
		RightUpperLeg = 16,
		Weapon = 17,
	};

	// Size: 0x1
	enum class EHumanoidBoneCollisionPresetType : int8_t
	{
		Default = 0,
		Agility = 1,
	};

	// Size: 0x1
	enum class EHumanoidBoneTransformFlag : int8_t
	{
		UseCharacterRotation = 0,
		UseCharacterZ = 1,
	};

	// Size: 0x1
	enum class EHumanoidCapsuleDataType : int8_t
	{
		Stand = 0,
		Crouch = 1,
		Vault = 2,
		SqueezeThrough = 3,
		LedgeHang = 4,
		Ladder = 5,
	};

	// Size: 0x2
	enum class EHumanoidCollisionDisabledSource : int16_t
	{
		VehicleAttachment = 0,
		CoverTakedown = 1,
		Death = 2,
		CoreLogic = 3,
		GenericAnimDrivenAction = 4,
		AnimationEvents = 5,
		Unknown = 6,
		Climb = 7,
		Guide = 8,
		AttackFromAbove = 9,
	};

	// Size: 0x1
	enum class EHumanoidCollisionPresetType : int8_t
	{
		Default = 0,
		Agility = 1,
		VirtualCapsule = 2,
		AnimationAct = 3,
	};

	// Size: 0x1
	enum class EHumanoidDamageType : int8_t
	{
		Unknown = 0,
		Projectile = 1,
		CloseCombat = 2,
		Fall = 3,
		Script = 4,
		Stumble = 5,
		ThrownItem = 6,
		CoverTakedown = 7,
		AttackFromAbove = 8,
		Explosion = 9,
		VaultDisarm = 10,
		VaultFinisher = 11,
		CrushedByObject = 12,
		Vehicle = 13,
		Electric = 14,
		Stealth = 15,
		Environmental = 16,
		RailingDeath = 17,
		OverTheLedge = 18,
		FlashMine = 19,
	};

	// Size: 0x4
	enum class EHumanoidGoalInterruptReason : int32_t
	{
		Unknown = 0,
		Solver = 1,
		Issuer = 2,
		NoSkill = 3,
		AutomatedRemoval = 4,
		NoValidController = 5,
		OwnerKilled = 6,
		TargetedAction = 7,
		HitReaction = 8,
		Falling = 9,
		ReferencedIdentifierDestroyed = 10,
		InterceptedByScript = 11,
		MissingRequiredGoal = 12,
		InterruptedDuringEarlyOut = 13,
		Stagger = 14,
	};

	// Size: 0x4
	enum class EHumanoidLocomotionMovementPipeline : int32_t
	{
		Invalid = 0,
		AnimationDriven = 1,
		AnimationDrivenEnteringLadder = 2,
		AnimationDrivenJumping = 3,
		AnimationDrivenLanding = 4,
		AnimationDrivenScaling = 5,
		AnimationDrivenSequenceAnimDisplacement = 6,
		AnimationDrivenSequenceSpatialDisplacement = 7,
		AnimationDrivenStaggered = 8,
		AnimationDrivenVaulting = 9,
		Falling = 10,
		GameplayAligning = 11,
		IdleWithMotionPlan = 12,
		Idle = 13,
		Jumping = 14,
		OnGuide = 15,
		PathDrivenGroundLocomotion = 16,
		PlayerDrivenGroundLocomotion = 17,
		Sliding = 18,
		SpatialDriven = 19,
		SplineDriven = 20,
		Teleporting = 21,
		TeleportingInVehicleCar = 22,
		TeleportingInVehicleBoat = 23,
	};

	// Size: 0x4
	enum class EHumanoidMovementInputSpeed : int32_t
	{
		Stationary = 0,
		Slow = 1,
		Fast = 2,
	};

	// Size: 0x1
	enum class EHumanoidOnGuideSpecialization : int8_t
	{
		None = 0,
		Ledge_Hang = 1,
		Ledge_Sidle = 2,
	};

	// Size: 0x4
	enum class EHumanoidTrespassingStance : int32_t
	{
		None = 0,
		Confident = 1,
		Vigilant = 2,
	};

	// Size: 0x4
	enum class EInputProbeAdjustmentType : int32_t
	{
		None = 0,
		FaceTowardsSurface = 1,
		MoveAlongSurface = 2,
		Stop = 3,
	};

	// Size: 0x1
	enum class EInteractionDoorAction : int8_t
	{
		Open = 0,
		Close = 1,
		Lock = 2,
	};

	// Size: 0x1
	enum class EInteractionDoorHandleSide : int8_t
	{
		Left = 0,
		Right = 1,
	};

	// Size: 0x1
	enum class EInteractionDoorOpenStyle : int8_t
	{
		Normal = 0,
		Charge = 1,
		Kick = 2,
	};

	// Size: 0x4
	enum class EInteractionUIAgilityType : int32_t
	{
		Invalid = 0,
		AttackFromAbove = 1,
		ClimbLadder = 2,
		Climb = 3,
		Vault = 4,
		VaultAttack = 5,
		VaultDropdown = 6,
		VaultUp = 7,
		Jump = 8,
		GenericAnimDrivenAction = 9,
		Takedown = 10,
		Parry = 11,
		Rush = 12,
		Disarm = 13,
		CombatRush = 14,
		CombatRushStrike = 15,
		CombatRushSilentTakedown = 16,
		AgencyBluff = 17,
		AgencyFinisher = 18,
		ZiplineEnter = 19,
		Sneak = 20,
		FakeSurrender = 21,
		Pickpocket = 22,
		ItemQuickThrow = 23,
		CoverSwap = 24,
		Hang = 25,
		Dismount = 26,
		Sidle = 27,
		ClimbDropDown = 28,
	};

	// Size: 0x4
	enum class EInterceptableGoalType : int32_t
	{
		CloseCombatFinisher = 0,
		MeleeAttack = 1,
		VaultFinisher = 2,
		AllAgilityActions = 3,
		GadgetActivation = 4,
		AllGadgetActivations = 5,
	};

	// Size: 0x1
	enum class EInterruptionConfiguration : int8_t
	{
		Default = 0,
		DoNotInterrupt = 1,
	};

	// Size: 0x1
	enum class EItemAttachmentState : int8_t
	{
		Attached = 0,
		Selected = 1,
		Equipped = 2,
	};

	// Size: 0x4
	enum class EItemOperationType : int32_t
	{
		None = 0,
		Attach = 1,
		Drop = 2,
		Max = 3,
	};

	// Size: 0x1
	enum class EKntCheckpointLoadState : int8_t
	{
		Initiate = 0,
		WaitForStreamingSets = 1,
		SpawnPlayer = 2,
		WaitForPlayerSpawner = 3,
		WaitForDynamicSpawners = 4,
		Finalize = 5,
	};

	// Size: 0x4
	enum class EKntMissionTimerType : int32_t
	{
		Timer = 0,
		Stopwatch = 1,
	};

	// Size: 0x1
	enum class ELocomotionSpeedOverrideType : int8_t
	{
		NoOverride = 0,
		Slow = 1,
		Medium = 2,
		Fast = 3,
	};

	// Size: 0x1
	enum class ELocomotionSpeedScalingModifier : int8_t
	{
		Avoidance = 0,
		Guidance = 1,
	};

	// Size: 0x4
	enum class ELookAtTargetMode : int32_t
	{
		InSocial = 0,
		Always = 1,
	};

	// Size: 0x2
	enum class ELureUnavailableFlag : int16_t
	{
		Disabled = 0,
		NotAvailable = 1,
		NotEnoughAgency = 2,
		InCooldown = 3,
		TargetInvalid = 4,
		TargetTooClose = 5,
		TargetInDifferentArea = 6,
		TargetPathTooFar = 7,
		PlayerBeingIdentifiedAsThreat = 8,
	};

	// Size: 0x4
	enum class EMeleeAlignmentBone : int32_t
	{
		Ground = 0,
		Impact = 1,
		Count = 2,
	};

	// Size: 0x4
	enum class EMeleeAlignmentType : int32_t
	{
		None = 0,
		AlignGroundBoneToOpponent = 1,
		AlignToTargetTransform = 2,
		AlignToVictim = 3,
		LinkToInstigatorBone = 4,
	};

	// Size: 0x4
	enum class EMeleeApproachType : int32_t
	{
		NotNeeded = 0,
		Run = 1,
		Vault = 2,
	};

	// Size: 0x4
	enum class EMeleeAttackAlignmentType : int32_t
	{
		GameplayDriven = 0,
		AnimationDriven_AlignToTargetBone = 1,
	};

	// Size: 0x1
	enum class EMeleeAttackOutcome : int8_t
	{
		None = 0,
		Successful = 1,
		Blocked = 2,
		Missed = 3,
	};

	// Size: 0x4
	enum class EMeleeAttackResult : int32_t
	{
		Unknown = 0,
		Missed_NoVictim = 1,
		Missed_VictimOutOfReach = 2,
		Missed_VictimSidestepped = 3,
		Missed_VictimCurrentlyNonAttackable = 4,
		Missed_VictimBlocked = 5,
		Missed_HitByMeleeAttackOnSameFrame = 6,
		Missed_NotAttackImpactReceived = 7,
		Missed_VictimDefensesBlock = 8,
		Missed_VictimDefensesMiss = 9,
		Successful_Unblocked = 11,
		Successful_BrokeBlock = 12,
		Count = 13,
	};

	// Size: 0x4
	enum class EMeleeAttackStep : int32_t
	{
		Inactive = 0,
		Preparing = 1,
		Preparing_WaitingForRetargeting = 2,
		Preparing_WaitingForSuccessCheck = 3,
		Attacking = 4,
		Impacting = 5,
		Missing = 6,
		BeingBlocked = 7,
		Recovering = 8,
	};

	// Size: 0x4
	enum class EMeleeAttackToleranceToHitPolicy : int32_t
	{
		ImpactBoneToTargetBone = 0,
		CapsuleToCapsule = 1,
		ImpactBoneToCapsule = 2,
	};

	// Size: 0x4
	enum class EMeleeAttackTriggerType : int32_t
	{
		QuickAttack = 0,
		ChargedAttack = 1,
	};

	// Size: 0x4
	enum class EMeleeAttackType : int32_t
	{
		Light = 0,
		Heavy = 1,
		LongLight = 2,
		LongHeavy = 3,
		Counter = 4,
		PistolAttack = 5,
		RifleAttack = 6,
		CombatRushShortRange = 7,
		CombatRushLongRange = 8,
		RedirectStrike = 9,
	};

	// Size: 0x4
	enum class EMeleeAttackTypeFlags : int32_t
	{
		Light = 1,
		Heavy = 2,
		LongLight = 4,
		LongHeavy = 8,
		Counter = 16,
		PistolAttack = 32,
		RifleAttack = 64,
		CombatRushShortRange = 128,
		CombatRushLongRange = 256,
		RedirectStrike = 512,
	};

	// Size: 0x4
	enum class EMeleeParryStep : int32_t
	{
		None = 0,
		Attacking = 1,
		Impacting = 2,
		Staggering = 3,
	};

	// Size: 0x4
	enum class EMeleeParryType : int32_t
	{
		None = 0,
		Parry = 1,
		Block = 2,
	};

	// Size: 0x4
	enum class EMeleeVariationType : int32_t
	{
		None = -1,
		Straight = 0,
		Left = 1,
		Right = 2,
	};

	// Size: 0x4
	enum class ENearDeathStateFinishReason : int32_t
	{
		Recovered = 0,
		Died = 1,
		Scripted = 2,
		Quit = 3,
	};

	// Size: 0x4
	enum class ENotificationType : int32_t
	{
		MainObjective = 0,
		SubObjective = 1,
		Hint = 2,
		QuestItem = 3,
		Notification = 4,
		Opportunity = 5,
		OpportunityStep = 6,
	};

	// Size: 0x4
	enum class ENpcArchetype : int32_t
	{
		Civilian = 0,
		Minion = 1,
		Henchman = 2,
		Brute = 3,
		BossAssassin = 4,
		PlayerCompanion = 5,
	};

	// Size: 0x4
	enum class ENpcReinforcementsState : int32_t
	{
		AvailableForRequest = 0,
		Requested = 1,
		ActiveFromSavegame = 2,
		Active = 3,
	};

	// Size: 0x4
	enum class ENpcStateIconType : int32_t
	{
		DistractedInAmbient = 0,
		EscalatingFromAmbient = 1,
		Manhunt = 2,
		ManhuntInvestigatingDisturbance = 3,
		Combat = 4,
		CombatDistracted = 5,
		CallingForReinforcements = 6,
		Confronting = 7,
		Bluffed = 8,
		Watcher = 9,
		Disoriented = 10,
		InfluencedByWatcher = 11,
		LtkWindowOfOpportunity = 12,
	};

	// Size: 0x4
	enum class EObjectiveDynamicDataCountDisplayType : int32_t
	{
		Default = 0,
		Currency = 1,
	};

	// Size: 0x4
	enum class EObjectiveDynamicDataType : int32_t
	{
		None = 0,
		Count_Up = 1,
		State_Progression = 2,
		Timer = 3,
		State_Progression_And_Percentage = 4,
	};

	// Size: 0x4
	enum class EObjectiveUIState : int32_t
	{
		Active = 0,
		Completed = 1,
		Deactivated = 2,
		Failed = 3,
	};

	// Size: 0x4
	enum class EObjectiveUIType : int32_t
	{
		MainObjective = 0,
		SubObjective = 1,
		Hint = 2,
		QuestItem = 3,
		Opportunity = 4,
		OpportunityStep = 5,
	};

	// Size: 0x1
	enum class EParryVariationType : int8_t
	{
		None = 0,
		Left = 1,
		Right = 2,
		BackLeft = 3,
		BackRight = 4,
	};

	// Size: 0x1
	enum class EPhysicsGameplayState : int8_t
	{
		PlayerStealth = 0,
		Vaulting = 1,
	};

	// Size: 0x1
	enum class EPhysicsObstacleStopType : int8_t
	{
		None = 0,
		Cliff = 1,
	};

	// Size: 0x1
	enum class EPickpocketMode : int8_t
	{
		Social = 0,
		Trespass = 1,
		Trespass_Bluffed = 2,
	};

	// Size: 0x4
	enum class EPlayerApproachingGoalCompletionMode : int32_t
	{
		BasedOnDistanceToTarget = 0,
		BasedOnDistanceAndFacingToTarget = 1,
	};

	// Size: 0x4
	enum class EPlayerApproachingGoalOrientationMode : int32_t
	{
		SameAsTarget = 0,
		SameAsApproachingDirection = 1,
		SameAsPlayerFacingAtStart = 2,
	};

	// Size: 0x4
	enum class EPlayerApproachingGoalStopRadiusMode : int32_t
	{
		AnyPositionWithinRadius = 0,
		PositionExactlyOnRadius = 1,
	};

	// Size: 0x4
	enum class EPlayerApproachingMovementType : int32_t
	{
		None = 0,
		CinematicFunnelingApproach = 1,
		CoreLogicGoal = 2,
		CoverCorner = 3,
		DashToCover = 4,
		UseDoor = 5,
		VirtualCapsule = 6,
		AgilityAction = 7,
		CameraFocusReorientation = 8,
		Complying = 9,
		FakeSurrender = 10,
		ActiveBluff = 11,
	};

	// Size: 0x1
	enum class EPlayerComplyingState : int8_t
	{
		None = 0,
		WaitingInitialDialogues = 1,
		FadingIn = 2,
		Teleporting = 3,
		FadingOut = 4,
	};

	// Size: 0x4
	enum class EPlayerGadgetTargetType : int32_t
	{
		None = 0,
		Humanoid = 1,
		Item = 2,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventAgilityActionTriggerMode : int32_t
	{
		Start = 0,
		End = 1,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventAgilityActionType : int32_t
	{
		Vault = 0,
		Scale = 1,
		ContextualJump = 2,
		Land = 3,
		LandRoll = 4,
		Crouch = 5,
		StandUp = 6,
		Dash = 7,
		Vent = 8,
		Cover = 9,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventContextSwitchType : int32_t
	{
		Entering = 0,
		Exiting = 1,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventContextType : int32_t
	{
		Any = 0,
		Public = 1,
		PublicFormal = 2,
		PublicCasual = 3,
		Trespassing = 4,
		LicenseToKill = 5,
		SituationContained = 6,
		SoftTrespassing = 7,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventLocomotionTrackingAreaConstraint : int32_t
	{
		None = 0,
		Public = 1,
		Trespassing = 2,
		LicenseToKill = 3,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventLocomotionTrackingSpatialConstraint : int32_t
	{
		None = 0,
		Cover = 1,
		Vent = 2,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventLocomotionTrackingStanceType : int32_t
	{
		CrouchIdle = 0,
		CrouchMoving = 1,
		Idle = 2,
		Walking = 3,
		Running = 4,
		Sprinting = 5,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventLocomotionTrackingTriggerMode : int32_t
	{
		AllConditionsAreSatified = 0,
		AllConditionsAreSatifiedAndStateChanges = 1,
	};

	// Size: 0x4
	enum class EPlayerGameplayEventType : int32_t
	{
		PlayerGameplayContextSwitch = 0,
		PlayerAgilityAction = 1,
		PlayerLocomotionTracking = 2,
	};

	// Size: 0x4
	enum class EPlayerGameplayRecordTimeStateFlag : int32_t
	{
		StandingUp = 0,
		Crouching = 1,
		Idle = 2,
		Moving = 3,
		Walking = 4,
		Running = 5,
		Sprinting = 6,
		InCover = 7,
		InsideVent = 8,
		Aiming = 9,
		InCloseCombat = 10,
		InWatchView = 11,
		InPublic = 12,
		InTrespassing = 13,
		InLicenseToKill = 14,
		Count = 15,
	};

	// Size: 0x4
	enum class EPlayerGameplaySystem : int32_t
	{
		CoverSystem = 0,
		HitReaction_Stumble = 1,
		Skill_Dash = 2,
		Skill_StartMeleeAttack = 3,
		Skill_StartSprinting = 4,
		Skill_Uncrouch = 5,
		Skill_Crouch = 6,
		Skill_QuickThrow = 7,
		Skill_AimedThrow = 8,
		Skill_Aiming = 9,
		Skill_PickupItem = 10,
		Skill_PickupFirearm = 11,
		Skill_SilentTakedown = 12,
		Skill_GadgetView = 13,
		Skill_GadgetActivation = 14,
		Skill_TrespassingStanceChange = 15,
		Skill_Pickpocket = 16,
		Skill_Whistle = 17,
		Skill_Interact = 18,
		Skill_ActiveBluff = 19,
		Skill_StopSprinting = 20,
		Skill_AttackFromAbove = 21,
		Skill_AgencyFocus = 22,
		AgencySystem = 23,
		AgilitySystem = 24,
		SituationContained = 25,
		CombatRush = 26,
		TouchTheWorldSystem = 27,
		VaultFinisher = 28,
		Skill_ContextualThrow = 29,
		Skill_ConfrontationOptIn = 30,
		Skill_Block = 31,
		Skill_Parry = 32,
		Skill_Grab = 33,
		Skill_CameraFocus = 34,
		Skill_Finisher = 35,
		Skill_GrabRush = 36,
		Skill_FakeSurrender = 37,
		Skill_Sidestep = 38,
		Skill_CombatRushPairedAction = 39,
		ConsumeGadgetResources = 40,
		GadgetViewSlowmo = 41,
		VaultDisarm = 42,
		SelectNextFirearm = 43,
		Skill_GrabQuickThrow = 44,
		Skill_Disarm = 45,
		Skill_CombatRushGrab = 46,
		Skill_DoorKick = 47,
		Skill_DoorRush = 48,
		TakedownAmmoReward = 49,
	};

	// Size: 0x1
	enum class EPlayerGameplaySystemDisabledStateLayerType : int8_t
	{
		Base = 0,
		Secondary = 1,
	};

	// Size: 0x4
	enum class EPlayerInputCollisionProbesModType : int32_t
	{
		DisableProbes = 0,
		ModifyMoveAlongSurfaceAngle = 1,
		ModifyProbesDistance = 2,
	};

	// Size: 0x4
	enum class EPlayerInputSchemeType : int32_t
	{
		Humanoid = 0,
		Vehicle = 1,
		Custom = 2,
		GameUI = 3,
		EngineUI = 4,
	};

	// Size: 0x1
	enum class EPlayerMovementDisabledSource : int8_t
	{
		CoreLogic = 0,
		FakeSurrender = 1,
		QuickFire = 2,
		AIDecisionMaking = 3,
		Confrontation = 4,
		Comply = 5,
	};

	// Size: 0x4
	enum class EPlayerMovementInputConstraintApplicationType : int32_t
	{
		Override = 0,
		Aggregate = 1,
	};

	// Size: 0x4
	enum class EPlayerMovementInputConstraintLayerType : int32_t
	{
		Base = 0,
		Secondary = 1,
	};

	// Size: 0x4
	enum class EPlayerMovementInputConstraintType : int32_t
	{
		InputSpeedLevel = 1,
		InputDeviceMagnitude = 2,
		InputDeviceDirection = 3,
		InputDeviceSmoothing = 4,
	};

	// Size: 0x1
	enum class EPlayerTargetLineOfSightReachType : int8_t
	{
		FirstContactWithTargetSurface = 0,
		TargetCenter = 1,
	};

	// Size: 0x1
	enum class EPlayerTargetLineOfSightType : int8_t
	{
		None = 0,
		SingleRay = 1,
		Sweep = 2,
		MultipleRayPoints = 3,
	};

	// Size: 0x1
	enum class EPlayerTargetSortMode : int8_t
	{
		DistanceToScreenCenter = 0,
		DistanceToCamera = 1,
		ScoreCurves = 2,
	};

	// Size: 0x1
	enum class EPlayerTargetState : int8_t
	{
		Locked = 0,
		Sticky = 1,
	};

	// Size: 0x4
	enum class EPlayerTargetStickinessType : int32_t
	{
		None = 0,
		DurationMaxScore = 1,
		DurationMinScore = 2,
		IncreasedAngle = 3,
	};

	// Size: 0x1
	enum class EPlayerTimeSlowDownSource : int8_t
	{
		AgencyFocus = 0,
		GadgetView = 1,
		LastKill = 2,
		CoreLogic = 3,
	};

	// Size: 0x4
	enum class EPlayerVirtualCapsuleObstacleType : int32_t
	{
		Invalid = 0,
		HighObstacle = 1,
		LowObstacle = 2,
	};

	// Size: 0x4
	enum class EPlayerVirtualCapsuleResultType : int32_t
	{
		None = 0,
		StopOnCollisionSurface = 1,
		StopOnCollisionWithNPC = 2,
		ApproachToStopOnCollisionSurface = 3,
		MovingTowardsCover = 4,
		RemapInputAlongCollisionSurface = 5,
		RemapInputForNPCCollisionAvoidance = 6,
	};

	// Size: 0x4
	enum class EPlayerVirtualCapsuleSufaceWidthEstimationType : int32_t
	{
		Invalid = 0,
		NoCollision = 1,
		DistanceToCorner = 2,
		SingleHitVirtualCapsule = 3,
		DistanceToSimulationEnd = 4,
	};

	// Size: 0x1
	enum class EPotentialHazardNpcReactionType : int8_t
	{
		Attract = 0,
		Repel = 1,
	};

	// Size: 0x1
	enum class EPrivateSpaceInvadedReactionRole : int8_t
	{
		None = 0,
		Invading = 1,
		Reacting = 2,
	};

	// Size: 0x1
	enum class EPrivateSpaceInvadedReactionType : int8_t
	{
		None = 0,
		Passive = 1,
		Mine = 2,
		InPlace = 3,
	};

	// Size: 0x1
	enum class EProjectileImpactBodyPart : int8_t
	{
		Torso = 0,
		Head = 1,
		LeftHand = 2,
		LeftArm = 3,
		LeftLeg = 4,
		RightHand = 5,
		RightArm = 6,
		RightLeg = 7,
		None = 8,
		Weapon = 9,
	};

	// Size: 0x1
	enum class EProjectileImpactOrigin : int8_t
	{
		FRONT = 0,
		BACK = 1,
		LEFT = 2,
		RIGHT = 3,
	};

	// Size: 0x4
	enum class ERangedCombatSituation : int32_t
	{
		Default = 0,
		TargetInCover = 1,
		TargetAimingFromCover = 2,
		TargetBackInSight = 3,
		TargetSprinting = 4,
		TargetDashing = 5,
		TargetVaulting = 6,
		TargetGettingShot = 7,
		TargetDoingFinisher = 8,
		TargetCombatRushing = 9,
		BeingShot = 10,
		Flanking = 11,
		DoingFocusedShot = 12,
		AfterFocusedShot = 13,
		BossAssassinBasement = 14,
		BossAssassinTakedownGracePeriod = 15,
		BossAssassinSniper = 16,
		DuringCloseCombat = 17,
		AfterCloseCombat = 18,
		HealthThresholdCap = 19,
		HitCap = 20,
		HitCap2 = 21,
		AfterFriendlyFire = 22,
		BossExoDamien = 23,
		TargetCoverDestroyed = 24,
	};

	// Size: 0x4
	enum class ERulesOfEngagementLethalForceAvailability : int32_t
	{
		Default = 0,
		Available = 1,
		Unavailable = 2,
	};

	// Size: 0x1
	enum class ESequenceControllerGpwEntityType : int8_t
	{
		Humanoid = 0,
		Vehicle = 1,
	};

	// Size: 0x1
	enum class ESequenceControllerGpwVehicleEntityType : int8_t
	{
		Car = 0,
		Boat = 1,
	};

	// Size: 0x1
	enum class ESicknessDartReaction : int8_t
	{
		Immune = 0,
		ShrugOff = 1,
		FullReaction = 2,
	};

	// Size: 0x1
	enum class ESideStepType : int8_t
	{
		Hop = 0,
		SideStep = 1,
	};

	// Size: 0x4
	enum class ESideStepWindowType : int32_t
	{
		Grab = 0,
		MeleeAttack = 1,
		TaserShot = 2,
	};

	// Size: 0x1
	enum class ESimulatedPlayerActiveSkill : int8_t
	{
		SimulatedSkill_Confrontation = 0,
		SimulatedSkill_FakeSurrender = 1,
	};

	// Size: 0x4
	enum class EStaggerSource : int32_t
	{
		ThrowableImpact = 0,
		MeleeImpact = 1,
		VaultImpact = 2,
		StaggeredMovementImpact = 3,
		GrabThrow = 4,
		Taser = 5,
		Flashbang = 6,
		CoreLogic = 7,
		Parry = 8,
		DoorImpact = 9,
		Firearm = 10,
		PrivateSpacePush = 11,
		Shockwave = 12,
		Explosion = 13,
		PairedAction = 14,
		AgilityActionImpact = 15,
		StumbleImpact = 16,
		CapsuleOverlap = 17,
		FlashMine = 18,
		ElectricalSurge = 19,
	};

	// Size: 0x4
	enum class EStaggerStrength : int32_t
	{
		Light = 0,
		Medium = 1,
		Heavy = 2,
	};

	// Size: 0x4
	enum class EStaggerStrengthFlags : int32_t
	{
		Light = 1,
		Medium = 2,
		Heavy = 4,
	};

	// Size: 0x1
	enum class EStaggeredLocomotionState : int8_t
	{
		MeleeImpact = 0,
		Generic = 1,
		FirearmImpact = 2,
		Idle = 3,
		WallImpact = 4,
		LowCoverImpact = 5,
		Death = 6,
		GrabThrow = 7,
		Parry = 8,
		WallDeath = 9,
		VaultAttackImpact = 10,
		LowCoverRoll = 11,
		HumanoidImpact = 12,
		ThrowableImpact = 13,
		DeathOverEdge = 14,
		PrivateSpacePush = 15,
		Explosion = 16,
		PairedAction = 17,
		Shockwave = 18,
		FlashMine = 19,
	};

	// Size: 0x4
	enum class EStanceChangeSource : int32_t
	{
		Undefined = 0,
		CrouchAimingInLowCover = 1,
		CrouchFromHighToLowCover = 2,
		CrouchGoal = 3,
		CrouchAfterScaling = 4,
		CrouchAfterLowCoverTakedown = 5,
		CrouchDashToLowCover = 6,
		UncrouchGoal = 7,
		UncrouchDashToHighCover = 8,
		UncrouchAimingInLowCover = 9,
		UncrouchOnCloseCombatHitReaction = 10,
		UncrouchWhenStaggered = 11,
		UncrouchWhenCloseCombat = 12,
		UncrouchWhenInConfrontation = 13,
		UncrouchWhenInSocialGameplayArea = 14,
		UncrouchWhenAccelerating = 15,
		MovingAndAiming = 16,
		Moving = 17,
		Aiming = 18,
		Idle = 19,
		AgilityAction = 20,
		CrouchAfterAttackFromAbove = 21,
	};

	// Size: 0x4
	enum class EStartMeleeAttackSkillAvailability : int32_t
	{
		Available = 0,
		Unavailable_AttackNotRequested = 1,
		Unavailable_GameplaySystemDisabled = 2,
		Unavailable_SoftTrespassing = 3,
		Unavailable_CombatDisabled = 4,
		Unavailable_MotorConfig = 5,
		Unavailable_GadgetView = 6,
		Unavailable_InteractionAnimation = 7,
		Unavailable_GrabCooldown = 8,
		Unavailable_ConflictingHumanoidData = 9,
		Unavailable_MeleeAttackingWithChainWindowClosed = 10,
		Unavailable_Grabbing = 11,
		Unavailable_NoValidTarget = 12,
		Unavailable_NoValidAttack = 13,
		Unavailable_AimTargetDriven = 14,
		Unavailable_NoValidTargetAfterCloseCombatKillCooldown = 15,
		Unavailable_OnGuide = 16,
		Count = 17,
	};

	// Size: 0x4
	enum class EStartMeleeAttackSkillVictimStatus : int32_t
	{
		Unknown = 0,
		Invalid_TooFarWhenDoingFakeSurrender = 1,
		Invalid_NoCandidateWithinMeleeAttackRange = 2,
		Valid = 3,
		Valid_FakeSurrenderTarget = 4,
		Valid_BestCandidateWithinMeleeAttackRange = 5,
	};

	// Size: 0x4
	enum class EStumbleCandidateType : int32_t
	{
		Undefined = 0,
		Humanoid = 1,
		Lowcover = 2,
		Railing = 3,
		Wall = 4,
		LowcoverRoll = 5,
		Entity = 6,
		Count = 7,
	};

	// Size: 0x4
	enum class EStumbleDamageEventType : int32_t
	{
		OnStumble = 0,
		OnAnimationEvent = 1,
	};

	// Size: 0x2
	enum class EStumbleImpactFlag : int16_t
	{
		BlockingImpact = 0,
		Heavy = 1,
		CausesRollOver = 2,
		AllowsContextualAttack = 3,
		StunsInstigator = 4,
		UnequipWeapon = 5,
		FallbackStumble = 6,
		IsDamageableObject = 7,
		IsDoor = 8,
		WillDestroyObject = 9,
		StaggerStumbledTarget = 10,
		LandedDuringRollOver = 11,
		OverrideStumble = 12,
	};

	// Size: 0x4
	enum class EStumbleImpactType : int32_t
	{
		Unknown = 0,
		HighWall = 1,
		LowWall = 2,
		Humanoid = 3,
		RailingDeath = 4,
		LowCoverRoll = 5,
	};

	// Size: 0x4
	enum class EStumbleListenerImpactType : int32_t
	{
		Stumble = 0,
		ContextualPairedAction = 1,
	};

	// Size: 0x1
	enum class EStunType : int8_t
	{
		Taser = 0,
		Flashbang = 1,
		SlipAndKnockout = 2,
		Stagger = 3,
		Parry = 4,
		Invalid = -1,
	};

	// Size: 0x4
	enum class ETWILeaveContext : int32_t
	{
		None = 0,
		StopInProgress = 1,
		Leaving = 2,
	};

	// Size: 0x4
	enum class ETWIRuntimeState : int32_t
	{
		Idle = 0,
		Searching = 1,
		CloseButNoSurfaceHit = 2,
		SurfaceHit = 3,
		Aborted = 4,
		OnCooldown = 5,
	};

	// Size: 0x4
	enum class ETWIStopContext : int32_t
	{
		None = 0,
		HighObstacleStop = 1,
		HighObstaclePredictedStop = 2,
		LowObstacleStop = 3,
		LowObstaclePredictedStop = 4,
	};

	// Size: 0x1
	enum class ETargetingRaycastDetailLevel : int8_t
	{
		Simple = 0,
		Bones = 1,
		Detailed = 2,
	};

	// Size: 0x1
	enum class ETraversalRaycastHitAspectFlag : int8_t
	{
		SlidingSurface = 0,
	};

	// Size: 0x1
	enum class ETraversalSearchResultType : int8_t
	{
		None = 0,
		Edge = 1,
		Ramp = 2,
		BlockingObstacle = 3,
		NarrowObstacle = 4,
		ObstacleToClimb = 5,
		ObstacleToVault = 6,
		ObstacleToJump = 7,
		ObstacleVaultDisabled = 8,
		ObstacleClimbDisabled = 9,
		ObstacleMarkupWithAgilityDisabled = 10,
		DisallowedApproachAngle = 11,
	};

	// Size: 0x1
	enum class ETurnCoverCornerType : int8_t
	{
		NotAvailable = 0,
		AvailableInactive = 1,
		AvailableReady = 2,
	};

	// Size: 0x1
	enum class EUseDoorSkillType : int8_t
	{
		Open = 0,
		Close = 1,
		Kick = 2,
		Bullrush = 3,
		Sabotage = 4,
		TryUseSabotagedDoor = 5,
	};

	// Size: 0x4
	enum class EVaultObstacleDepthVariations : int32_t
	{
		Fence = 0,
		ShortestLowObstacle = 1,
		ShortLowObstacle = 2,
		DeepLowObstacle = 3,
		DeepestLowObstacle = 4,
	};

	// Size: 0x1
	enum class EVaultType : int8_t
	{
		VaultDefault = 0,
		VaultAttack = 1,
		VaultFinisher = 2,
		VaultDisarm = 3,
		None = 4,
	};

	// Size: 0x1
	enum class EVehicleAerodynamicsDownforceMode : int8_t
	{
		Always = 0,
		OnlyOnGround = 1,
		OnlyOnAir = 2,
	};

	// Size: 0x4
	enum class EVehicleApplyForceSource : int32_t
	{
		Aerodynamics = 0,
		ExternalSource = 1,
		CollisionAssist = 2,
	};

	// Size: 0x4
	enum class EVehicleAttachmentsDriveMode : int32_t
	{
		PhysicsDriven = 0,
		AnimationDriven = 1,
		MixOfPhysicsAndAnimation = 2,
	};

	// Size: 0x4
	enum class EVehicleBoatAnimationState : int32_t
	{
		NotInBoat = 0,
		Entering = 1,
		Driving = 2,
		Passanger = 3,
		Exiting = 4,
	};

	// Size: 0x4
	enum class EVehicleBoatCollisionObjectType : int32_t
	{
		Wall = 0,
		AnotherBoat = 1,
	};

	// Size: 0x4
	enum class EVehicleBoatHardCollisionAssistType : int32_t
	{
		NotColliding = 0,
		AutoSteeringWithSideCollision = 1,
		UsingPhysicsCollision = 2,
		ArtificialBounceOffSurface = 3,
		HardStop = 4,
	};

	// Size: 0x4
	enum class EVehicleBoatHumanoidAttachmentParent : int32_t
	{
		PhysicsSpatial = 0,
		VisualSpatial = 1,
	};

	// Size: 0x4
	enum class EVehicleBoatNPCHangPointType : int32_t
	{
		None = -1,
		N_0 = 0,
		NE_1 = 1,
		SE_2 = 2,
		SW_3 = 3,
		NW_4 = 4,
	};

	// Size: 0x1
	enum class EVehicleBoatVisualsMode : int8_t
	{
		SimpleMesh = 0,
		AnimatedMesh = 1,
	};

	// Size: 0x4
	enum class EVehicleCameraStateType : int32_t
	{
		AtRest = 0,
		Rolling = 1,
		Accelerating = 2,
		Braking = 3,
	};

	// Size: 0x4
	enum class EVehicleCameraTargetReinitializationType : int32_t
	{
		None = 0,
		InitializeWithEnteringVehicleCamera = 1,
		InitializeWithDrivingCamera = 2,
	};

	// Size: 0x4
	enum class EVehicleCameraTargetSpringFollowMode : int32_t
	{
		SpeedBasedResponsiveness = 0,
		AngleBasedResponsiveness = 1,
		SpeedBasedSimpleVehicleSpring = 2,
	};

	// Size: 0x4
	enum class EVehicleCameraTargetSpringFollowState : int32_t
	{
		InitializeWithEnteringVehicleCamera = 0,
		InitializeWithDrivingCamera = 1,
		InputBasedSprings = 2,
		CooldownSprings = 3,
		InputAssistSpringFollow = 4,
		InputTriggeredReset = 5,
		VehiclePhysicsSprings = 6,
	};

	// Size: 0x4
	enum class EVehicleCameraTargetType : int32_t
	{
		Default = 0,
		VehiclePhysicsSpringFollowTarget = 1,
		VehiclePhysicsSpringLookAtTarget = 2,
	};

	// Size: 0x4
	enum class EVehicleCameraType : int32_t
	{
		BasedOnInputState = 0,
		BasedOnVehiclePhysics = 1,
	};

	// Size: 0x1
	enum class EVehicleCarAnimationState : int8_t
	{
		None = 0,
		Entering = 1,
		Driving = 2,
		Exiting = 3,
	};

	// Size: 0x1
	enum class EVehicleCarComponentType : int8_t
	{
		Drifting = 0,
		CollisionHandling = 1,
		Aerodynamics = 2,
		CameraController = 3,
	};

	// Size: 0x4
	enum class EVehicleCarConfigOverrideType : int32_t
	{
		Acceleration = 0,
		RevAcceleration = 1,
		Deceleration = 2,
		Steering = 3,
		Tires = 4,
		WheelsSteeringAndBrakes = 5,
		WheelsAntiroll = 6,
	};

	// Size: 0x4
	enum class EVehicleCinematicSpeedMode : int32_t
	{
		None = 0,
		ForwardSpeed = 1,
		RigidbodyVelocity = 2,
	};

	// Size: 0x1
	enum class EVehicleCollisionCorrectionMode : int8_t
	{
		ImpactForceImpulse = 0,
		ConstantLateralForce = 1,
	};

	// Size: 0x4
	enum class EVehicleDebugLogCategory : int32_t
	{
		SimulationPauseResume = 0,
		Aerodynamics = 1,
		Teleport = 2,
		ExternalForces = 3,
		SpeedModifiers = 4,
		CollisionDetection = 5,
		DataChanges = 6,
		Count = 7,
	};

	// Size: 0x4
	enum class EVehicleDriftingConfigType : int32_t
	{
		Brake = 0,
		Handbrake = 1,
		Autodrift = 2,
	};

	// Size: 0x4
	enum class EVehicleForceType : int32_t
	{
		Impulse = 0,
		PointImpulse = 1,
		Force = 2,
		PointForce = 3,
		TorqueImpulse = 4,
		Torque = 5,
	};

	// Size: 0x1
	enum class EVehicleHumanoidAttachMode : int8_t
	{
		Instant = 0,
		AnimationDriven = 1,
	};

	// Size: 0x1
	enum class EVehicleHumanoidAttachmentParent : int8_t
	{
		PhysicsChassis = 0,
		SkeletonSpatial = 1,
		VehicleSpatialAttachment = 2,
	};

	// Size: 0x1
	enum class EVehicleHumanoidVisibility : int8_t
	{
		Visible = 0,
		Invisible = 1,
	};

	// Size: 0x4
	enum class EVehiclePhysicalPartType : int32_t
	{
		WheelFrontLeft = 0,
		WheelFrontRight = 1,
		WheelRearLeft = 2,
		WheelRearRight = 3,
		Chassis = 4,
	};

	// Size: 0x4
	enum class EVehicleSetAngularVelocitySource : int32_t
	{
		AerodynamicPitchConstraint = 0,
		AerodynamicRollConstraint = 1,
	};

	// Size: 0x4
	enum class EVehicleSkeletonSpatialSynchronizationMode : int32_t
	{
		Disabled = 0,
		PhysicsTransform = 1,
	};

	// Size: 0x4
	enum class EVehicleSlopeState : int32_t
	{
		Invalid = 0,
		Airbone = 1,
		Uphill = 2,
		Downhill = 3,
		Flat = 4,
	};

	// Size: 0x4
	enum class EVehicleSpatialAttachmentLocalOffsetType : int32_t
	{
		None = 0,
		Inline = 1,
		External = 2,
	};

	// Size: 0x4
	enum class EVehicleSpatialAttachmentMode : int32_t
	{
		WorldPositionAndRotation = 0,
		WorldPosition = 1,
		WorldRotation = 2,
		WorldPositionPhysicsBodyRotation = 3,
		WorldPositionSpeedBasedWheelRotation = 4,
		SkeletonBoneTransformFromPhysicalPart = 5,
		SkeletonBoneTransformCustom = 6,
		CustomVehicleSpatialPositionSpeedBasedWheelRotation = 7,
	};

	// Size: 0x4
	enum class EVehicleSpatialAttachmentOscilationMethod : int32_t
	{
		Sin = 0,
		Cos = 1,
	};

	// Size: 0x4
	enum class EVehicleSpatialAttachmentOscilationType : int32_t
	{
		Yaw = 0,
		Pitch = 1,
		Roll = 2,
	};

	// Size: 0x4
	enum class EVehicleVelocityModifier : int32_t
	{
		SetForwardSpeedSingleFrame = 0,
		AddMaxSpeedLimit = 1,
		RemoveMaxSpeedLimit = 2,
	};

	// Size: 0x4
	enum class EVehicleWheelIndex : int32_t
	{
		FrontLeft = 0,
		FrontRight = 1,
		RearLeft = 2,
		RearRight = 3,
	};

	// Size: 0x4
	enum class EVirtualCapsuleApproachReasonType : int32_t
	{
		None = 0,
		EarlyExit = 1,
		InCover = 2,
		AnticipationWithApproach = 3,
		CollisionStopWithoutApproach = 4,
		InputRemap = 5,
		NoVirtualCapsuleResult = 6,
	};

	// Size: 0x4
	enum class EVirtualCapsuleApproachResultType : int32_t
	{
		None = 0,
		AddApproach = 1,
		RemoveApproachImmediately = 2,
		RemoveApproachWhenFinished = 3,
	};

	// Size: 0x4
	enum class EVirtualCapsuleNPCCollisionType : int32_t
	{
		Invalid = -1,
		Front = 0,
		LateralLeft = 1,
		LateralRight = 2,
	};

	// Size: 0x4
	enum class EVisualAggressionLevel : int32_t
	{
		None = 0,
		Soft = 1,
		Hard = 2,
	};

	// Size: 0x4
	enum class PhysicalGoalStatus : int32_t
	{
		CreatedByPrimitiveTask = 0,
		ScheduledToBeAbortedFromPrimitiveTask = 1,
		PassedSolver = 2,
		RejectedBySolver = 3,
		AbortedBySolver = 4,
		AbortedNoSkill = 5,
		AbortedByAutomatedRemoval = 6,
		AbortedFromPrimitiveTask = 7,
		InSkill = 8,
		Failed = 9,
		Succeeded = 10,
	};

	namespace PlayerInteractions {
		// Size: 0x4
		enum class EInteractionAnimationOperationResult : int32_t
		{
			None = 0,
			StartRequestAccepted = 1,
			StartRequestRejected = 2,
			InteractionCompleted = 3,
			InteractionInterrupted = 4,
		};

		// Size: 0x4
		enum class EType : int32_t
		{
			Standard = 0,
			Pickpocket = 1,
		};

	}

	// Size: 0xA8
	class alignas(8) SActiveCameraTargetTrackingConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SActiveCameraTargetTrackingConfig& p_Other) const;
		bool operator!=(const SActiveCameraTargetTrackingConfig& p_Other) const { return !(*this == p_Other); }

		bool m_isActive; // 0x0
		ZCurve m_speedCurve; // 0x8
		ZCurve m_accelerationFromAngleCurve; // 0x50
		float32 m_negativeConstraint; // 0x98
		float32 m_positiveConstraint; // 0x9C
		float32 m_hysteresis; // 0xA0
		float32 m_dampingTime; // 0xA4
	};
	ZHM_OFFSET_CHECK(SActiveCameraTargetTrackingConfig, m_isActive, 0x0);
	ZHM_OFFSET_CHECK(SActiveCameraTargetTrackingConfig, m_speedCurve, 0x8);
	ZHM_OFFSET_CHECK(SActiveCameraTargetTrackingConfig, m_accelerationFromAngleCurve, 0x50);
	ZHM_OFFSET_CHECK(SActiveCameraTargetTrackingConfig, m_negativeConstraint, 0x98);
	ZHM_OFFSET_CHECK(SActiveCameraTargetTrackingConfig, m_positiveConstraint, 0x9C);
	ZHM_OFFSET_CHECK(SActiveCameraTargetTrackingConfig, m_hysteresis, 0xA0);
	ZHM_OFFSET_CHECK(SActiveCameraTargetTrackingConfig, m_dampingTime, 0xA4);
	static_assert(sizeof(SActiveCameraTargetTrackingConfig) == 0xA8, "Wrong size for SActiveCameraTargetTrackingConfig");
	static_assert(alignof(SActiveCameraTargetTrackingConfig) == 0x8, "Wrong alignment for SActiveCameraTargetTrackingConfig");

	// Size: 0x8
	class alignas(4) SAgilityActionAttributeSearchInfo
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SAgilityActionAttributeSearchInfo& p_Other) const;
		bool operator!=(const SAgilityActionAttributeSearchInfo& p_Other) const { return !(*this == p_Other); }

		uint32 m_name; // 0x0
		Gameplay::EAgilityActionAttributeSearchType m_searchType; // 0x4
	};
	ZHM_OFFSET_CHECK(SAgilityActionAttributeSearchInfo, m_name, 0x0);
	ZHM_OFFSET_CHECK(SAgilityActionAttributeSearchInfo, m_searchType, 0x4);
	static_assert(sizeof(SAgilityActionAttributeSearchInfo) == 0x8, "Wrong size for SAgilityActionAttributeSearchInfo");
	static_assert(alignof(SAgilityActionAttributeSearchInfo) == 0x4, "Wrong alignment for SAgilityActionAttributeSearchInfo");

	// Size: 0x6
	class alignas(1) SAgilityActionLaunchVelocityClampSettings
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SAgilityActionLaunchVelocityClampSettings& p_Other) const;
		bool operator!=(const SAgilityActionLaunchVelocityClampSettings& p_Other) const { return !(*this == p_Other); }

		Gameplay::EAgilityActionLaunchVelocityClampBehavior m_maximumX; // 0x0
		Gameplay::EAgilityActionLaunchVelocityClampBehavior m_maximumY; // 0x1
		Gameplay::EAgilityActionLaunchVelocityClampBehavior m_maximumZ; // 0x2
		Gameplay::EAgilityActionLaunchVelocityClampBehavior m_minimumX; // 0x3
		Gameplay::EAgilityActionLaunchVelocityClampBehavior m_minimumY; // 0x4
		Gameplay::EAgilityActionLaunchVelocityClampBehavior m_minimumZ; // 0x5
	};
	ZHM_OFFSET_CHECK(SAgilityActionLaunchVelocityClampSettings, m_maximumX, 0x0);
	ZHM_OFFSET_CHECK(SAgilityActionLaunchVelocityClampSettings, m_maximumY, 0x1);
	ZHM_OFFSET_CHECK(SAgilityActionLaunchVelocityClampSettings, m_maximumZ, 0x2);
	ZHM_OFFSET_CHECK(SAgilityActionLaunchVelocityClampSettings, m_minimumX, 0x3);
	ZHM_OFFSET_CHECK(SAgilityActionLaunchVelocityClampSettings, m_minimumY, 0x4);
	ZHM_OFFSET_CHECK(SAgilityActionLaunchVelocityClampSettings, m_minimumZ, 0x5);
	static_assert(sizeof(SAgilityActionLaunchVelocityClampSettings) == 0x6, "Wrong size for SAgilityActionLaunchVelocityClampSettings");
	static_assert(alignof(SAgilityActionLaunchVelocityClampSettings) == 0x1, "Wrong alignment for SAgilityActionLaunchVelocityClampSettings");

	// Size: 0x34
	class alignas(4) SAgilityActionReferencePointStep
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SAgilityActionReferencePointStep& p_Other) const;
		bool operator!=(const SAgilityActionReferencePointStep& p_Other) const { return !(*this == p_Other); }

		Gameplay::EAgilityActionReferencePointStepMethod m_method; // 0x0
		Gameplay::EAgilityActionReferencePointStepOperation m_operation; // 0x1
		uint32 m_flags; // 0x4
		SVector4 m_data; // 0x8
		Gameplay::EHumanoidBoneType m_bone; // 0x18
		Gameplay::SAgilityActionReferencePointStepDebug m_debug; // 0x1C
	};
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStep, m_method, 0x0);
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStep, m_operation, 0x1);
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStep, m_flags, 0x4);
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStep, m_data, 0x8);
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStep, m_bone, 0x18);
	ZHM_OFFSET_CHECK(SAgilityActionReferencePointStep, m_debug, 0x1C);
	static_assert(sizeof(SAgilityActionReferencePointStep) == 0x34, "Wrong size for SAgilityActionReferencePointStep");
	static_assert(alignof(SAgilityActionReferencePointStep) == 0x4, "Wrong alignment for SAgilityActionReferencePointStep");

	// Size: 0x14
	class alignas(4) SAgilityPenaltyMultipliers
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SAgilityPenaltyMultipliers& p_Other) const;
		bool operator!=(const SAgilityPenaltyMultipliers& p_Other) const { return !(*this == p_Other); }

		float32 m_vaultPenalty; // 0x0
		float32 m_jumpPenalty; // 0x4
		float32 m_scalePenalty; // 0x8
		float32 m_dropDownPenalty; // 0xC
		float32 m_ladderPenalty; // 0x10
	};
	ZHM_OFFSET_CHECK(SAgilityPenaltyMultipliers, m_vaultPenalty, 0x0);
	ZHM_OFFSET_CHECK(SAgilityPenaltyMultipliers, m_jumpPenalty, 0x4);
	ZHM_OFFSET_CHECK(SAgilityPenaltyMultipliers, m_scalePenalty, 0x8);
	ZHM_OFFSET_CHECK(SAgilityPenaltyMultipliers, m_dropDownPenalty, 0xC);
	ZHM_OFFSET_CHECK(SAgilityPenaltyMultipliers, m_ladderPenalty, 0x10);
	static_assert(sizeof(SAgilityPenaltyMultipliers) == 0x14, "Wrong size for SAgilityPenaltyMultipliers");
	static_assert(alignof(SAgilityPenaltyMultipliers) == 0x4, "Wrong alignment for SAgilityPenaltyMultipliers");

	// Size: 0x10
	class alignas(8) SAnimationPayloadEnumType
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SAnimationPayloadEnumType& p_Other) const;
		bool operator!=(const SAnimationPayloadEnumType& p_Other) const { return !(*this == p_Other); }

		TypeID m_enumTypeID; // 0x0
		int32 m_enumValue; // 0x8
	};
	ZHM_OFFSET_CHECK(SAnimationPayloadEnumType, m_enumTypeID, 0x0);
	ZHM_OFFSET_CHECK(SAnimationPayloadEnumType, m_enumValue, 0x8);
	static_assert(sizeof(SAnimationPayloadEnumType) == 0x10, "Wrong size for SAnimationPayloadEnumType");
	static_assert(alignof(SAnimationPayloadEnumType) == 0x8, "Wrong alignment for SAnimationPayloadEnumType");

	// Size: 0x10
	class alignas(4) SCameraOnGuideOrientationConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SCameraOnGuideOrientationConfig& p_Other) const;
		bool operator!=(const SCameraOnGuideOrientationConfig& p_Other) const { return !(*this == p_Other); }

		float32 m_orientationTime; // 0x0
		float32 m_minAngleToTrigger; // 0x4
		float32 m_angleToReach; // 0x8
		bool m_allowCancelOnInput; // 0xC
		bool m_allowPitchCorrection; // 0xD
	};
	ZHM_OFFSET_CHECK(SCameraOnGuideOrientationConfig, m_orientationTime, 0x0);
	ZHM_OFFSET_CHECK(SCameraOnGuideOrientationConfig, m_minAngleToTrigger, 0x4);
	ZHM_OFFSET_CHECK(SCameraOnGuideOrientationConfig, m_angleToReach, 0x8);
	ZHM_OFFSET_CHECK(SCameraOnGuideOrientationConfig, m_allowCancelOnInput, 0xC);
	ZHM_OFFSET_CHECK(SCameraOnGuideOrientationConfig, m_allowPitchCorrection, 0xD);
	static_assert(sizeof(SCameraOnGuideOrientationConfig) == 0x10, "Wrong size for SCameraOnGuideOrientationConfig");
	static_assert(alignof(SCameraOnGuideOrientationConfig) == 0x4, "Wrong alignment for SCameraOnGuideOrientationConfig");

	// Size: 0xC
	class alignas(4) SCloseCombatAttackModifierSetting
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SCloseCombatAttackModifierSetting& p_Other) const;
		bool operator!=(const SCloseCombatAttackModifierSetting& p_Other) const { return !(*this == p_Other); }

		uint32 m_minNumberOfOpponents; // 0x0
		uint32 m_maxNumberOfOpponents; // 0x4
		float32 m_timeModifier; // 0x8
	};
	ZHM_OFFSET_CHECK(SCloseCombatAttackModifierSetting, m_minNumberOfOpponents, 0x0);
	ZHM_OFFSET_CHECK(SCloseCombatAttackModifierSetting, m_maxNumberOfOpponents, 0x4);
	ZHM_OFFSET_CHECK(SCloseCombatAttackModifierSetting, m_timeModifier, 0x8);
	static_assert(sizeof(SCloseCombatAttackModifierSetting) == 0xC, "Wrong size for SCloseCombatAttackModifierSetting");
	static_assert(alignof(SCloseCombatAttackModifierSetting) == 0x4, "Wrong alignment for SCloseCombatAttackModifierSetting");

	// Size: 0x10
	class alignas(4) SCloseCombatAttackPatternWithResetTimer
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SCloseCombatAttackPatternWithResetTimer& p_Other) const;
		bool operator!=(const SCloseCombatAttackPatternWithResetTimer& p_Other) const { return !(*this == p_Other); }

		ECloseCombatAttack m_Attack; // 0x0
		float32 m_Weight; // 0x4
		float32 m_WeightFalloff; // 0x8
		float32 m_SecondsUntilResetAfterFirstFalloff; // 0xC
	};
	ZHM_OFFSET_CHECK(SCloseCombatAttackPatternWithResetTimer, m_Attack, 0x0);
	ZHM_OFFSET_CHECK(SCloseCombatAttackPatternWithResetTimer, m_Weight, 0x4);
	ZHM_OFFSET_CHECK(SCloseCombatAttackPatternWithResetTimer, m_WeightFalloff, 0x8);
	ZHM_OFFSET_CHECK(SCloseCombatAttackPatternWithResetTimer, m_SecondsUntilResetAfterFirstFalloff, 0xC);
	static_assert(sizeof(SCloseCombatAttackPatternWithResetTimer) == 0x10, "Wrong size for SCloseCombatAttackPatternWithResetTimer");
	static_assert(alignof(SCloseCombatAttackPatternWithResetTimer) == 0x4, "Wrong alignment for SCloseCombatAttackPatternWithResetTimer");

	// Size: 0xC
	class alignas(4) SCloseCombatAttackPatternWithoutResetTimer
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SCloseCombatAttackPatternWithoutResetTimer& p_Other) const;
		bool operator!=(const SCloseCombatAttackPatternWithoutResetTimer& p_Other) const { return !(*this == p_Other); }

		ECloseCombatAttack m_Attack; // 0x0
		float32 m_Weight; // 0x4
		float32 m_WeightFalloff; // 0x8
	};
	ZHM_OFFSET_CHECK(SCloseCombatAttackPatternWithoutResetTimer, m_Attack, 0x0);
	ZHM_OFFSET_CHECK(SCloseCombatAttackPatternWithoutResetTimer, m_Weight, 0x4);
	ZHM_OFFSET_CHECK(SCloseCombatAttackPatternWithoutResetTimer, m_WeightFalloff, 0x8);
	static_assert(sizeof(SCloseCombatAttackPatternWithoutResetTimer) == 0xC, "Wrong size for SCloseCombatAttackPatternWithoutResetTimer");
	static_assert(alignof(SCloseCombatAttackPatternWithoutResetTimer) == 0x4, "Wrong alignment for SCloseCombatAttackPatternWithoutResetTimer");

	// Size: 0x18
	class alignas(4) SCloseCombatAttackTimingSetting
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SCloseCombatAttackTimingSetting& p_Other) const;
		bool operator!=(const SCloseCombatAttackTimingSetting& p_Other) const { return !(*this == p_Other); }

		uint32 m_minNumberOfOpponents; // 0x0
		uint32 m_maxNumberOfOpponents; // 0x4
		float32 m_minTimeBetweenAttacks; // 0x8
		float32 m_maxTimeBetweenAttacks; // 0xC
		int32 m_minEnemyComboStrikeStepToAllowAttacking; // 0x10
		bool m_enableRetaliationAttackAfterLastHitInCombo; // 0x14
		bool m_enableRetaliationAttackAfterContextualAttack; // 0x15
		bool m_enableRetaliationAttackAfterParry; // 0x16
	};
	ZHM_OFFSET_CHECK(SCloseCombatAttackTimingSetting, m_minNumberOfOpponents, 0x0);
	ZHM_OFFSET_CHECK(SCloseCombatAttackTimingSetting, m_maxNumberOfOpponents, 0x4);
	ZHM_OFFSET_CHECK(SCloseCombatAttackTimingSetting, m_minTimeBetweenAttacks, 0x8);
	ZHM_OFFSET_CHECK(SCloseCombatAttackTimingSetting, m_maxTimeBetweenAttacks, 0xC);
	ZHM_OFFSET_CHECK(SCloseCombatAttackTimingSetting, m_minEnemyComboStrikeStepToAllowAttacking, 0x10);
	ZHM_OFFSET_CHECK(SCloseCombatAttackTimingSetting, m_enableRetaliationAttackAfterLastHitInCombo, 0x14);
	ZHM_OFFSET_CHECK(SCloseCombatAttackTimingSetting, m_enableRetaliationAttackAfterContextualAttack, 0x15);
	ZHM_OFFSET_CHECK(SCloseCombatAttackTimingSetting, m_enableRetaliationAttackAfterParry, 0x16);
	static_assert(sizeof(SCloseCombatAttackTimingSetting) == 0x18, "Wrong size for SCloseCombatAttackTimingSetting");
	static_assert(alignof(SCloseCombatAttackTimingSetting) == 0x4, "Wrong alignment for SCloseCombatAttackTimingSetting");

	// Size: 0x10
	class alignas(4) SCloseCombatReactionPatternWithResetTimer
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SCloseCombatReactionPatternWithResetTimer& p_Other) const;
		bool operator!=(const SCloseCombatReactionPatternWithResetTimer& p_Other) const { return !(*this == p_Other); }

		Gameplay::ECloseCombatReaction m_Reaction; // 0x0
		float32 m_Weight; // 0x4
		float32 m_WeightFalloff; // 0x8
		float32 m_SecondsUntilResetAfterFirstFalloff; // 0xC
	};
	ZHM_OFFSET_CHECK(SCloseCombatReactionPatternWithResetTimer, m_Reaction, 0x0);
	ZHM_OFFSET_CHECK(SCloseCombatReactionPatternWithResetTimer, m_Weight, 0x4);
	ZHM_OFFSET_CHECK(SCloseCombatReactionPatternWithResetTimer, m_WeightFalloff, 0x8);
	ZHM_OFFSET_CHECK(SCloseCombatReactionPatternWithResetTimer, m_SecondsUntilResetAfterFirstFalloff, 0xC);
	static_assert(sizeof(SCloseCombatReactionPatternWithResetTimer) == 0x10, "Wrong size for SCloseCombatReactionPatternWithResetTimer");
	static_assert(alignof(SCloseCombatReactionPatternWithResetTimer) == 0x4, "Wrong alignment for SCloseCombatReactionPatternWithResetTimer");

	// Size: 0xC
	class alignas(4) SCloseCombatReactionPatternWithoutResetTimer
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SCloseCombatReactionPatternWithoutResetTimer& p_Other) const;
		bool operator!=(const SCloseCombatReactionPatternWithoutResetTimer& p_Other) const { return !(*this == p_Other); }

		Gameplay::ECloseCombatReaction m_Reaction; // 0x0
		float32 m_Weight; // 0x4
		float32 m_WeightFalloff; // 0x8
	};
	ZHM_OFFSET_CHECK(SCloseCombatReactionPatternWithoutResetTimer, m_Reaction, 0x0);
	ZHM_OFFSET_CHECK(SCloseCombatReactionPatternWithoutResetTimer, m_Weight, 0x4);
	ZHM_OFFSET_CHECK(SCloseCombatReactionPatternWithoutResetTimer, m_WeightFalloff, 0x8);
	static_assert(sizeof(SCloseCombatReactionPatternWithoutResetTimer) == 0xC, "Wrong size for SCloseCombatReactionPatternWithoutResetTimer");
	static_assert(alignof(SCloseCombatReactionPatternWithoutResetTimer) == 0x4, "Wrong alignment for SCloseCombatReactionPatternWithoutResetTimer");

	// Size: 0x2C
	class alignas(4) SCoverSymmetricalFramingConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SCoverSymmetricalFramingConfig& p_Other) const;
		bool operator!=(const SCoverSymmetricalFramingConfig& p_Other) const { return !(*this == p_Other); }

		float32 m_offsetFromCover; // 0x0
		float32 m_offsetInCoverFacing; // 0x4
		float32 m_additionalOffsetInGadgetViewInCoverFacing; // 0x8
		float32 m_additionalOffsetInGadgetViewInCoverUp; // 0xC
		float32 m_offsetWhenCameraIsBehindPlayer; // 0x10
		float32 m_offsetInCoverUp; // 0x14
		float32 m_coverFacingChangeBlendTime; // 0x18
		float32 m_defaultOffsetBlendTime; // 0x1C
		float32 m_inCoverTransitionOffsetBlendTime; // 0x20
		float32 m_inGadgetViewOffsetBlendTime; // 0x24
		float32 m_behindPlayerOffsetBlendTime; // 0x28
	};
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_offsetFromCover, 0x0);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_offsetInCoverFacing, 0x4);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_additionalOffsetInGadgetViewInCoverFacing, 0x8);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_additionalOffsetInGadgetViewInCoverUp, 0xC);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_offsetWhenCameraIsBehindPlayer, 0x10);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_offsetInCoverUp, 0x14);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_coverFacingChangeBlendTime, 0x18);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_defaultOffsetBlendTime, 0x1C);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_inCoverTransitionOffsetBlendTime, 0x20);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_inGadgetViewOffsetBlendTime, 0x24);
	ZHM_OFFSET_CHECK(SCoverSymmetricalFramingConfig, m_behindPlayerOffsetBlendTime, 0x28);
	static_assert(sizeof(SCoverSymmetricalFramingConfig) == 0x2C, "Wrong size for SCoverSymmetricalFramingConfig");
	static_assert(alignof(SCoverSymmetricalFramingConfig) == 0x4, "Wrong alignment for SCoverSymmetricalFramingConfig");

	// Size: 0x18
	class alignas(4) SDoorInteractionFailSafeDurations
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SDoorInteractionFailSafeDurations& p_Other) const;
		bool operator!=(const SDoorInteractionFailSafeDurations& p_Other) const { return !(*this == p_Other); }

		float32 m_approachingToleranceAngleInDegrees; // 0x0
		float32 m_approachingDuration; // 0x4
		float32 m_aligningDuration; // 0x8
		float32 m_waitingForExecutionDuration; // 0xC
		float32 m_successfulExecutingDuration; // 0x10
		float32 m_failureExecutingDuration; // 0x14
	};
	ZHM_OFFSET_CHECK(SDoorInteractionFailSafeDurations, m_approachingToleranceAngleInDegrees, 0x0);
	ZHM_OFFSET_CHECK(SDoorInteractionFailSafeDurations, m_approachingDuration, 0x4);
	ZHM_OFFSET_CHECK(SDoorInteractionFailSafeDurations, m_aligningDuration, 0x8);
	ZHM_OFFSET_CHECK(SDoorInteractionFailSafeDurations, m_waitingForExecutionDuration, 0xC);
	ZHM_OFFSET_CHECK(SDoorInteractionFailSafeDurations, m_successfulExecutingDuration, 0x10);
	ZHM_OFFSET_CHECK(SDoorInteractionFailSafeDurations, m_failureExecutingDuration, 0x14);
	static_assert(sizeof(SDoorInteractionFailSafeDurations) == 0x18, "Wrong size for SDoorInteractionFailSafeDurations");
	static_assert(alignof(SDoorInteractionFailSafeDurations) == 0x4, "Wrong alignment for SDoorInteractionFailSafeDurations");

	// Size: 0x18
	class alignas(4) SInteractionPromptOffsets
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SInteractionPromptOffsets& p_Other) const;
		bool operator!=(const SInteractionPromptOffsets& p_Other) const { return !(*this == p_Other); }

		float32 m_attackFromAboveVerticalOffset; // 0x0
		float32 m_climbLadderVerticalOffset; // 0x4
		float32 m_contextualJumpVerticalOffset; // 0x8
		float32 m_scaleVerticalOffset; // 0xC
		float32 m_takedownVerticalOffset; // 0x10
		float32 m_coverSwapVerticalOffset; // 0x14
	};
	ZHM_OFFSET_CHECK(SInteractionPromptOffsets, m_attackFromAboveVerticalOffset, 0x0);
	ZHM_OFFSET_CHECK(SInteractionPromptOffsets, m_climbLadderVerticalOffset, 0x4);
	ZHM_OFFSET_CHECK(SInteractionPromptOffsets, m_contextualJumpVerticalOffset, 0x8);
	ZHM_OFFSET_CHECK(SInteractionPromptOffsets, m_scaleVerticalOffset, 0xC);
	ZHM_OFFSET_CHECK(SInteractionPromptOffsets, m_takedownVerticalOffset, 0x10);
	ZHM_OFFSET_CHECK(SInteractionPromptOffsets, m_coverSwapVerticalOffset, 0x14);
	static_assert(sizeof(SInteractionPromptOffsets) == 0x18, "Wrong size for SInteractionPromptOffsets");
	static_assert(alignof(SInteractionPromptOffsets) == 0x4, "Wrong alignment for SInteractionPromptOffsets");

	// Size: 0x18
	class alignas(8) SObjectiveUIText
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SObjectiveUIText& p_Other) const;
		bool operator!=(const SObjectiveUIText& p_Other) const { return !(*this == p_Other); }

		ZString m_rawString; // 0x0
		TResourcePtr m_sweetString; // 0x10
	};
	ZHM_OFFSET_CHECK(SObjectiveUIText, m_rawString, 0x0);
	ZHM_OFFSET_CHECK(SObjectiveUIText, m_sweetString, 0x10);
	static_assert(sizeof(SObjectiveUIText) == 0x18, "Wrong size for SObjectiveUIText");
	static_assert(alignof(SObjectiveUIText) == 0x8, "Wrong alignment for SObjectiveUIText");

	// Size: 0x6C
	class alignas(4) SPlayerTactileWorldInteractionConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SPlayerTactileWorldInteractionConfig& p_Other) const;
		bool operator!=(const SPlayerTactileWorldInteractionConfig& p_Other) const { return !(*this == p_Other); }

		bool m_enabled; // 0x0
		Gameplay::STWIAnticipationConfig m_anticipationConfig; // 0x4
		Gameplay::STWITouchConfig m_touchConfig; // 0x2C
		Gameplay::STWIStopsConfig m_stopsConfig; // 0x4C
	};
	ZHM_OFFSET_CHECK(SPlayerTactileWorldInteractionConfig, m_enabled, 0x0);
	ZHM_OFFSET_CHECK(SPlayerTactileWorldInteractionConfig, m_anticipationConfig, 0x4);
	ZHM_OFFSET_CHECK(SPlayerTactileWorldInteractionConfig, m_touchConfig, 0x2C);
	ZHM_OFFSET_CHECK(SPlayerTactileWorldInteractionConfig, m_stopsConfig, 0x4C);
	static_assert(sizeof(SPlayerTactileWorldInteractionConfig) == 0x6C, "Wrong size for SPlayerTactileWorldInteractionConfig");
	static_assert(alignof(SPlayerTactileWorldInteractionConfig) == 0x4, "Wrong alignment for SPlayerTactileWorldInteractionConfig");

	// Size: 0x24
	class alignas(4) SSpycraftPathToTargetConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SSpycraftPathToTargetConfig& p_Other) const;
		bool operator!=(const SSpycraftPathToTargetConfig& p_Other) const { return !(*this == p_Other); }

		float32 m_mappingTolerance; // 0x0
		bool m_allowPlayerOnGuideOverheadLocation; // 0x4
		float32 m_onGuideOverheadThreshold; // 0x8
		SVector3 m_onGuideOverheadOffset; // 0xC
		SVector3 m_hangingOverheadOffset; // 0x18
	};
	ZHM_OFFSET_CHECK(SSpycraftPathToTargetConfig, m_mappingTolerance, 0x0);
	ZHM_OFFSET_CHECK(SSpycraftPathToTargetConfig, m_allowPlayerOnGuideOverheadLocation, 0x4);
	ZHM_OFFSET_CHECK(SSpycraftPathToTargetConfig, m_onGuideOverheadThreshold, 0x8);
	ZHM_OFFSET_CHECK(SSpycraftPathToTargetConfig, m_onGuideOverheadOffset, 0xC);
	ZHM_OFFSET_CHECK(SSpycraftPathToTargetConfig, m_hangingOverheadOffset, 0x18);
	static_assert(sizeof(SSpycraftPathToTargetConfig) == 0x24, "Wrong size for SSpycraftPathToTargetConfig");
	static_assert(alignof(SSpycraftPathToTargetConfig) == 0x4, "Wrong alignment for SSpycraftPathToTargetConfig");

	// Size: 0x110
	class alignas(8) STraversalDashConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const STraversalDashConfig& p_Other) const;
		bool operator!=(const STraversalDashConfig& p_Other) const { return !(*this == p_Other); }

		float32 m_dashMaxDistance; // 0x0
		float32 m_dashMaxDistanceSide; // 0x4
		float32 m_dashMaxDistanceFree; // 0x8
		float32 m_dashMaxDistanceFreeCrouch; // 0xC
		float32 m_dashMaxDistanceNoInput; // 0x10
		float32 m_dashMinDistance; // 0x14
		float32 m_dashMinDistanceFree; // 0x18
		float32 m_dashMinDistanceFreeToCorner; // 0x1C
		float32 m_dashAngleThresholdForCoverCornerSearch; // 0x20
		float32 m_dashAngleToFilterOutTargetsPlayerCoverSide; // 0x24
		float32 m_dashAngleToFilterOutTargetsOppositePlayerCoverSide; // 0x28
		float32 m_dashAngleToFilterOutTargetsWhenPlayerOutOfCover; // 0x2C
		float32 m_dashAngleToFilterOutTargetsWhenPlayerOutOfCoverAndIdle; // 0x30
		float32 m_dashAngleToFilterOutTargetsSideDashTargetMaxAngle; // 0x34
		float32 m_dashAngleToFilterOutTargetsCoverSwapMaxAngle; // 0x38
		float32 m_dashAngleToFilterOutTargetsCoverSwapCornerAngle; // 0x3C
		float32 m_dashAngleToFilterOutTargetsCoverSwapMinDistsance; // 0x40
		Gameplay::EDashCoverSwapFacingMode m_dashCoverSwapFacingMode; // 0x44
		float32 m_dashCoverSwapFacingInputMagnitudeThreshold; // 0x48
		float32 m_dashCoverSwapInputAngleLimit; // 0x4C
		float32 m_dashCoverSwapExtendedAvailabilityTimeDuration; // 0x50
		float32 m_dashCoverSwapExtendedAvailabilityCornerThreshold; // 0x54
		float32 m_dashCoverCornerTargetingRadius; // 0x58
		float32 m_dashCoverCornerTargetingIntersectDistMin; // 0x5C
		float32 m_dashSearchCapsuleRadius; // 0x60
		float32 m_dashSearchCenterOffset; // 0x64
		float32 m_dashSearchWidth; // 0x68
		float32 m_dashSearchWidthSide; // 0x6C
		float32 m_dashSearchHeight; // 0x70
		float32 m_dashSearchBackBoxDistance; // 0x74
		float32 m_dashSearchBackBoxWidth; // 0x78
		float32 m_dashSearchNearCornerFilterRadius; // 0x7C
		float32 m_dashSearchNearCornerRightOffset; // 0x80
		float32 m_dashSearchNearCornerLeftOffset; // 0x84
		float32 m_dashSearchFarCornerRightOffset; // 0x88
		float32 m_dashSearchFarCornerLeftOffset; // 0x8C
		float32 m_dashCooldownFree; // 0x90
		float32 m_dashMaxDuration; // 0x94
		float32 m_dashTargetingScreenSpaceXLeftMargin; // 0x98
		float32 m_dashTargetingScreenSpaceXRightMargin; // 0x9C
		float32 m_dashTargetingScreenSpaceYBottomMargin; // 0xA0
		float32 m_dashTargetingScreenSpaceYTopMargin; // 0xA4
		float32 m_dashToCoverSlideThreshold; // 0xA8
		float32 m_dashToCoverFacingAngleThreshold; // 0xAC
		float32 m_dashToCoverNoInputCameraFacingAngleThreshold; // 0xB0
		ZCurve m_dashCameraBlendPerInputMagnitude; // 0xB8
		Gameplay::EDashTargetingBehaviour m_dashTargetingBehaviour; // 0x100
		Gameplay::EDashStancePolicy m_dashStancePolicy; // 0x104
		bool m_dashTargetingEnabledToNonTaggedCorners; // 0x108
	};
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMaxDistance, 0x0);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMaxDistanceSide, 0x4);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMaxDistanceFree, 0x8);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMaxDistanceFreeCrouch, 0xC);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMaxDistanceNoInput, 0x10);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMinDistance, 0x14);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMinDistanceFree, 0x18);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMinDistanceFreeToCorner, 0x1C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleThresholdForCoverCornerSearch, 0x20);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleToFilterOutTargetsPlayerCoverSide, 0x24);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleToFilterOutTargetsOppositePlayerCoverSide, 0x28);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleToFilterOutTargetsWhenPlayerOutOfCover, 0x2C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleToFilterOutTargetsWhenPlayerOutOfCoverAndIdle, 0x30);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleToFilterOutTargetsSideDashTargetMaxAngle, 0x34);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleToFilterOutTargetsCoverSwapMaxAngle, 0x38);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleToFilterOutTargetsCoverSwapCornerAngle, 0x3C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashAngleToFilterOutTargetsCoverSwapMinDistsance, 0x40);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCoverSwapFacingMode, 0x44);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCoverSwapFacingInputMagnitudeThreshold, 0x48);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCoverSwapInputAngleLimit, 0x4C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCoverSwapExtendedAvailabilityTimeDuration, 0x50);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCoverSwapExtendedAvailabilityCornerThreshold, 0x54);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCoverCornerTargetingRadius, 0x58);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCoverCornerTargetingIntersectDistMin, 0x5C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchCapsuleRadius, 0x60);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchCenterOffset, 0x64);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchWidth, 0x68);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchWidthSide, 0x6C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchHeight, 0x70);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchBackBoxDistance, 0x74);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchBackBoxWidth, 0x78);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchNearCornerFilterRadius, 0x7C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchNearCornerRightOffset, 0x80);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchNearCornerLeftOffset, 0x84);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchFarCornerRightOffset, 0x88);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashSearchFarCornerLeftOffset, 0x8C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCooldownFree, 0x90);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashMaxDuration, 0x94);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashTargetingScreenSpaceXLeftMargin, 0x98);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashTargetingScreenSpaceXRightMargin, 0x9C);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashTargetingScreenSpaceYBottomMargin, 0xA0);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashTargetingScreenSpaceYTopMargin, 0xA4);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashToCoverSlideThreshold, 0xA8);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashToCoverFacingAngleThreshold, 0xAC);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashToCoverNoInputCameraFacingAngleThreshold, 0xB0);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashCameraBlendPerInputMagnitude, 0xB8);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashTargetingBehaviour, 0x100);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashStancePolicy, 0x104);
	ZHM_OFFSET_CHECK(STraversalDashConfig, m_dashTargetingEnabledToNonTaggedCorners, 0x108);
	static_assert(sizeof(STraversalDashConfig) == 0x110, "Wrong size for STraversalDashConfig");
	static_assert(alignof(STraversalDashConfig) == 0x8, "Wrong alignment for STraversalDashConfig");

	// Size: 0x14
	class alignas(4) STraversalSearchAnglesConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const STraversalSearchAnglesConfig& p_Other) const;
		bool operator!=(const STraversalSearchAnglesConfig& p_Other) const { return !(*this == p_Other); }

		float32 m_searchApproachAngleMaxStart; // 0x0
		float32 m_searchApproachAngleMaxEnd; // 0x4
		float32 m_searchDirectionSmoothTime; // 0x8
		float32 m_searchDirectionDampingHalfLife; // 0xC
		float32 m_searchDirectionDampingHalfLifeWhenInputIsTowardsZero; // 0x10
	};
	ZHM_OFFSET_CHECK(STraversalSearchAnglesConfig, m_searchApproachAngleMaxStart, 0x0);
	ZHM_OFFSET_CHECK(STraversalSearchAnglesConfig, m_searchApproachAngleMaxEnd, 0x4);
	ZHM_OFFSET_CHECK(STraversalSearchAnglesConfig, m_searchDirectionSmoothTime, 0x8);
	ZHM_OFFSET_CHECK(STraversalSearchAnglesConfig, m_searchDirectionDampingHalfLife, 0xC);
	ZHM_OFFSET_CHECK(STraversalSearchAnglesConfig, m_searchDirectionDampingHalfLifeWhenInputIsTowardsZero, 0x10);
	static_assert(sizeof(STraversalSearchAnglesConfig) == 0x14, "Wrong size for STraversalSearchAnglesConfig");
	static_assert(alignof(STraversalSearchAnglesConfig) == 0x4, "Wrong alignment for STraversalSearchAnglesConfig");

	// Size: 0x14
	class alignas(4) STraversalSlidingConfig
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const STraversalSlidingConfig& p_Other) const;
		bool operator!=(const STraversalSlidingConfig& p_Other) const { return !(*this == p_Other); }

		bool m_enabledOnlyOnSlidingSurfaces; // 0x0
		float32 m_slideSlopeAngleMin; // 0x4
		float32 m_slideSlopeAngleMax; // 0x8
		float32 m_slideMaxSpeed; // 0xC
		float32 m_slideSidewaysAcceleration; // 0x10
	};
	ZHM_OFFSET_CHECK(STraversalSlidingConfig, m_enabledOnlyOnSlidingSurfaces, 0x0);
	ZHM_OFFSET_CHECK(STraversalSlidingConfig, m_slideSlopeAngleMin, 0x4);
	ZHM_OFFSET_CHECK(STraversalSlidingConfig, m_slideSlopeAngleMax, 0x8);
	ZHM_OFFSET_CHECK(STraversalSlidingConfig, m_slideMaxSpeed, 0xC);
	ZHM_OFFSET_CHECK(STraversalSlidingConfig, m_slideSidewaysAcceleration, 0x10);
	static_assert(sizeof(STraversalSlidingConfig) == 0x14, "Wrong size for STraversalSlidingConfig");
	static_assert(alignof(STraversalSlidingConfig) == 0x4, "Wrong alignment for STraversalSlidingConfig");

	// Size: 0x13C
	class alignas(4) SVehicleCameraConfigurationData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleCameraConfigurationData& p_Other) const;
		bool operator!=(const SVehicleCameraConfigurationData& p_Other) const { return !(*this == p_Other); }

		Gameplay::SVehicleCameraControlsConfig m_inputControls; // 0x0
		Gameplay::SVehicleCameraStatesData m_statesConfig; // 0x14
		Gameplay::SVehicleCameraRollConfiguration m_rollConfig; // 0x130
	};
	ZHM_OFFSET_CHECK(SVehicleCameraConfigurationData, m_inputControls, 0x0);
	ZHM_OFFSET_CHECK(SVehicleCameraConfigurationData, m_statesConfig, 0x14);
	ZHM_OFFSET_CHECK(SVehicleCameraConfigurationData, m_rollConfig, 0x130);
	static_assert(sizeof(SVehicleCameraConfigurationData) == 0x13C, "Wrong size for SVehicleCameraConfigurationData");
	static_assert(alignof(SVehicleCameraConfigurationData) == 0x4, "Wrong alignment for SVehicleCameraConfigurationData");

	// Size: 0xC
	class alignas(4) SVehicleCameraFollowTargetResetData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleCameraFollowTargetResetData& p_Other) const;
		bool operator!=(const SVehicleCameraFollowTargetResetData& p_Other) const { return !(*this == p_Other); }

		float32 m_yaw; // 0x0
		float32 m_pitch; // 0x4
		float32 m_radius; // 0x8
	};
	ZHM_OFFSET_CHECK(SVehicleCameraFollowTargetResetData, m_yaw, 0x0);
	ZHM_OFFSET_CHECK(SVehicleCameraFollowTargetResetData, m_pitch, 0x4);
	ZHM_OFFSET_CHECK(SVehicleCameraFollowTargetResetData, m_radius, 0x8);
	static_assert(sizeof(SVehicleCameraFollowTargetResetData) == 0xC, "Wrong size for SVehicleCameraFollowTargetResetData");
	static_assert(alignof(SVehicleCameraFollowTargetResetData) == 0x4, "Wrong alignment for SVehicleCameraFollowTargetResetData");

	// Size: 0x18
	class alignas(8) SVehicleDriftingDeactivationConditionSet
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SVehicleDriftingDeactivationConditionSet& p_Other) const;
		bool operator!=(const SVehicleDriftingDeactivationConditionSet& p_Other) const { return !(*this == p_Other); }

		TArray<Gameplay::SVehicleDriftingDeactivationCondition> m_conditions; // 0x0
	};
	ZHM_OFFSET_CHECK(SVehicleDriftingDeactivationConditionSet, m_conditions, 0x0);
	static_assert(sizeof(SVehicleDriftingDeactivationConditionSet) == 0x18, "Wrong size for SVehicleDriftingDeactivationConditionSet");
	static_assert(alignof(SVehicleDriftingDeactivationConditionSet) == 0x8, "Wrong alignment for SVehicleDriftingDeactivationConditionSet");

}

namespace Geppetto {
	// Size: 0x4
	enum class EFoleySoundCulling32 : int32_t
	{
		NoAutoSendStop = 0,
		NoDistanceCulling = 1,
	};

	// Size: 0x4
	enum class EFoleySoundEmitter32 : int32_t
	{
		CenterOfMass = 0,
		LeftHand = 1,
		RightHand = 2,
		LeftFoot = 3,
		RightFoot = 4,
		Count = 5,
	};

}

class ICameraEntity
{
public:
	// Size: 0x4
	enum class EProjectionType : int32_t
	{
		ePerspectiveRH = 0,
		eOrtogonalRH = 1,
		eCustom = 2,
	};

};

class ILightEntity
{
public:
	// Size: 0x4
	enum class EFrameIndexStrategy : int32_t
	{
		WRAP = 0,
		CLAMP = 1,
	};

	// Size: 0x1
	enum class ELightType : int8_t
	{
		LT_DIRECTIONAL = 0,
		LT_ENVIRONMENT = 1,
		LT_OMNI = 2,
		LT_SPOT = 3,
		LT_SQUARESPOT = 4,
		LT_CAPSULE = 5,
		LT_AREA_QUAD = 6,
	};

	// Size: 0x4
	enum class ERoomLightFlow : int32_t
	{
		ROOMBEHAVIOR = 0,
		LOCAL = 1,
		ALLROOMS = 2,
	};

	// Size: 0x2
	enum class ESmolderShadowQuality : int16_t
	{
		MINIMUM = 64,
		LOW = 128,
		MEDIUM = 256,
		HIGH = 512,
		VERYHIGH = 1024,
	};

};

namespace IScatterContainerEntity {
	// Size: 0x4
	enum class EBrushType : int32_t
	{
		BRUSH_SQUARE = 0,
		BRUSH_CIRCLE = 1,
	};

	// Size: 0x4
	enum class ECanvasClearMode : int32_t
	{
		CLEAR_ALL = 0,
		CLEAR_INTENSITY = 1,
		CLEAR_SPECIFICMATERIAL = 2,
		CLEAR_ALLMATERIALS = 3,
		CLEAR_SETINTENSITYVALUECLEARMATERIAL = 4,
		CLEAR_SETINTENSITYVALUEKEEPMATERIAL = 5,
		CLEAR_SETINTENSITYVALUEANDMATERIAL = 6,
		CLEAR_SETMATERIALKEEPINTENSITYVALUE = 7,
	};

	// Size: 0x4
	enum class ECanvasSize : int32_t
	{
		SIZE_128 = 0,
		SIZE_256 = 1,
		SIZE_512 = 2,
		SIZE_1024 = 3,
		SIZE_2048 = 4,
		SIZE_4096 = 5,
	};

	// Size: 0x4
	enum class EResizeMode : int32_t
	{
		MODE_CLEAR = 0,
		MODE_KEEPASCENTER = 1,
		MODE_SCALE = 2,
	};

}

// Size: 0x4
enum class _EUIOptionKey : int32_t
{
	UI_OPTION_GAME_VIBRATION = 100,
	UI_OPTION_GAME_VIBRATION_INTENSITY = 101,
	UI_OPTION_GAME_ADAPTIVE_FEEDBACK = 110,
	UI_OPTION_GAME_MOUSE_SENSITIVITY = 336,
	UI_OPTION_GAME_CAMERA_SENSITIVITY = 338,
	UI_OPTION_GAME_MOUSE_SENSITIVITY_X = 339,
	UI_OPTION_GAME_MOUSE_SENSITIVITY_Y = 340,
	UI_OPTION_GAME_CAMERA_SENSITIVITY_X = 341,
	UI_OPTION_GAME_CAMERA_SENSITIVITY_Y = 342,
	UI_OPTION_GAME_CAMERA_DECELERATION = 350,
	UI_OPTION_GAME_CAMERA_DECELERATION_X = 351,
	UI_OPTION_GAME_CAMERA_DECELERATION_Y = 352,
	UI_OPTION_GAME_AID_MISSION_TIMER = 375,
	UI_OPTION_GAME_AID_PICTURE_IN_PICTURE = 380,
	UI_OPTION_GAME_AID_MINI_MAP = 400,
	UI_OPTION_GAME_AID_MINI_MAP_VR = 401,
	UI_OPTION_GAME_FIXED_MAP = 410,
	UI_OPTION_GAME_MAP_SHOW_NORTH_INDICATOR = 420,
	UI_OPTION_GAME_MINI_MAP_SHOW_NPCS = 421,
	UI_OPTION_GAME_MINI_MAP_SHOW_TARGETS = 422,
	UI_OPTION_GAME_AID_INTERACTION_PROMPT = 500,
	UI_OPTION_GAME_LANG_AUDIO = 600,
	UI_OPTION_GAME_LANG_TEXT = 610,
	UI_OPTION_GAME_LANG_TEXT_SIZE = 611,
	UI_OPTION_GAME_ACTIVE_CUSTOM_HUD_PROFILE = 620,
	UI_OPTION_SOUND_ACTIVE_AUDIO_PROFILE = 1000,
	UI_OPTION_SOUND_VOLUME_MASTER = 1010,
	UI_OPTION_SOUND_VOLUME_EFFECTS = 1020,
	UI_OPTION_SOUND_VOLUME_MUSIC = 1030,
	UI_OPTION_SOUND_VOLUME_DIALOGUE = 1040,
	UI_OPTION_SOUND_VOLUME_HAPTICS = 1049,
	UI_OPTION_SOUND_MUTE_MICROPHONE = 1050,
	UI_OPTION_SOUND_MUTE_OTHER_PLAYER = 1060,
	UI_OPTION_SOUND_MUTE_WHEN_MINIMIZED = 1070,
	UI_OPTION_SOUND_LICENSED_MUSIC_DISABLED = 1080,
	UI_OPTION_SOUND_OUTPUTMODE = 1200,
	UI_OPTION_SOUND_DYNAMIC_RANGE_MODE = 1210,
	UI_OPTION_SOUND_DYNAMIC_RANGE_MODE_VR = 1220,
	UI_OPTION_SOUND_MIXPRESET = 1230,
	UI_OPTION_SOUND_EQMODE = 1240,
	UI_OPTION_GRAPHICS_SUBTITLES = 2000,
	UI_OPTION_GRAPHICS_SUBTITLES_SIZE = 2001,
	UI_OPTION_GRAPHICS_SUBTITLES_BGALPHA = 2002,
	UI_OPTION_GRAPHICS_SUBTITLES_BGCOLOR = 2003,
	UI_OPTION_GRAPHICS_SUBTITLES_TEXTCOLOR = 2004,
	UI_OPTION_GRAPHICS_SUBTITLES_VR = 2010,
	UI_OPTION_GRAPHICS_SUBTITLES_SIZE_VR = 2011,
	UI_OPTION_GRAPHICS_SUBTITLES_DIRECTION = 2020,
	UI_OPTION_GRAPHICS_SUBTITLES_SPEAKERNAME = 2021,
	UI_OPTION_GRAPHICS_SUBTITLES_SPEAKERNAME_COLOR = 2022,
	UI_OPTION_GSM_AUTHORITY_BEGIN_MARKER = 2023,
	UI_OPTION_DISPLAY_RESOLUTION = 2230,
	UI_OPTION_DISPLAY_REFRESHRATE = 2240,
	UI_OPTION_DISPLAY_FULLSCREEN = 2250,
	UI_OPTION_DISPLAY_EXCLUSIVE = 2260,
	UI_OPTION_DISPLAY_VSYNC = 2270,
	UI_OPTION_DISPLAY_MONITOR = 2280,
	UI_OPTION_DISPLAY_QUALITY = 2290,
	UI_OPTION_DISPLAY_ASPECT = 2300,
	UI_OPTION_DISPLAY_STEREOSCOPIC = 2310,
	UI_OPTION_DISPLAY_STEREO_DEPTH = 2320,
	UI_OPTION_DISPLAY_STEREO_STRENGTH = 2330,
	UI_OPTION_GRAPHICS_FSR_RESOLUTION = 2400,
	UI_OPTION_GRAPHICS_FSR_IMAGE_SHARPEN = 2401,
	UI_OPTION_GRAPHICS_DLSS_RESOLUTION = 2410,
	UI_OPTION_GRAPHICS_DLSS_RAY_RECONSTRUCTION = 2411,
	UI_OPTION_GRAPHICS_DLSS_FRAME_GEN = 2412,
	UI_OPTION_GRAPHICS_DYNAMIC_RESOLUTION_ENABLED = 2420,
	UI_OPTION_GRAPHICS_DYNAMIC_RESOLUTION_MIN = 2421,
	UI_OPTION_GRAPHICS_DYNAMIC_RESOLUTION_MAX = 2422,
	UI_OPTION_GRAPHICS_QUALITY = 2600,
	UI_OPTION_GRAPHICS_MODE = 2601,
	UI_OPTION_GRAPHICS_SHADOW_QUALITY = 2610,
	UI_OPTION_GRAPHICS_VOLUMETRIC_FOG_QUALITY = 2611,
	UI_OPTION_GRAPHICS_VOLUMETRIC_EFFECTS_QUALITY = 2612,
	UI_OPTION_GRAPHICS_TERRAIN_QUALITY = 2613,
	UI_OPTION_GRAPHICS_GI_QUALITY = 2614,
	UI_OPTION_GRAPHICS_SHADOW_RESOLUTION = 2620,
	UI_OPTION_GRAPHICS_TEXTURE_QUALITY = 2630,
	UI_OPTION_GRAPHICS_TEXTURE_FILTER = 2640,
	UI_OPTION_GRAPHICS_VSYNC = 2660,
	UI_OPTION_GRAPHICS_TESSELLATION = 2680,
	UI_OPTION_GRAPHICS_MIRRORS = 2690,
	UI_OPTION_GRAPHICS_LOD = 2710,
	UI_OPTION_GRAPHICS_BOKEH = 2740,
	UI_OPTION_GRAPHICS_REFLECTION_QUALITY = 2742,
	UI_OPTION_GRAPHICS_MOTION_BLUR = 2743,
	UI_OPTION_GRAPHICS_DYNAMIC_SHARPENING = 2744,
	UI_OPTION_GRAPHICS_SIMULATION_QUALITY = 2745,
	UI_OPTION_GRAPHICS_SSR = 2746,
	UI_OPTION_GRAPHICS_VRS = 2747,
	UI_OPTION_GRAPHICS_ATMOSPHERIC_QUALITY = 2749,
	UI_OPTION_GRAPHICS_SUPER_SAMPLING = 2750,
	UI_OPTION_GRAPHICS_GAMMA = 2760,
	UI_OPTION_GRAPHICS_HDR_BRIGHTNESS = 2761,
	UI_OPTION_GRAPHICS_SDR_TRANSFER_FUNCTION = 2762,
	UI_OPTION_GRAPHICS_RT_PATH_TRACING_MODE = 2764,
	UI_OPTION_GRAPHICS_RT_ENABLED = 2765,
	UI_OPTION_GRAPHICS_RT_SHADOW_QUALITY = 2766,
	UI_OPTION_GRAPHICS_RT_REFLECTION_QUALITY = 2767,
	UI_OPTION_GRAPHICS_SSAA_METHOD = 2768,
	UI_OPTION_GRAPHICS_SSAA_QUALITY = 2769,
	UI_OPTION_GRAPHICS_FRAMERATE_LIMIT = 2770,
	UI_OPTION_GRAPHICS_HDR = 2771,
	UI_OPTION_GSM_AUTHORITY_END_MARKER = 2771,
	UI_OPTION_GRAPHICS_HDR_GAMMA = 2772,
	UI_OPTION_GRAPHICS_RENDERING_QUALITY = 2773,
	UI_OPTION_GRAPHICS_NEUTRAL_LUT_BLEND = 2774,
	UI_OPTION_GRAPHICS_DIFFUSE_COLOR_CLAMP = 2775,
	UI_OPTION_GRAPHICS_GAUSSIANBLUR_ENABLED = 2776,
	UI_OPTION_GRAPHICS_RADIALBLUR_ENABLED = 2777,
	UI_OPTION_GRAPHICS_DISTORTIONWOBBLE_ENABLED = 2778,
	UI_OPTION_GRAPHICS_FILMICGRAIN_ENABLED = 2779,
	UI_OPTION_GRAPHICS_CHROMATICABBERATION_ENABLED = 2780,
	UI_OPTION_GRAPHICS_HDR_UI_BRIGHTNESS = 2781,
	UI_OPTION_GRAPHICS_MOTIONBLUR_ENABLED = 2872,
	UI_OPTION_GRAPHICS_SMOLDER_QUALITY = 2790,
	UI_OPTION_GRAPHICS_VR_QUALITY = 2800,
	UI_OPTION_VR_BLINDERS_ENABLED = 3000,
	UI_OPTION_VR_BLINDERS_STRENGTH = 3001,
	UI_OPTION_VR_TURN_MODE = 3002,
	UI_OPTION_VR_HEAD_BASED_MOVEMENT = 3003,
	UI_OPTION_VR_FADE_ON_COLLISION = 3004,
	UI_OPTION_VR_TURN_RATE = 3005,
	UI_OPTION_VR_TURN_SPEED = 3006,
	UI_OPTION_VR_MINIMUM_REPROJECTION_COLOR = 3007,
	UI_OPTION_VR_LEFT_HAND_FOLLOW_RIGHT = 3008,
	UI_OPTION_VR_SAFE_AREA_ENABLED = 3009,
	UI_OPTION_ACCESSIBILITY_COLORBLIND_MODE = 4000,
	UI_OPTION_ACCESSIBILITY_GLOWMODE_ENABLED = 4010,
	UI_OPTION_ACCESSIBILITY_GLOWMODE_STRENGTH = 4011,
	UI_OPTION_ACCESSIBILITY_DESATURATE_SCREEN_ENABLED = 4012,
	UI_OPTION_ACCESSIBILITY_DESATURATE_CROWDS_ENABLED = 4013,
	UI_OPTION_ACCESSIBILITY_TEXTTOSPEECH_ENABLED = 4210,
	UI_OPTION_ACCESSIBILITY_TEXTTOSPEECH_SPEED = 4211,
	UI_OPTION_ACCESSIBILITY_TEXTTOSPEECH_SELECTION_REPEAT_DELAY = 4212,
	UI_OPTION_ACCESSIBILITY_TEXTTOSPEECH_VOLUME = 4213,
	UI_OPTION_ACCESSIBILITY_TEXTTOSPEECH_PITCH = 4214,
	UI_OPTION_ACCESSIBILITY_TEXTTOSPEECH_VOICE = 4215,
	UI_OPTION_ACCESSIBILITY_CAMERA_SCREEN_SHAKE = 4300,
	UI_OPTION_END = 100000,
};

namespace InputControlNamesp {
	// Size: 0x4
	enum class eHM5InputAction : int32_t
	{
		eIAKBMMoveUp = 0,
		eIAKBMMoveDown = 1,
		eIAKBMMoveLeft = 2,
		eIAKBMMoveRight = 3,
		eIAKBMNotebook = 4,
		eIAKBMCancel = 5,
		eIAKBMAccept = 6,
		eIAKBMMoveHorizontal = 7,
		eIAKBMMoveVertical = 8,
		eIAKBMLookHorizontal = 9,
		eIAKBMLookVertical = 10,
		eIActionsNUM = 11,
	};

	// Size: 0x4
	enum class eHM5InputActionID : int32_t
	{
		eIDButtonFaceDown = 0,
		eIDButtonFaceLeft = 1,
		eIDButtonFaceRight = 2,
		eIDButtonFaceUp = 3,
		eIDBumperLeft = 4,
		eIDBumperRight = 5,
		eIDDpadDown = 6,
		eIDDpadLeft = 7,
		eIDDpadRight = 8,
		eIDDpadUp = 9,
		eIDThumbLeft = 10,
		eIDThumbRight = 11,
		eIDButtonStart = 12,
		eIDButtonSelect = 13,
		eIDTriggerLeft = 14,
		eIDTriggerRight = 15,
		eIDStickLeftHorizontal = 16,
		eIDStickLeftVertical = 17,
		eIDStickRightHorizontal = 18,
		eIDStickRightVertical = 19,
		eIDKeyboard = 20,
		eID_INVALID = 21,
	};

}

namespace InputControllerType {
	// Size: 0x4
	enum class eInputControllerType : int32_t
	{
		eXBoxOne = 0,
		eXBoxSeriesX = 1,
		ePS4 = 2,
		ePS5 = 3,
		eStadia = 4,
		eSwitchJoycon = 5,
		eSwitchPro = 6,
		eSwitch2Joycon = 7,
		eSwitch2Pro = 8,
		ePC_KeyboardMouse = 9,
		ePC_Gamepad = 10,
		eOculusVR = 11,
		eOpenVR = 12,
		eControllerTypeCount = 13,
	};

}

namespace InputOverride {
	class ZActionDeviceConfigEntity
	{
	public:
		// Size: 0x4
		enum class EDeviceType : int32_t
		{
			Gamepad = 1,
			Mouse = 2,
			Keyboard = 4,
		};

	};

}

// Size: 0xC
class alignas(4) SKeyHandle
{
public:
	// Size: 0x4
	enum class EInputValueType : int32_t
	{
		eIT_Digital = 0,
		eIT_Analog = 1,
	};

	// Size: 0x4
	enum class EInputType : int32_t
	{
		eDT_Unknown = 0,
		eDT_Gamepad = 1,
		eDT_Mouse = 2,
		eDT_Keyboard = 3,
	};


public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SKeyHandle& p_Other) const;
	bool operator!=(const SKeyHandle& p_Other) const { return !(*this == p_Other); }

	int32 nInputIndex; // 0x0
	SKeyHandle::EInputType eDeviceType; // 0x4
	SKeyHandle::EInputValueType eInputType; // 0x8
};
ZHM_OFFSET_CHECK(SKeyHandle, nInputIndex, 0x0);
ZHM_OFFSET_CHECK(SKeyHandle, eDeviceType, 0x4);
ZHM_OFFSET_CHECK(SKeyHandle, eInputType, 0x8);
static_assert(sizeof(SKeyHandle) == 0xC, "Wrong size for SKeyHandle");
static_assert(alignof(SKeyHandle) == 0x4, "Wrong alignment for SKeyHandle");

// Size: 0x30
class alignas(8) SColorPickerData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SColorPickerData& p_Other) const;
	bool operator!=(const SColorPickerData& p_Other) const { return !(*this == p_Other); }

	float32 H; // 0x0
	float32 S; // 0x4
	float32 L; // 0x8
	uint32 R; // 0xC
	uint32 G; // 0x10
	uint32 B; // 0x14
	int32 ColorInt; // 0x18
	ZString ColorStr; // 0x20
};
ZHM_OFFSET_CHECK(SColorPickerData, H, 0x0);
ZHM_OFFSET_CHECK(SColorPickerData, S, 0x4);
ZHM_OFFSET_CHECK(SColorPickerData, L, 0x8);
ZHM_OFFSET_CHECK(SColorPickerData, R, 0xC);
ZHM_OFFSET_CHECK(SColorPickerData, G, 0x10);
ZHM_OFFSET_CHECK(SColorPickerData, B, 0x14);
ZHM_OFFSET_CHECK(SColorPickerData, ColorInt, 0x18);
ZHM_OFFSET_CHECK(SColorPickerData, ColorStr, 0x20);
static_assert(sizeof(SColorPickerData) == 0x30, "Wrong size for SColorPickerData");
static_assert(alignof(SColorPickerData) == 0x8, "Wrong alignment for SColorPickerData");

class ZAvailabilityUtil
{
public:
	// Size: 0x4
	enum class EState : int32_t
	{
		Invalid = 0,
		Available = 1,
		DLC_Downloading = 2,
		DLC_Installing = 3,
		DLC_UpdateRequired = 4,
		DLC_NotInstalled = 5,
		DLC_NotOwned = 6,
		DLC_Unknown = 7,
		EntitlementsMissing = 8,
	};

	// Size: 0xC
	class alignas(4) SAvailabilityUtilInfo
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SAvailabilityUtilInfo& p_Other) const;
		bool operator!=(const SAvailabilityUtilInfo& p_Other) const { return !(*this == p_Other); }

		bool IsAvailable; // 0x0
		float32 DownloadProgress; // 0x4
		ZAvailabilityUtil::EState AvailabilityState; // 0x8
	};
	ZHM_OFFSET_CHECK(SAvailabilityUtilInfo, IsAvailable, 0x0);
	ZHM_OFFSET_CHECK(SAvailabilityUtilInfo, DownloadProgress, 0x4);
	ZHM_OFFSET_CHECK(SAvailabilityUtilInfo, AvailabilityState, 0x8);
	static_assert(sizeof(SAvailabilityUtilInfo) == 0xC, "Wrong size for SAvailabilityUtilInfo");
	static_assert(alignof(SAvailabilityUtilInfo) == 0x4, "Wrong alignment for SAvailabilityUtilInfo");

	// Size: 0x20
	class alignas(8) SMissingEntitlementInfo
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SMissingEntitlementInfo& p_Other) const;
		bool operator!=(const SMissingEntitlementInfo& p_Other) const { return !(*this == p_Other); }

		ZString Id; // 0x0
		ZString StoreId; // 0x10
	};
	ZHM_OFFSET_CHECK(SMissingEntitlementInfo, Id, 0x0);
	ZHM_OFFSET_CHECK(SMissingEntitlementInfo, StoreId, 0x10);
	static_assert(sizeof(SMissingEntitlementInfo) == 0x20, "Wrong size for SMissingEntitlementInfo");
	static_assert(alignof(SMissingEntitlementInfo) == 0x8, "Wrong alignment for SMissingEntitlementInfo");

};

// Size: 0x8
class alignas(8) ZTime
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZTime& p_Other) const;
	bool operator!=(const ZTime& p_Other) const { return !(*this == p_Other); }

	uint64 m_nValue; // 0x0
};
ZHM_OFFSET_CHECK(ZTime, m_nValue, 0x0);
static_assert(sizeof(ZTime) == 0x8, "Wrong size for ZTime");
static_assert(alignof(ZTime) == 0x8, "Wrong alignment for ZTime");

namespace onlinebackend {
	// Size: 0x20
	class alignas(8) SPartyChatMessage
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SPartyChatMessage& p_Other) const;
		bool operator!=(const SPartyChatMessage& p_Other) const { return !(*this == p_Other); }

		ZGuid m_authorProfileId; // 0x0
		ZString m_message; // 0x10
	};
	ZHM_OFFSET_CHECK(SPartyChatMessage, m_authorProfileId, 0x0);
	ZHM_OFFSET_CHECK(SPartyChatMessage, m_message, 0x10);
	static_assert(sizeof(SPartyChatMessage) == 0x20, "Wrong size for SPartyChatMessage");
	static_assert(alignof(SPartyChatMessage) == 0x8, "Wrong alignment for SPartyChatMessage");

	// Size: 0x1
	enum class ESocialNotificationType : int8_t
	{
		ContactConnected = 1,
		ContactDisconnected = 2,
		PresenceUpdated = 3,
		PartyInvite = 4,
		JoinRequest = 5,
		PartyUpdate = 6,
		ConnectionEstablished = 7,
	};

	// Size: 0x1
	enum class ESocialStatusType : int8_t
	{
		Offline = 0,
		Online = 1,
		InParty = 2,
		InFullParty = 3,
	};

	// Size: 0x1
	enum class EUnlockableStateChangeFlags : int8_t
	{
		Unlocked = 1,
		QueueItemsAdded = 2,
		Locked = 4,
	};

	// Size: 0xB8
	class alignas(8) SContractEvent
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SContractEvent& p_Other) const;
		bool operator!=(const SContractEvent& p_Other) const { return !(*this == p_Other); }

		ZTime m_createdAt; // 0x0
		ZString m_token; // 0x8
		ZGuid m_id; // 0x18
		ZString m_name; // 0x28
		ZGuid m_userId; // 0x38
		ZGuid m_contractId; // 0x48
		ZString m_sessionId; // 0x58
		ZString m_contractSessionId; // 0x68
		float32 m_timestamp; // 0x78
		ZVariant m_value; // 0x80
		ZString m_origin; // 0x90
		ZString m_version; // 0xA0
		bool m_isReplicated; // 0xB0
		bool m_emitMetrics; // 0xB1
	};
	ZHM_OFFSET_CHECK(SContractEvent, m_createdAt, 0x0);
	ZHM_OFFSET_CHECK(SContractEvent, m_token, 0x8);
	ZHM_OFFSET_CHECK(SContractEvent, m_id, 0x18);
	ZHM_OFFSET_CHECK(SContractEvent, m_name, 0x28);
	ZHM_OFFSET_CHECK(SContractEvent, m_userId, 0x38);
	ZHM_OFFSET_CHECK(SContractEvent, m_contractId, 0x48);
	ZHM_OFFSET_CHECK(SContractEvent, m_sessionId, 0x58);
	ZHM_OFFSET_CHECK(SContractEvent, m_contractSessionId, 0x68);
	ZHM_OFFSET_CHECK(SContractEvent, m_timestamp, 0x78);
	ZHM_OFFSET_CHECK(SContractEvent, m_value, 0x80);
	ZHM_OFFSET_CHECK(SContractEvent, m_origin, 0x90);
	ZHM_OFFSET_CHECK(SContractEvent, m_version, 0xA0);
	ZHM_OFFSET_CHECK(SContractEvent, m_isReplicated, 0xB0);
	ZHM_OFFSET_CHECK(SContractEvent, m_emitMetrics, 0xB1);
	static_assert(sizeof(SContractEvent) == 0xB8, "Wrong size for SContractEvent");
	static_assert(alignof(SContractEvent) == 0x8, "Wrong alignment for SContractEvent");

	// Size: 0x40
	class alignas(8) SPartyUpdate
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SPartyUpdate& p_Other) const;
		bool operator!=(const SPartyUpdate& p_Other) const { return !(*this == p_Other); }

		ZGuid m_joinedUserId; // 0x0
		ZGuid m_leftUserId; // 0x10
		onlinebackend::SPartyChatMessage m_chatMessage; // 0x20
	};
	ZHM_OFFSET_CHECK(SPartyUpdate, m_joinedUserId, 0x0);
	ZHM_OFFSET_CHECK(SPartyUpdate, m_leftUserId, 0x10);
	ZHM_OFFSET_CHECK(SPartyUpdate, m_chatMessage, 0x20);
	static_assert(sizeof(SPartyUpdate) == 0x40, "Wrong size for SPartyUpdate");
	static_assert(alignof(SPartyUpdate) == 0x8, "Wrong alignment for SPartyUpdate");

}

namespace UnlockableService {
	// Size: 0x18
	class alignas(8) SUnlockableItem
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SUnlockableItem& p_Other) const;
		bool operator!=(const SUnlockableItem& p_Other) const { return !(*this == p_Other); }

		ZString m_id; // 0x0
		uint32 m_amount; // 0x10
	};
	ZHM_OFFSET_CHECK(SUnlockableItem, m_id, 0x0);
	ZHM_OFFSET_CHECK(SUnlockableItem, m_amount, 0x10);
	static_assert(sizeof(SUnlockableItem) == 0x18, "Wrong size for SUnlockableItem");
	static_assert(alignof(SUnlockableItem) == 0x8, "Wrong alignment for SUnlockableItem");

	// Size: 0x4
	enum class EUnlockableUnlockState : int32_t
	{
		Locked = 0,
		Unlocked = 1,
	};

	// Size: 0x28
	class alignas(8) SUnlockableDefinition
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SUnlockableDefinition& p_Other) const;
		bool operator!=(const SUnlockableDefinition& p_Other) const { return !(*this == p_Other); }

		ZGuid m_id; // 0x0
		TArray<UnlockableService::SUnlockableItem> m_grantedItems; // 0x10
	};
	ZHM_OFFSET_CHECK(SUnlockableDefinition, m_id, 0x0);
	ZHM_OFFSET_CHECK(SUnlockableDefinition, m_grantedItems, 0x10);
	static_assert(sizeof(SUnlockableDefinition) == 0x28, "Wrong size for SUnlockableDefinition");
	static_assert(alignof(SUnlockableDefinition) == 0x8, "Wrong alignment for SUnlockableDefinition");

	// Size: 0x28
	class alignas(8) SUnlockableQueueItem
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SUnlockableQueueItem& p_Other) const;
		bool operator!=(const SUnlockableQueueItem& p_Other) const { return !(*this == p_Other); }

		ZGuid m_id; // 0x0
		UnlockableService::SUnlockableItem m_item; // 0x10
	};
	ZHM_OFFSET_CHECK(SUnlockableQueueItem, m_id, 0x0);
	ZHM_OFFSET_CHECK(SUnlockableQueueItem, m_item, 0x10);
	static_assert(sizeof(SUnlockableQueueItem) == 0x28, "Wrong size for SUnlockableQueueItem");
	static_assert(alignof(SUnlockableQueueItem) == 0x8, "Wrong alignment for SUnlockableQueueItem");

	// Size: 0x18
	class alignas(8) SUnlockableState
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SUnlockableState& p_Other) const;
		bool operator!=(const SUnlockableState& p_Other) const { return !(*this == p_Other); }

		ZGuid m_id; // 0x0
		UnlockableService::EUnlockableUnlockState m_state; // 0x10
	};
	ZHM_OFFSET_CHECK(SUnlockableState, m_id, 0x0);
	ZHM_OFFSET_CHECK(SUnlockableState, m_state, 0x10);
	static_assert(sizeof(SUnlockableState) == 0x18, "Wrong size for SUnlockableState");
	static_assert(alignof(SUnlockableState) == 0x8, "Wrong alignment for SUnlockableState");

	// Size: 0x28
	class alignas(8) SUnlockableStateChangedNotification
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SUnlockableStateChangedNotification& p_Other) const;
		bool operator!=(const SUnlockableStateChangedNotification& p_Other) const { return !(*this == p_Other); }

		ZGuid m_profileId; // 0x0
		ZGuid m_unlockableId; // 0x10
		onlinebackend::EUnlockableStateChangeFlags m_changeFlags; // 0x20
	};
	ZHM_OFFSET_CHECK(SUnlockableStateChangedNotification, m_profileId, 0x0);
	ZHM_OFFSET_CHECK(SUnlockableStateChangedNotification, m_unlockableId, 0x10);
	ZHM_OFFSET_CHECK(SUnlockableStateChangedNotification, m_changeFlags, 0x20);
	static_assert(sizeof(SUnlockableStateChangedNotification) == 0x28, "Wrong size for SUnlockableStateChangedNotification");
	static_assert(alignof(SUnlockableStateChangedNotification) == 0x8, "Wrong alignment for SUnlockableStateChangedNotification");

}

// Size: 0x18
class alignas(8) SDebugMenuItemIntEntry
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDebugMenuItemIntEntry& p_Other) const;
	bool operator!=(const SDebugMenuItemIntEntry& p_Other) const { return !(*this == p_Other); }

	int32 Value; // 0x0
	ZString Name; // 0x8
};
ZHM_OFFSET_CHECK(SDebugMenuItemIntEntry, Value, 0x0);
ZHM_OFFSET_CHECK(SDebugMenuItemIntEntry, Name, 0x8);
static_assert(sizeof(SDebugMenuItemIntEntry) == 0x18, "Wrong size for SDebugMenuItemIntEntry");
static_assert(alignof(SDebugMenuItemIntEntry) == 0x8, "Wrong alignment for SDebugMenuItemIntEntry");

// Size: 0xC
class alignas(4) SDebugMenuItemSliderConfig
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SDebugMenuItemSliderConfig& p_Other) const;
	bool operator!=(const SDebugMenuItemSliderConfig& p_Other) const { return !(*this == p_Other); }

	float32 RangeMin; // 0x0
	float32 RangeMax; // 0x4
	float32 Step; // 0x8
};
ZHM_OFFSET_CHECK(SDebugMenuItemSliderConfig, RangeMin, 0x0);
ZHM_OFFSET_CHECK(SDebugMenuItemSliderConfig, RangeMax, 0x4);
ZHM_OFFSET_CHECK(SDebugMenuItemSliderConfig, Step, 0x8);
static_assert(sizeof(SDebugMenuItemSliderConfig) == 0xC, "Wrong size for SDebugMenuItemSliderConfig");
static_assert(alignof(SDebugMenuItemSliderConfig) == 0x4, "Wrong alignment for SDebugMenuItemSliderConfig");

namespace KntLoadoutCollection {
	// Size: 0x1
	enum class EGameMode : int8_t
	{
		TacSimAndCampaign = 0,
		TacSim = 1,
		Campaign = 2,
	};

	// Size: 0x1
	enum class EOwnership : int8_t
	{
		Owned = 0,
		Locked = 1,
		LockedByCheckpoint = 2,
	};

}

class ZGameLoadoutManager
{
public:
	// Size: 0x4
	enum class EFirearmSlot : int32_t
	{
		FirearmOneHanded = 0,
		FirearmTwoHanded = 1,
		FirearmSpecial = 2,
		Count = 3,
	};

	// Size: 0x4
	enum class ELoadoutGadgetUpgradeSlots : int32_t
	{
		Slot1 = 0,
		Slot2 = 1,
		Slot3 = 2,
	};

};

// Size: 0xC
class alignas(4) SInputOverrideInputData
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SInputOverrideInputData& p_Other) const;
	bool operator!=(const SInputOverrideInputData& p_Other) const { return !(*this == p_Other); }

	EEInputDevice m_device; // 0x0
	uint32 m_digital; // 0x4
	uint32 m_analog; // 0x8
};
ZHM_OFFSET_CHECK(SInputOverrideInputData, m_device, 0x0);
ZHM_OFFSET_CHECK(SInputOverrideInputData, m_digital, 0x4);
ZHM_OFFSET_CHECK(SInputOverrideInputData, m_analog, 0x8);
static_assert(sizeof(SInputOverrideInputData) == 0xC, "Wrong size for SInputOverrideInputData");
static_assert(alignof(SInputOverrideInputData) == 0x4, "Wrong alignment for SInputOverrideInputData");

// Size: 0x20
class alignas(4) SInputOverrideRequest
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const SInputOverrideRequest& p_Other) const;
	bool operator!=(const SInputOverrideRequest& p_Other) const { return !(*this == p_Other); }

	EEGestureType m_gestureType; // 0x0
	uint32 m_gestureTypeData; // 0x4
	float32 m_triggerDuration; // 0x8
	float32 m_inputLifetime; // 0xC
	EActionMultiply m_actionMultiply; // 0x10
	SInputOverrideInputData m_inputData; // 0x14
};
ZHM_OFFSET_CHECK(SInputOverrideRequest, m_gestureType, 0x0);
ZHM_OFFSET_CHECK(SInputOverrideRequest, m_gestureTypeData, 0x4);
ZHM_OFFSET_CHECK(SInputOverrideRequest, m_triggerDuration, 0x8);
ZHM_OFFSET_CHECK(SInputOverrideRequest, m_inputLifetime, 0xC);
ZHM_OFFSET_CHECK(SInputOverrideRequest, m_actionMultiply, 0x10);
ZHM_OFFSET_CHECK(SInputOverrideRequest, m_inputData, 0x14);
static_assert(sizeof(SInputOverrideRequest) == 0x20, "Wrong size for SInputOverrideRequest");
static_assert(alignof(SInputOverrideRequest) == 0x4, "Wrong alignment for SInputOverrideRequest");

// Size: 0x10
class alignas(8) ZDynamicObject
{
public:
	static ZHMTypeInfo TypeInfo;
	static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
	static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
	static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
	static bool Equals(void* p_Left, void* p_Right);
	static void Destroy(void* p_Object);

	bool operator==(const ZDynamicObject& p_Other) const;
	bool operator!=(const ZDynamicObject& p_Other) const { return !(*this == p_Other); }

	ZVariant m_value; // 0x0
};
ZHM_OFFSET_CHECK(ZDynamicObject, m_value, 0x0);
static_assert(sizeof(ZDynamicObject) == 0x10, "Wrong size for ZDynamicObject");
static_assert(alignof(ZDynamicObject) == 0x8, "Wrong alignment for ZDynamicObject");

class ZSubtitleTypeConfig
{
public:
	// Size: 0x4
	enum class EDirectionIndicatorType : int32_t
	{
		Disabled = 0,
		OnlyShowWhenOffScreen = 1,
		AlwaysShow = 2,
	};

};

namespace JSONTemplate {
	// Size: 0x8
	class alignas(4) SUIInputActionGestureConfigData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SUIInputActionGestureConfigData& p_Other) const;
		bool operator!=(const SUIInputActionGestureConfigData& p_Other) const { return !(*this == p_Other); }

		EEGestureType GestureType; // 0x0
		uint32 GestureTypeData; // 0x4
	};
	ZHM_OFFSET_CHECK(SUIInputActionGestureConfigData, GestureType, 0x0);
	ZHM_OFFSET_CHECK(SUIInputActionGestureConfigData, GestureTypeData, 0x4);
	static_assert(sizeof(SUIInputActionGestureConfigData) == 0x8, "Wrong size for SUIInputActionGestureConfigData");
	static_assert(alignof(SUIInputActionGestureConfigData) == 0x4, "Wrong alignment for SUIInputActionGestureConfigData");

	// Size: 0x40
	class alignas(8) SUIInputActionPromptData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SUIInputActionPromptData& p_Other) const;
		bool operator!=(const SUIInputActionPromptData& p_Other) const { return !(*this == p_Other); }

		uint32 ActionID; // 0x0
		int32 IconID; // 0x4
		ZString ActionGlyph; // 0x8
		ZString Platform; // 0x18
		JSONTemplate::SUIInputActionGestureConfigData GestureData; // 0x28
		bool IsAxisInverted; // 0x30
		bool IsPressed; // 0x31
		SKeyHandle KeyHandle; // 0x34
	};
	ZHM_OFFSET_CHECK(SUIInputActionPromptData, ActionID, 0x0);
	ZHM_OFFSET_CHECK(SUIInputActionPromptData, IconID, 0x4);
	ZHM_OFFSET_CHECK(SUIInputActionPromptData, ActionGlyph, 0x8);
	ZHM_OFFSET_CHECK(SUIInputActionPromptData, Platform, 0x18);
	ZHM_OFFSET_CHECK(SUIInputActionPromptData, GestureData, 0x28);
	ZHM_OFFSET_CHECK(SUIInputActionPromptData, IsAxisInverted, 0x30);
	ZHM_OFFSET_CHECK(SUIInputActionPromptData, IsPressed, 0x31);
	ZHM_OFFSET_CHECK(SUIInputActionPromptData, KeyHandle, 0x34);
	static_assert(sizeof(SUIInputActionPromptData) == 0x40, "Wrong size for SUIInputActionPromptData");
	static_assert(alignof(SUIInputActionPromptData) == 0x8, "Wrong alignment for SUIInputActionPromptData");

	// Size: 0x20
	class alignas(8) SUIInputActionCombinationData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SUIInputActionCombinationData& p_Other) const;
		bool operator!=(const SUIInputActionCombinationData& p_Other) const { return !(*this == p_Other); }

		TArray<JSONTemplate::SUIInputActionPromptData> Prompts; // 0x0
		ECombinationMethod Method; // 0x18
	};
	ZHM_OFFSET_CHECK(SUIInputActionCombinationData, Prompts, 0x0);
	ZHM_OFFSET_CHECK(SUIInputActionCombinationData, Method, 0x18);
	static_assert(sizeof(SUIInputActionCombinationData) == 0x20, "Wrong size for SUIInputActionCombinationData");
	static_assert(alignof(SUIInputActionCombinationData) == 0x8, "Wrong alignment for SUIInputActionCombinationData");

	// Size: 0xA
	class alignas(2) SShotMaskDateTime
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SShotMaskDateTime& p_Other) const;
		bool operator!=(const SShotMaskDateTime& p_Other) const { return !(*this == p_Other); }

		int16 m_nYear; // 0x0
		int16 m_nMonth; // 0x2
		int16 m_nDay; // 0x4
		int16 m_nHour; // 0x6
		int16 m_nMinute; // 0x8
	};
	ZHM_OFFSET_CHECK(SShotMaskDateTime, m_nYear, 0x0);
	ZHM_OFFSET_CHECK(SShotMaskDateTime, m_nMonth, 0x2);
	ZHM_OFFSET_CHECK(SShotMaskDateTime, m_nDay, 0x4);
	ZHM_OFFSET_CHECK(SShotMaskDateTime, m_nHour, 0x6);
	ZHM_OFFSET_CHECK(SShotMaskDateTime, m_nMinute, 0x8);
	static_assert(sizeof(SShotMaskDateTime) == 0xA, "Wrong size for SShotMaskDateTime");
	static_assert(alignof(SShotMaskDateTime) == 0x2, "Wrong alignment for SShotMaskDateTime");

	// Size: 0x20
	class alignas(8) SArrayTestDataItem
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SArrayTestDataItem& p_Other) const;
		bool operator!=(const SArrayTestDataItem& p_Other) const { return !(*this == p_Other); }

		int32 Id; // 0x0
		ZString Name; // 0x8
		int32 Count; // 0x18
	};
	ZHM_OFFSET_CHECK(SArrayTestDataItem, Id, 0x0);
	ZHM_OFFSET_CHECK(SArrayTestDataItem, Name, 0x8);
	ZHM_OFFSET_CHECK(SArrayTestDataItem, Count, 0x18);
	static_assert(sizeof(SArrayTestDataItem) == 0x20, "Wrong size for SArrayTestDataItem");
	static_assert(alignof(SArrayTestDataItem) == 0x8, "Wrong alignment for SArrayTestDataItem");

	// Size: 0x20
	class alignas(8) SAudioProfileOptionUIData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SAudioProfileOptionUIData& p_Other) const;
		bool operator!=(const SAudioProfileOptionUIData& p_Other) const { return !(*this == p_Other); }

		ZString Name; // 0x0
		ZVariant Value; // 0x10
	};
	ZHM_OFFSET_CHECK(SAudioProfileOptionUIData, Name, 0x0);
	ZHM_OFFSET_CHECK(SAudioProfileOptionUIData, Value, 0x10);
	static_assert(sizeof(SAudioProfileOptionUIData) == 0x20, "Wrong size for SAudioProfileOptionUIData");
	static_assert(alignof(SAudioProfileOptionUIData) == 0x8, "Wrong alignment for SAudioProfileOptionUIData");

	// Size: 0x88
	class alignas(8) SInputOverrideRequestConflictItemData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SInputOverrideRequestConflictItemData& p_Other) const;
		bool operator!=(const SInputOverrideRequestConflictItemData& p_Other) const { return !(*this == p_Other); }

		JSONTemplate::SUIInputActionPromptData ConflictedPrompt; // 0x0
		JSONTemplate::SUIInputActionPromptData ResolutionPrompt; // 0x40
		EInputOverrideConflictResolutionType ResolutionType; // 0x80
	};
	ZHM_OFFSET_CHECK(SInputOverrideRequestConflictItemData, ConflictedPrompt, 0x0);
	ZHM_OFFSET_CHECK(SInputOverrideRequestConflictItemData, ResolutionPrompt, 0x40);
	ZHM_OFFSET_CHECK(SInputOverrideRequestConflictItemData, ResolutionType, 0x80);
	static_assert(sizeof(SInputOverrideRequestConflictItemData) == 0x88, "Wrong size for SInputOverrideRequestConflictItemData");
	static_assert(alignof(SInputOverrideRequestConflictItemData) == 0x8, "Wrong alignment for SInputOverrideRequestConflictItemData");

	// Size: 0x80
	class alignas(8) SChallengeStateData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SChallengeStateData& p_Other) const;
		bool operator!=(const SChallengeStateData& p_Other) const { return !(*this == p_Other); }

		ZGuid Id; // 0x0
		ZString Title; // 0x10
		ZString Description; // 0x20
		ZString Image; // 0x30
		ZString HighResImage; // 0x40
		int32 XP; // 0x50
		int32 Intel; // 0x54
		ChallengesService::EChallengeCompletionState CompletionState; // 0x58
		int32 ProgressCurrent; // 0x5C
		int32 ProgressMax; // 0x60
		bool IsNew; // 0x64
		bool IsSpoiler; // 0x65
		TArray<ZString> Tags; // 0x68
	};
	ZHM_OFFSET_CHECK(SChallengeStateData, Id, 0x0);
	ZHM_OFFSET_CHECK(SChallengeStateData, Title, 0x10);
	ZHM_OFFSET_CHECK(SChallengeStateData, Description, 0x20);
	ZHM_OFFSET_CHECK(SChallengeStateData, Image, 0x30);
	ZHM_OFFSET_CHECK(SChallengeStateData, HighResImage, 0x40);
	ZHM_OFFSET_CHECK(SChallengeStateData, XP, 0x50);
	ZHM_OFFSET_CHECK(SChallengeStateData, Intel, 0x54);
	ZHM_OFFSET_CHECK(SChallengeStateData, CompletionState, 0x58);
	ZHM_OFFSET_CHECK(SChallengeStateData, ProgressCurrent, 0x5C);
	ZHM_OFFSET_CHECK(SChallengeStateData, ProgressMax, 0x60);
	ZHM_OFFSET_CHECK(SChallengeStateData, IsNew, 0x64);
	ZHM_OFFSET_CHECK(SChallengeStateData, IsSpoiler, 0x65);
	ZHM_OFFSET_CHECK(SChallengeStateData, Tags, 0x68);
	static_assert(sizeof(SChallengeStateData) == 0x80, "Wrong size for SChallengeStateData");
	static_assert(alignof(SChallengeStateData) == 0x8, "Wrong alignment for SChallengeStateData");

	// Size: 0x4
	enum class EControllerLayoutInputType : int32_t
	{
		Invalid = 0,
		Hold = 1,
		Click = 2,
	};

	// Size: 0x4
	enum class EDebugMenuItemType : int32_t
	{
		Invalid = 0,
		Group = 1,
		Trigger = 2,
		Bool = 3,
		Slider = 4,
		ListInt = 5,
	};

	// Size: 0x80
	class alignas(8) SDebugMenuItemData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SDebugMenuItemData& p_Other) const;
		bool operator!=(const SDebugMenuItemData& p_Other) const { return !(*this == p_Other); }

		JSONTemplate::EDebugMenuItemType Type; // 0x0
		ZString TypeName; // 0x8
		ZString Id; // 0x18
		ZString Name; // 0x28
		int32 OrderIndex; // 0x38
		TArray<SDebugMenuItemIntEntry> ValueEntries; // 0x40
		TArray<JSONTemplate::SDebugMenuItemData> Children; // 0x58
		SDebugMenuItemSliderConfig SliderConfig; // 0x70
	};
	ZHM_OFFSET_CHECK(SDebugMenuItemData, Type, 0x0);
	ZHM_OFFSET_CHECK(SDebugMenuItemData, TypeName, 0x8);
	ZHM_OFFSET_CHECK(SDebugMenuItemData, Id, 0x18);
	ZHM_OFFSET_CHECK(SDebugMenuItemData, Name, 0x28);
	ZHM_OFFSET_CHECK(SDebugMenuItemData, OrderIndex, 0x38);
	ZHM_OFFSET_CHECK(SDebugMenuItemData, ValueEntries, 0x40);
	ZHM_OFFSET_CHECK(SDebugMenuItemData, Children, 0x58);
	ZHM_OFFSET_CHECK(SDebugMenuItemData, SliderConfig, 0x70);
	static_assert(sizeof(SDebugMenuItemData) == 0x80, "Wrong size for SDebugMenuItemData");
	static_assert(alignof(SDebugMenuItemData) == 0x8, "Wrong alignment for SDebugMenuItemData");

	// Size: 0x48
	class alignas(8) SGadgetUpgradeItemData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SGadgetUpgradeItemData& p_Other) const;
		bool operator!=(const SGadgetUpgradeItemData& p_Other) const { return !(*this == p_Other); }

		ZString Id; // 0x0
		ZString Title; // 0x10
		ZString Description; // 0x20
		ZString Image; // 0x30
		bool IsLocked; // 0x40
	};
	ZHM_OFFSET_CHECK(SGadgetUpgradeItemData, Id, 0x0);
	ZHM_OFFSET_CHECK(SGadgetUpgradeItemData, Title, 0x10);
	ZHM_OFFSET_CHECK(SGadgetUpgradeItemData, Description, 0x20);
	ZHM_OFFSET_CHECK(SGadgetUpgradeItemData, Image, 0x30);
	ZHM_OFFSET_CHECK(SGadgetUpgradeItemData, IsLocked, 0x40);
	static_assert(sizeof(SGadgetUpgradeItemData) == 0x48, "Wrong size for SGadgetUpgradeItemData");
	static_assert(alignof(SGadgetUpgradeItemData) == 0x8, "Wrong alignment for SGadgetUpgradeItemData");

	// Size: 0xB8
	class alignas(8) SGadgetItemData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SGadgetItemData& p_Other) const;
		bool operator!=(const SGadgetItemData& p_Other) const { return !(*this == p_Other); }

		ZString GadgetEntityID; // 0x0
		ZString ResourceID; // 0x10
		uint32 ResourceType; // 0x20
		float32 ActivationCost; // 0x24
		ZString Type; // 0x28
		ZString Title; // 0x38
		ZString Description; // 0x48
		ZString DescriptionShort; // 0x58
		ZString Image; // 0x68
		ZString Thumbnail; // 0x78
		ZString Icon; // 0x88
		ZString Video; // 0x98
		KntLoadoutCollection::EGameMode GameModeAvailability; // 0xA8
		KntLoadoutCollection::EOwnership OwnershipState; // 0xA9
		bool IsMandatory; // 0xAA
		bool IsRecommended; // 0xAB
		bool IsLocked; // 0xAC
		int32 UpgradeSlotsUnlockedCount; // 0xB0
		int32 UpgradeSlotsTotalCount; // 0xB4
	};
	ZHM_OFFSET_CHECK(SGadgetItemData, GadgetEntityID, 0x0);
	ZHM_OFFSET_CHECK(SGadgetItemData, ResourceID, 0x10);
	ZHM_OFFSET_CHECK(SGadgetItemData, ResourceType, 0x20);
	ZHM_OFFSET_CHECK(SGadgetItemData, ActivationCost, 0x24);
	ZHM_OFFSET_CHECK(SGadgetItemData, Type, 0x28);
	ZHM_OFFSET_CHECK(SGadgetItemData, Title, 0x38);
	ZHM_OFFSET_CHECK(SGadgetItemData, Description, 0x48);
	ZHM_OFFSET_CHECK(SGadgetItemData, DescriptionShort, 0x58);
	ZHM_OFFSET_CHECK(SGadgetItemData, Image, 0x68);
	ZHM_OFFSET_CHECK(SGadgetItemData, Thumbnail, 0x78);
	ZHM_OFFSET_CHECK(SGadgetItemData, Icon, 0x88);
	ZHM_OFFSET_CHECK(SGadgetItemData, Video, 0x98);
	ZHM_OFFSET_CHECK(SGadgetItemData, GameModeAvailability, 0xA8);
	ZHM_OFFSET_CHECK(SGadgetItemData, OwnershipState, 0xA9);
	ZHM_OFFSET_CHECK(SGadgetItemData, IsMandatory, 0xAA);
	ZHM_OFFSET_CHECK(SGadgetItemData, IsRecommended, 0xAB);
	ZHM_OFFSET_CHECK(SGadgetItemData, IsLocked, 0xAC);
	ZHM_OFFSET_CHECK(SGadgetItemData, UpgradeSlotsUnlockedCount, 0xB0);
	ZHM_OFFSET_CHECK(SGadgetItemData, UpgradeSlotsTotalCount, 0xB4);
	static_assert(sizeof(SGadgetItemData) == 0xB8, "Wrong size for SGadgetItemData");
	static_assert(alignof(SGadgetItemData) == 0x8, "Wrong alignment for SGadgetItemData");

	// Size: 0x98
	class alignas(8) SFirearmData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SFirearmData& p_Other) const;
		bool operator!=(const SFirearmData& p_Other) const { return !(*this == p_Other); }

		ZString Id; // 0x0
		ZString ResourceId; // 0x10
		ZString Title; // 0x20
		ZString Description; // 0x30
		ZString IconId; // 0x40
		ZString Image; // 0x50
		ZString HighResImage; // 0x60
		ZString CategoryId; // 0x70
		ZString CategoryTitle; // 0x80
		KntLoadoutCollection::EGameMode GameModeAvailability; // 0x90
		bool Locked; // 0x91
		bool IsEquipped; // 0x92
		ZGameLoadoutManager::EFirearmSlot Slot; // 0x94
	};
	ZHM_OFFSET_CHECK(SFirearmData, Id, 0x0);
	ZHM_OFFSET_CHECK(SFirearmData, ResourceId, 0x10);
	ZHM_OFFSET_CHECK(SFirearmData, Title, 0x20);
	ZHM_OFFSET_CHECK(SFirearmData, Description, 0x30);
	ZHM_OFFSET_CHECK(SFirearmData, IconId, 0x40);
	ZHM_OFFSET_CHECK(SFirearmData, Image, 0x50);
	ZHM_OFFSET_CHECK(SFirearmData, HighResImage, 0x60);
	ZHM_OFFSET_CHECK(SFirearmData, CategoryId, 0x70);
	ZHM_OFFSET_CHECK(SFirearmData, CategoryTitle, 0x80);
	ZHM_OFFSET_CHECK(SFirearmData, GameModeAvailability, 0x90);
	ZHM_OFFSET_CHECK(SFirearmData, Locked, 0x91);
	ZHM_OFFSET_CHECK(SFirearmData, IsEquipped, 0x92);
	ZHM_OFFSET_CHECK(SFirearmData, Slot, 0x94);
	static_assert(sizeof(SFirearmData) == 0x98, "Wrong size for SFirearmData");
	static_assert(alignof(SFirearmData) == 0x8, "Wrong alignment for SFirearmData");

	// Size: 0x38
	class alignas(8) SGameChangerData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SGameChangerData& p_Other) const;
		bool operator!=(const SGameChangerData& p_Other) const { return !(*this == p_Other); }

		ZString Title; // 0x0
		ZString Description; // 0x10
		ZString ShortDescription; // 0x20
		uint32 IconType; // 0x30
	};
	ZHM_OFFSET_CHECK(SGameChangerData, Title, 0x0);
	ZHM_OFFSET_CHECK(SGameChangerData, Description, 0x10);
	ZHM_OFFSET_CHECK(SGameChangerData, ShortDescription, 0x20);
	ZHM_OFFSET_CHECK(SGameChangerData, IconType, 0x30);
	static_assert(sizeof(SGameChangerData) == 0x38, "Wrong size for SGameChangerData");
	static_assert(alignof(SGameChangerData) == 0x8, "Wrong alignment for SGameChangerData");

	// Size: 0xA8
	class alignas(8) SGameObjectiveOpportunityData
	{
	public:
		static ZHMTypeInfo TypeInfo;
		static void WriteSimpleJson(void* p_Object, std::ostream& p_Stream);
		static void FromSimpleJson(simdjson::ondemand::value p_Document, void* p_Target);
		static void Serialize(void* p_Object, ZHMSerializer& p_Serializer, zhmptr_t p_OwnOffset);
		static bool Equals(void* p_Left, void* p_Right);
		static void Destroy(void* p_Object);

		bool operator==(const SGameObjectiveOpportunityData& p_Other) const;
		bool operator!=(const SGameObjectiveOpportunityData& p_Other) const { return !(*this == p_Other); }

		ZString OpportunityID; // 0x0
		ZString OpportunityTitle; // 0x10
		ZString OpportunityDescription; // 0x20
		ZString OpportunityImage; // 0x30
		Gameplay::EObjectiveUIState OpportunityState; // 0x40
		ZString OpportunityStateHeadline; // 0x48
		ZString OpportunityStateDescription; // 0x58
